Repository: rajpal-1/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: series: Treat each series independently; overall: All series use the same scale; change: Show changes compared to the first data point in each series
ar: السلسلة: تعامل مع كل سلسلة بشكل مستقل؛ بشكل عام: تستخدم جميع السلاسل نفس المقياس؛ التغيير: عرض التغييرات مقارنة بنقطة البيانات الأولى في كل سلسلة

source: square
ar: مربع

source: stack
ar: كومة

source: staggered
ar: مترنح

source: std
ar: الأمراض المنقولة جنسيا

source: step-after
ar: خطوة بعد

source: step-before
ar: خطوة قبل

source: stopped
ar: توقفت

source: stream
ar: بث

source: string type icon
ar: رمز نوع السلسلة

source: success
ar: نجاح

source: success dark
ar: النجاح المظلم

source: sum
ar: مجموع

source: syntax.
ar: بناء الجملة.

source: tag
ar: الوسم

source: tags
ar: الوسوم

source: temporal type icon
ar: رمز النوع الزمني

source: textarea
ar: تيكستاريا

source: to
ar: الى

source: top
ar: قمة

source: undo
ar: التراجع

source: unknown type icon
ar: رمز نوع غير معروف

source: upper percentile must be greater than 0 and less than 100. Must be higher than lower percentile.
ar: يجب أن تكون النسبة المئوية العليا أكبر من 0 وأقل من 100. يجب أن تكون أعلى من النسبة المئوية الأقل.

source: use latest_partition template
ar: استخدم أحدث قالب_التقسيم

source: value ascending
ar: قيمة تصاعدية

source: value descending
ar: قيمة تنازلي

source: variance
ar: التباين

source: view instructions
ar: عرض التعليمات

source: virtual
ar: افتراضية

source: viz type
ar: نوع الفيز

source: was created
ar: تم إنشاؤه

source: week
ar: الأسبوع

source: week ending Saturday
ar: الأسبوع المنتهي يوم السبت

source: week starting Sunday
ar: يبدأ الأسبوع يوم الأحد

source: x: values are normalized within each column
ar: x: يتم تسوية القيم داخل كل عمود

source: y: values are normalized within each row
ar: y: يتم تطبيع القيم داخل كل صف

source: year
ar: عام

source: zoom area
ar: منطقة زووم
