Repository: rajpal-1/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Select the charts to which you want to apply cross-filters in this dashboard. Deselecting a chart will exclude it from being filtered when applying cross-filters from any chart on the dashboard. You can select "All charts" to apply cross-filters to all charts that use the same dataset or contain the same column name in the dashboard.
ar: حدد المخططات التي تريد تطبيق الفلاتر المتقاطعة عليها في لوحة المعلومات هذه. سيؤدي إلغاء تحديد المخطط إلى استبعاده من التصفية عند تطبيق عوامل التصفية المتقاطعة من أي مخطط على لوحة المعلومات. يمكنك تحديد «جميع المخططات» لتطبيق الفلاتر المتقاطعة على جميع المخططات التي تستخدم نفس مجموعة البيانات أو تحتوي على نفس اسم العمود في لوحة المعلومات.

source: Select the charts to which you want to apply cross-filters when interacting with this chart. You can select "All charts" to apply filters to all charts that use the same dataset or contain the same column name in the dashboard.
ar: حدد المخططات التي تريد تطبيق الفلاتر المتقاطعة عليها عند التفاعل مع هذا المخطط. يمكنك تحديد «جميع المخططات» لتطبيق الفلاتر على جميع المخططات التي تستخدم نفس مجموعة البيانات أو تحتوي على نفس اسم العمود في لوحة المعلومات.

source: Select the geojson column
ar: حدد عمود geojson

source: Select the number of bins for the histogram
ar: حدد عدد الصناديق للرسم البياني

source: Select the numeric columns to draw the histogram
ar: حدد الأعمدة الرقمية لرسم الرسم البياني

source: Select values in highlighted field(s) in the control panel. Then run the query by clicking on the %s button.
ar: حدد القيم في الحقل (الحقول) المميزة في لوحة التحكم. ثم قم بتشغيل الاستعلام بالنقر فوق زر %s.

source: Send as CSV
ar: أرسل كملف CSV

source: Send as PNG
ar: أرسل بصيغة PNG

source: Send as text
ar: إرسال كنص

source: Send range filter events to other charts
ar: إرسال أحداث تصفية النطاق إلى مخططات أخرى

source: September
ar: أيلول (سبتمبر)

source: Sequential
ar: تسلسلي

source: Series
ar: سلسلة

source: Series Height
ar: ارتفاع السلسلة

source: Series Limit Sort By
ar: حد السلسلة: فرز حسب

source: Series Limit Sort Descending
ar: فرز حد السلسلة تنازليًا

source: Series Order
ar: ترتيب السلسلة

source: Series Style
ar: نمط السلسلة

source: Series chart type (line, bar etc)
ar: نوع مخطط السلسلة (الخط والشريط وما إلى ذلك)

source: Series colors
ar: ألوان السلسلة

source: Series limit
ar: حد السلسلة

source: Series type
ar: نوع السلسلة

source: Server Page Length
ar: طول صفحة الخادم

source: Server pagination
ar: ترقيم صفحات الخادم

source: Service Account
ar: حساب الخدمة

source: Set auto-refresh interval
ar: تعيين الفاصل الزمني للتحديث التلقائي

source: Set filter mapping
ar: تعيين تعيين تعيين عامل التصفية

source: Set up an email report
ar: إعداد تقرير بريد إلكتروني

source: Sets the hierarchy levels of the chart. Each level is represented by one ring with the innermost circle as the top of the hierarchy.
ar: يقوم بتعيين مستويات التسلسل الهرمي للمخطط. كل مستوى هو يتم تمثيله بحلقة واحدة مع الدائرة الداخلية كقمة التسلسل الهرمي.

source: Settings
ar: الإعدادات

source: Settings for time series
ar: إعدادات السلاسل الزمنية

source: Share
ar: شارك

source: Share chart by email
ar: مشاركة المخطط عبر البريد الإلكتروني

source: Share permalink by email
ar: مشاركة الرابط الثابت عبر البريد الإلكتروني

source: Shared query
ar: استعلام مشترك

source: Shared query fields
ar: حقول الاستعلام المشتركة

source: Sheet Name
ar: اسم الورقة

source: Shift + Click to sort by multiple columns
ar: Shift + انقر للفرز حسب أعمدة متعددة

source: Short description must be unique for this layer
ar: يجب أن يكون الوصف المختصر فريدًا لهذه الطبقة

source: Should daily seasonality be applied. An integer value will specify Fourier order of seasonality.
ar: هل يجب تطبيق الموسمية اليومية. ستحدد القيمة الصحيحة ترتيب فورييه للموسمية.

source: Should weekly seasonality be applied. An integer value will specify Fourier order of seasonality.
ar: يجب تطبيق الموسمية الأسبوعية. ستحدد القيمة الصحيحة ترتيب فورييه للموسمية.

source: Should yearly seasonality be applied. An integer value will specify Fourier order of seasonality.
ar: هل يجب تطبيق الموسمية السنوية. ستحدد القيمة الصحيحة ترتيب فورييه للموسمية.

source: Show
ar: عرض

source: Show Bubbles
ar: شو بابلز

source: Show CREATE VIEW statement
ar: عرض بيان إنشاء عرض

source: Show CSS Template
ar: عرض قالب CSS

source: Show Chart
ar: عرض الرسم البياني

source: Show Column
ar: عرض العمود

source: Show Dashboard
ar: عرض لوحة التحكم

source: Show Database
ar: عرض قاعدة البيانات

source: Show Labels
ar: عرض الملصقات

source: Show Less...
ar: عرض أقل...

source: Show Log
ar: سجل العرض

source: Show Markers
ar: إظهار العلامات

source: Show Metric
ar: عرض المقياس

source: Show Metric Names
ar: عرض أسماء المقاييس

source: Show Range Filter
ar: مرشح نطاق العرض

source: Show Table
ar: عرض الجدول

source: Show Timestamp
ar: عرض الطابع الزمني

source: Show Tooltip Labels
ar: عرض ملصقات تلميحات الأدوات

source: Show Total
ar: عرض الإجمالي

source: Show Trend Line
ar: عرض خط الاتجاه

source: Show Upper Labels
ar: عرض التسميات العلوية

source: Show Value
ar: عرض القيمة

source: Show Values
ar: عرض القيم

source: Show Y-axis
ar: عرض المحور Y

source: Show Y-axis on the sparkline. Will display the manually set min/max if set or min/max values in the data otherwise.
ar: أظهر المحور Y على خط الشرارة. سيعرض الحد الأدنى/الحد الأقصى المعين يدويًا في حالة تعيين قيم الحد الأدنى/الحد الأقصى في البيانات بخلاف ذلك.

source: Show all...
ar: عرض الكل...

source: Show all columns
ar: عرض جميع الأعمدة

source: Show axis line ticks
ar: عرض علامات خط المحور

source: Show cell bars
ar: عرض أشرطة الخلايا

source: Show chart description
ar: عرض وصف المخطط

source: Show columns subtotal
ar: عرض المجموع الفرعي للأعمدة

source: Show columns total
ar: عرض إجمالي الأعمدة

source: Show data points as circle markers on the lines
ar: عرض نقاط البيانات كعلامات دائرة على الخطوط

source: Show empty columns
ar: عرض الأعمدة الفارغة

source: Show hierarchical relationships of data, with the value represented by area, showing proportion and contribution to the whole.
ar: اعرض العلاقات الهرمية للبيانات، مع القيمة الممثلة بالمنطقة، مع إظهار النسبة والمساهمة في الكل.

source: Show info tooltip
ar: تلميح أداة إظهار المعلومات

source: Show label
ar: عرض الملصق

source: Show labels when the node has children.
ar: اعرض التسميات عندما تحتوي العقدة على أطفال.

source: Show legend
ar: عرض الأسطورة

source: Show less...
ar: عرض أقل...

source: Show less columns
ar: عرض عدد أقل من الأعمدة

source: Show minor ticks on axes.
ar: أظهر علامات طفيفة على المحاور.

source: Show only my charts
ar: عرض الرسوم البيانية الخاصة بي فقط

source: Show password.
ar: عرض كلمة المرور.

source: Show percentage
ar: عرض النسبة المئوية

source: Show pointer
ar: عرض المؤشر

source: Show progress
ar: أظهر التقدم

source: Show rows subtotal
ar: عرض المجموع الفرعي للصفوف

source: Show rows total
ar: عرض إجمالي الصفوف

source: Show series values on the chart
ar: عرض قيم السلسلة على الرسم البياني

source: Show split lines
ar: عرض الخطوط المنقسمة

source: Show the value on top of the bar
ar: اعرض القيمة أعلى الشريط

source: Show total aggregations of selected metrics. Note that row limit does not apply to the result.
ar: اعرض التجميعات الإجمالية للمقاييس المحددة. لاحظ أن حد الصفوف لا ينطبق على النتيجة.

source: Show totals
ar: عرض الإجماليات

source: Showcases a single metric front-and-center. Big number is best used to call attention to a KPI or the one thing you want your audience to focus on.
ar: يعرض مقياسًا واحدًا في الأمام والوسط. يُفضل استخدام الرقم الكبير لجذب الانتباه إلى KPI أو الشيء الوحيد الذي تريد أن يركز عليه جمهورك.

source: Showcases a single number accompanied by a simple line chart, to call attention to an important metric along with its change over time or other dimension.
ar: يعرض رقمًا واحدًا مصحوبًا بمخطط خطي بسيط، لجذب الانتباه إلى مقياس مهم إلى جانب تغييره بمرور الوقت أو بعد آخر.

source: Showcases how a metric changes as the funnel progresses. This classic chart is useful for visualizing drop-off between stages in a pipeline or lifecycle.
ar: يعرض كيفية تغير المقياس مع تقدم مسار التحويل. يعد هذا المخطط الكلاسيكي مفيدًا لتصور الانخفاض بين المراحل في خط الأنابيب أو دورة الحياة.

source: Showcases the flow or link between categories using thickness of chords. The value and corresponding thickness can be different for each side.
ar: يعرض التدفق أو الارتباط بين الفئات باستخدام سمك الأوتار. يمكن أن تختلف القيمة والسمك المقابل لكل جانب.

source: Showcases the progress of a single metric against a given target. The higher the fill, the closer the metric is to the target.
ar: يعرض تقدم مقياس واحد مقابل هدف معين. كلما زادت التعبئة، كلما اقترب المقياس من الهدف.

source: Showing %s of %s
ar: عرض %s لـ %s

source: Shows a list of all series available at that point in time
ar: يعرض قائمة بجميع المسلسلات المتاحة في تلك المرحلة الزمنية

source: Shows or hides markers for the time series
ar: يعرض أو يخفي العلامات الخاصة بالسلسلة الزمنية

source: Significance Level
ar: مستوى الأهمية

source: Simple
ar: بسيط

source: Simple ad-hoc metrics are not enabled for this dataset
ar: لم يتم تمكين المقاييس المخصصة البسيطة لمجموعة البيانات هذه

source: Single
ar: أعزب

source: Single Metric
ar: مقياس مفرد

source: Single Value
ar: قيمة واحدة

source: Single value
ar: قيمة واحدة

source: Single value type
ar: نوع القيمة الفردية

source: Size of edge symbols
ar: حجم رموز الحافة

source: Size of marker. Also applies to forecast observations.
ar: حجم العلامة. ينطبق أيضًا على ملاحظات التنبؤ.

source: Sizes of vehicles
ar: أحجام المركبات

source: Skip Blank Lines
ar: تخطي الأسطر الفارغة

source: Skip Initial Space
ar: تخطي المساحة الأولية

source: Skip Rows
ar: تخطي الصفوف

source: Skip blank lines rather than interpreting them as Not A Number values
ar: تخطي الأسطر الفارغة بدلاً من تفسيرها على أنها قيم Not A Number

source: Skip spaces after delimiter
ar: تخطي المسافات بعد المحدد

source: Slug
ar: سبيكة

source: Small
ar: صغير

source: Small number format
ar: صيغة الأرقام الصغيرة

source: Smooth-line is a variation of the line chart. Without angles and hard edges, Smooth-line sometimes looks smarter and more professional.
ar: الخط السلس هو شكل مختلف من المخطط الخطي. بدون زوايا وحواف صلبة، تبدو Smooth-line أحيانًا أكثر ذكاءً واحترافًا.

source: Smooth Line
ar: خط ناعم

source: Solid
ar: مادة صلبة

source: Something went wrong with embedded authentication. Check the dev console for details.
ar: بعض الأدوار غير موجودة

source: Something went wrong.
ar: حدث خطأ ما.

source: Sorry, An error occurred
ar: عذرًا، حدث خطأ

source: Sorry, an error occurred
ar: عذرًا، حدث خطأ

source: Sorry, an unknown error occurred
ar: عذرًا، حدث خطأ غير معروف

source: Sorry, an unknown error occurred.
ar: عذرًا، حدث خطأ غير معروف.

source: Sorry, something went wrong. Embedding could not be deactivated.
ar: آسف، حدث خطأ ما. لا يمكن إلغاء تفعيل التضمين.

source: Sorry, something went wrong. Please try again.
ar: آسف، حدث خطأ ما. يرجى المحاولة مرة أخرى.

source: Sorry, something went wrong. Try again later.
ar: آسف، حدث خطأ ما. حاول مرة أخرى لاحقًا.

source: Sorry, there appears to be no data
ar: عذرًا، يبدو أنه لا توجد بيانات

source: Sorry, there was an error saving this %s: %s
ar: عذرًا، حدث خطأ أثناء حفظ هذا%s: %s

source: Sorry, there was an error saving this dashboard: %s
ar: عذرًا، حدث خطأ أثناء حفظ لوحة التحكم هذه: %s

source: Sorry, your browser does not support copying.
ar: عذرًا، متصفحك لا يدعم النسخ.

source: Sorry, your browser does not support copying. Use Ctrl / Cmd + C!
ar: عذرًا، متصفحك لا يدعم النسخ. استخدم Ctrl/Cmd + C!

source: Sorry there was an error fetching database information: %s
ar: عذرًا، حدث خطأ أثناء جلب معلومات قاعدة البيانات: %s

source: Sorry there was an error fetching saved charts:
ar: عذرًا، حدث خطأ أثناء جلب المخططات المحفوظة:

source: Sort
ar: فرز

source: Sort Bars
ar: أشرطة الفرز

source: Sort Descending
ar: فرز تنازلي

source: Sort Metric
ar: مقياس الفرز

source: Sort Series Ascending
ar: ترتيب المتسلسلات تصاعديًا

source: Sort Series By
ar: فرز السلسلة حسب

source: Sort X Axis
ar: فرز المحور X

source: Sort Y Axis
ar: فرز المحور Y

source: Sort ascending
ar: فرز تصاعدي

source: Sort bars by x labels.
ar: فرز الأشرطة حسب تصنيفات x.

source: Sort by
ar: ترتيب حسب

source: Sort by %s
ar: فرز حسب %s

source: Sort by metric
ar: فرز حسب المقياس

source: Sort columns alphabetically
ar: فرز الأعمدة أبجديًا

source: Sort columns by
ar: فرز الأعمدة حسب

source: Sort descending
ar: فرز تنازلي

source: Sort filter values
ar: فرز قيم التصفية

source: Sort metric
ar: مقياس الفرز

source: Sort rows by
ar: فرز الصفوف حسب

source: Sort series in ascending order
ar: فرز السلسلة بترتيب تصاعدي

source: Sort type
ar: نوع الفرز

source: Source
ar: مصدر

source: Source / Target
ar: المصدر/ الهدف

source: Source SQL
ar: مصدر SQL

source: Source category
ar: فئة المصدر

source: Sparkline
ar: سباركلاين

source: Spatial
ar: مكاني

source: Specific Date/Time
ar: تاريخ/وقت محدد

source: Specify a schema (if database flavor supports this).
ar: حدد مخططًا (إذا كانت نكهة قاعدة البيانات تدعم ذلك).

source: Specify name to CREATE TABLE AS schema in: public
ar: حدد اسمًا لإنشاء مخطط TABLE AS في: عام

source: Specify name to CREATE VIEW AS schema in: public
ar: حدد اسمًا لمخطط CREATE VIEW AS في: عام

source: Specify the database version. This is used with Presto for query cost estimation, and Dremio for syntax changes, among others.
ar: حدد إصدار قاعدة البيانات. يتم استخدام هذا مع Presto لتقدير تكلفة الاستعلام، و Dremio لتغييرات بناء الجملة، من بين أمور أخرى.

source: Split number
ar: رقم منقسم

source: Square kilometers
ar: كيلومترات مربعة

source: Square meters
ar: متر مربع

source: Square miles
ar: أميال مربعة

source: Stack
ar: كومة

source: Stack Trace:
ar: ستاك ترايس:

source: Stack series
ar: سلسلة ستاك

source: Stack series on top of each other
ar: سلسلة Stack فوق بعضها البعض

source: Stacked
ar: مكدسة

source: Stacked Bars
ar: أشرطة مكدسة

source: Stacked Style
ar: أسلوب مكدس

source: Stacked style
ar: أسلوب مكدس

source: Standard time series
ar: سلسلة زمنية قياسية

source: Start
ar: ابدأ

source: Start Longitude & Latitude
ar: ابدأ خطوط الطول والعرض

source: Start (Longitude, Latitude):
ar: البداية (خط الطول والعرض):

source: Start angle
ar: زاوية البداية

source: Start at (UTC)
ar: ابدأ في (UTC)

source: Start date
ar: تاريخ البداية

source: Start date included in time range
ar: تاريخ البدء مدرج في النطاق الزمني

source: Start y-axis at 0
ar: ابدأ تشغيل المحور y عند 0

source: Start y-axis at zero. Uncheck to start y-axis at minimum value in the data.
ar: ابدأ المحور y عند الصفر. قم بإلغاء التحديد لبدء المحور y عند الحد الأدنى للقيمة في البيانات.

source: Started
ar: بدأت

source: State
ar: حالة

source: Statement %(statement_num)s out of %(statement_count)s
ar: بيان %(statement_num)s من %(statement_count)s

source: Statistical
ar: إحصائي

source: Status
ar: الحالة

source: Step - end
ar: الخطوة - النهاية

source: Step - middle
ar: الخطوة - الوسط

source: Step - start
ar: الخطوة - ابدأ

source: Step type
ar: نوع الخطوة

source: Stepped-line graph (also called step chart) is a variation of line chart but with the line forming a series of steps between data points. A step chart can be useful when you want to show the changes that occur at irregular intervals.
ar: الرسم البياني للخط المتدرج (يسمى أيضًا مخطط الخطوة) هو شكل مختلف من المخطط الخطي ولكن مع الخط الذي يشكل سلسلة من الخطوات بين نقاط البيانات. يمكن أن يكون المخطط التدريجي مفيدًا عندما تريد عرض التغييرات التي تحدث على فترات غير منتظمة.

source: Stepped Line
ar: خط متدرج

source: Stop
ar: توقّف

source: Stop query
ar: إيقاف الاستعلام

source: Stop running (Ctrl + e)
ar: إيقاف التشغيل (Ctrl + e)

source: Stop running (Ctrl + x)
ar: إيقاف التشغيل (Ctrl + x)

source: Stopped an unsafe database connection
ar: تم إيقاف اتصال قاعدة بيانات غير آمن

source: Stream
ar: بث

source: Streets
ar: الشوارع

source: Strength to pull the graph toward center
ar: قوة سحب الرسم البياني نحو المركز

source: Stretched style
ar: أسلوب ممتد

source: Strings used for sheet names (default is the first sheet).
ar: السلاسل المستخدمة لأسماء الأوراق (الافتراضي هو الورقة الأولى).

source: Stroke Color
ar: لون السكتة الدماغية

source: Stroke Width
ar: عرض السكتة الدماغية

source: Stroked
ar: ممسّد

source: Structural
ar: هيكلي

source: Style
ar: طراز

source: Style the ends of the progress bar with a round cap
ar: قم بتصميم أطراف شريط التقدم بغطاء دائري

source: Subdomain
ar: نطاق فرعي

source: Subheader
ar: عنوان فرعي

source: Subheader Font Size
ar: حجم خط العنوان الفرعي

source: Submit
ar: إرسال

source: Subtotal
ar: المجموع الفرعي

source: Success
ar: نجاح

source: Successfully changed dataset!
ar: تم تغيير مجموعة البيانات بنجاح!

source: Suffix
ar: لاحقة

source: Suffix to apply after the percentage display
ar: لاحقة يتم تطبيقها بعد عرض النسبة المئوية

source: Sum
ar: مجموع

source: Sum as Fraction of Columns
ar: المجموع ككسر للأعمدة

source: Sum as Fraction of Rows
ar: المجموع ككسر من الصفوف

source: Sum as Fraction of Total
ar: المجموع في صورة كسر من الإجمالي

source: Sum of values over specified period
ar: مجموع القيم خلال فترة محددة

source: Sum values
ar: قيم المجموع

source: Sunburst Chart
ar: مخطط صن برست

source: Sunday
ar: الأحد

source: Superset Chart
ar: مخطط المجموعة الشاملة

source: Superset Embedded SDK documentation.
ar: قم بتجميع وثائق SDK المضمنة.

source: Superset chart
ar: مخطط المجموعة الشاملة

source: Superset dashboard
ar: لوحة تحكم شاملة

source: Superset encountered an error while running a command.
ar: سورة سورة مصر العربية

source: Superset encountered an unexpected error.
ar: سوره سوره مصر مالده

source: Supported databases
ar: سورة القيامة

source: Survey Responses
ar: ردود الاستطلاع

source: Swap dataset
ar: مجموعة بيانات المبادلة

source: Swap rows and columns
ar: تبديل الصفوف والأعمدة

source: Swiss army knife for visualizing data. Choose between step, line, scatter, and bar charts. This viz type has many customization options as well.
ar: سكين الجيش السويسري لتصور البيانات. اختر بين المخططات المتدرجة والخطية والمبعثرة والشريطية. يحتوي هذا النوع من viz على العديد من خيارات التخصيص أيضًا.

source: Symbol
ar: الرمز

source: Symbol of two ends of edge line
ar: رمز طرفي خط الحافة

source: Symbol size
ar: حجم الرمز

source: Sync columns from source
ar: مزامنة الأعمدة من المصدر

source: Syntax
ar: بناء الجملة

source: TABLES
ar: الجداول

source: TEMPORAL_RANGE
ar: نطاق_زمني

source: THU
ar: الخميس

source: TUE
ar: ثلاثاء

source: Tab name
ar: اسم علامة التبويب

source: Tab title
ar: عنوان علامة التبويب

source: Table
ar: الطاولة

source: Table %(table)s wasn't found in the database %(db)s
ar: %(table)sلم يتم العثور على الجدول في قاعدة البيانات %(db)s

source: Table Exists
ar: الجدول موجود

source: Table Name
ar: اسم الجدول

source: Table [%(table_name)s] could not be found, please double check your database connection, schema, and table name
ar: تعذر العثور على الجدول [%(table_name)s]، يرجى التحقق مرة أخرى من اتصال قاعدة البيانات والمخطط واسم الجدول

source: Table cache timeout
ar: مهلة ذاكرة التخزين المؤقت للجدول

source: Table columns
ar: أعمدة الجدول

source: Table name cannot contain a schema
ar: لا يمكن أن يحتوي اسم الجدول على مخطط

source: Table name undefined
ar: اسم الجدول غير محدد

source: Table or View "%(table)s" does not exist.
ar: لا يوجد جدول أو طريقة عرض %(table)s "».

source: Table that visualizes paired t-tests, which are used to understand statistical differences between groups.
ar: جدول يصور اختبارات t المزدوجة، والتي تُستخدم لفهم الاختلافات الإحصائية بين المجموعات.

source: Tables
ar: الجداول

source: Tabs
ar: علامات التبويب

source: Tabular
ar: مجدول

source: Tag
ar: الوسم

source: Tag could not be created.
ar: تعذر إنشاء العلامة.

source: Tag could not be deleted.
ar: لا يمكن حذف العلامة.

source: Tag could not be found.
ar: لا يمكن العثور على العلامة.

source: Tag could not be updated.
ar: لا يمكن تحديث العلامة.

source: Tag created
ar: تم إنشاء العلامة

source: Tag name
ar: اسم العلامة

source: Tag name is invalid (cannot contain ':')
ar: اسم العلامة غير صالح (لا يمكن أن يحتوي على ':')

source: Tag parameters are invalid.
ar: معاملات العلامة غير صالحة.

source: Tag updated
ar: تم تحديث العلامة

source: Tagged %s %ss
ar: تم وضع علامة %s %s s

source: Tagged Object could not be deleted.
ar: لا يمكن حذف الكائن الذي تم وضع علامة عليه.

source: Tags
ar: الوسوم

source: Take your data points, and group them into "bins" to see where the densest areas of information lie
ar: خذ نقاط البيانات الخاصة بك وقم بتجميعها في «صناديق» لمعرفة أين تكمن مناطق المعلومات الأكثر كثافة

source: Target
ar: الهدف

source: Target Color
ar: اللون المستهدف

source: Target category
ar: الفئة المستهدفة

source: Target value
ar: القيمة المستهدفة

source: Template Name
ar: اسم القالب

source: Template parameters
ar: معايير القالب

source: Templated link, it's possible to include {{ metric }} or other values coming from the controls.
ar: رابط نموذجي، من الممكن تضمينه {{ metric }} أو القيم الأخرى القادمة من عناصر التحكم.

source: Terminate running queries when browser window closed or navigated to another page. Available for Presto, Hive, MySQL, Postgres and Snowflake databases.
ar: قم بإنهاء الاستعلامات قيد التشغيل عند إغلاق نافذة المتصفح أو الانتقال إلى صفحة أخرى. متاح لقواعد بيانات بريستو و هايف و MySQL و Postgres و Snowflake.

source: Test Connection
ar: اتصال اختبار

source: Test connection
ar: اتصال اختبار

source: Text
ar: نص

source: Text align
ar: محاذاة النص

source: Text embedded in email
ar: نص مضمن في البريد الإلكتروني

source: The API response from %s does not match the IDatabaseTable interface.
ar: لا تتطابق استجابة API من %s مع واجهة IDatabaseTable.

source: The CSS for individual dashboards can be altered here, or in the dashboard view where changes are immediately visible
ar: يمكن تغيير CSS للوحات المعلومات الفردية هنا، أو في عرض لوحة المعلومات، حيث تكون التغييرات مرئية على الفور.

source: The CTAS (create table as select) doesn't have a SELECT statement at the end. Please make sure your query has a SELECT as its last statement. Then, try running your query again.
ar: لا يحتوي CTAS (إنشاء جدول على النحو المحدد) على عبارة SELECT في النهاية. يرجى التأكد من أن الاستعلام الخاص بك يحتوي على SELECT باعتباره البيان الأخير. ثم حاول تشغيل الاستعلام مرة أخرى.

source: The GeoJsonLayer takes in GeoJSON formatted data and renders it as interactive polygons, lines and points (circles, icons and/or texts).
ar: يأخذ GeoJsonLayer البيانات المنسقة لـ GeoJSON ويعرضها كمضلعات وخطوط ونقاط تفاعلية (دوائر ورموز و/أو نصوص).

source: The URL is missing the dataset_id or slice_id parameters.
ar: يفتقد عنوان URL المعلمات dataset_id أو slice_id.

source: The X-axis is not on the filters list
ar: المحور السيني ليس مدرجًا في قائمة الفلاتر

source: The X-axis is not on the filters list which will prevent it from being used in time range filters in dashboards. Would you like to add it to the filters list?
ar: المحور X ليس مدرجًا في قائمة الفلاتر مما سيمنع استخدامه فيه فلاتر النطاق الزمني في لوحات المعلومات. هل ترغب في إضافته إلى قائمة الفلاتر؟

source: The annotation has been saved
ar: تم حفظ التعليق التوضيحي

source: The annotation has been updated
ar: تم تحديث التعليق التوضيحي

source: The category of source nodes used to assign colors. If a node is associated with more than one category, only the first will be used.
ar: فئة العقد المصدر المستخدمة لتعيين الألوان. إذا كانت العقدة مرتبطة بأكثر من فئة واحدة، فسيتم استخدام الأولى فقط.

source: The chart datasource does not exist
ar: مصدر بيانات المخطط غير موجود

source: The chart does not exist
ar: المخطط غير موجود

source: The chart query context does not exist
ar: سياق استعلام المخطط غير موجود
