Repository: rajpal-1/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Interval
ar: فترة

source: Interval End column
ar: عمود نهاية الفاصل

source: Interval bounds
ar: حدود الفاصل

source: Interval colors
ar: ألوان الفاصل

source: Interval start column
ar: عمود بدء الفاصل الزمني

source: Intervals
ar: فترات

source: Intesity
ar: الكثافة

source: Invalid Connection String: Expecting String of the form 'ocient://user:pass@host:port/database'.
ar: سلسلة اتصال غير صالحة: سلسلة متوقعة من النموذج 'ocient://user:pass@host:port/database'.

source: Invalid JSON
ar: JSON غير صالح

source: Invalid advanced data type: %(advanced_data_type)s
ar: نوع بيانات متقدم غير صالح: %(advanced_data_type)s

source: Invalid certificate
ar: شهادة غير صالحة

source: Invalid connection string, a valid string usually follows:'DRIVER://USER:PASSWORD@DB-HOST/DATABASE-NAME'<p>Example:'postgresql://user:password@your-postgres-db/database'</p>
ar: سلسلة اتصال غير صالحة، عادةً ما تتبع السلسلة الصالحة: 'DRIVER://USER:PASSWORD@DB-HOST/DATABASE-NAME» مثال: 'postgreSQL://user:password @your<p>-postgres-db/database'</p>

source: Invalid cron expression
ar: تعبير cron غير صالح

source: Invalid cumulative operator: %(operator)s
ar: عامل تشغيل تراكمي غير صالح: %(operator)s

source: Invalid currency code in saved metrics
ar: رمز عملة غير صالح في المقاييس المحفوظة

source: Invalid date/timestamp format
ar: تنسيق تاريخ/طابع زمني غير صالح

source: Invalid filter operation type: %(op)s
ar: نوع عملية التصفية غير صالح: %(op)s

source: Invalid geodetic string
ar: سلسلة جيوديسية غير صالحة

source: Invalid geohash string
ar: سلسلة جيوهاش غير صالحة

source: Invalid input
ar: إدخال غير صالح

source: Invalid lat/long configuration.
ar: تكوين خطوط طويلة/طويلة غير صالح.

source: Invalid longitude/latitude
ar: خط الطول/العرض غير صالح

source: Invalid metric object: %(metric)s
ar: كائن متري غير صالح: %(metric)s

source: Invalid numpy function: %(operator)s
ar: وظيفة numpy غير صالحة: %(operator)s

source: Invalid options for %(rolling_type)s: %(options)s
ar: خيارات غير صالحة لـ%(rolling_type)s: %(options)s

source: Invalid permalink key
ar: مفتاح رابط ثابت غير صالح

source: Invalid reference to column: "%(column)s"
ar: مرجع غير صالح للعمود: "%(column)s"

source: Invalid result type: %(result_type)s
ar: نوع نتيجة غير صالح: %(result_type)s

source: Invalid rolling_type: %(type)s
ar: نوع التدوير غير صالح: %(type)s

source: Invalid spatial point encountered: %(latlong)s
ar: تمت مصادفة نقطة مكانية غير صالحة: %(latlong)s

source: Invalid state.
ar: حالة غير صالحة.

source: Invalid tab ids: %s(tab_ids)
ar: معرفات علامات التبويب غير الصالحة: %s (tab_ids)

source: Inverse selection
ar: اختيار معكوس

source: Invert current page
ar: عكس الصفحة الحالية

source: Is certified
ar: حاصل على شهادة

source: Is custom tag
ar: هي علامة مخصصة

source: Is dimension
ar: هو البعد

source: Is false
ar: غير صحيح

source: Is favorite
ar: هو المفضل

source: Is filterable
ar: هل قابل للفلترة

source: Is not null
ar: ليست فارغة

source: Is null
ar: لا يوجد

source: Is tagged
ar: تم وضع علامة

source: Is temporal
ar: هو مؤقت

source: Is true
ar: صحيح

source: Isoband
ar: إيسوباند

source: Isoline
ar: إيزولين

source: Issue 1000 - The dataset is too large to query.
ar: المشكلة 1000 - مجموعة البيانات كبيرة جدًا بحيث لا يمكن الاستعلام عنها.

source: Issue 1001 - The database is under an unusual load.
ar: المشكلة 1001 - قاعدة البيانات تحت عبء غير عادي.

source: It’s not recommended to truncate axis in Bar chart.
ar: لا يوصى باقتطاع المحور في المخطط الشريطي.

source: JAN
ar: يناير

source: JSON Metadata
ar: بيانات JSON الوصفية

source: JSON metadata
ar: بيانات JSON الوصفية

source: JSON metadata is invalid!
ar: بيانات JSON الوصفية غير صالحة!

source: JSON string containing additional connection configuration. This is used to provide connection information for systems like Hive, Presto and BigQuery which do not conform to the username:password syntax normally used by SQLAlchemy.
ar: تحتوي سلسلة JSON على تكوين اتصال إضافي. يتم استخدام هذا لتوفير معلومات الاتصال لأنظمة مثل Hive و Presto و BigQuery التي لا تتوافق مع صيغة اسم المستخدم: كلمة المرور المستخدمة عادةً بواسطة SQLalChemy.

source: JUL
ar: يوليو

source: JUN
ar: يونيو

source: January
ar: كانون الثاني

source: JavaScript data interceptor
ar: معترض بيانات جافا سكريبت

source: JavaScript onClick href
ar: جافا سكريبت أونكليك href

source: JavaScript tooltip generator
ar: مولد تلميحات جافا سكريبت

source: Jinja templating
ar: قالب جينجا

source: Json list of the column names that should be read
ar: قائمة Json بأسماء الأعمدة التي يجب قراءتها

source: Json list of the column names that should be read. If not None, only these columns will be read from the file.
ar: قائمة Json بأسماء الأعمدة التي يجب قراءتها. إذا لم يكن الأمر كذلك، فستتم قراءة هذه الأعمدة فقط من الملف.

source: Json list of the values that should be treated as null. Examples: [""], ["None", "N/A"], ["nan", "null"]. Warning: Hive database supports only single value. Use [""] for empty string.
ar: قائمة Json بالقيم التي يجب التعامل معها على أنها خالية. أمثلة: [""]، ["لا شيء"، "N/A"]، ["nan"، "null"]. تحذير: تدعم قاعدة بيانات Hive قيمة واحدة فقط. استخدم [""] للسلسلة الفارغة.

source: Json list of the values that should be treated as null. Examples: [""] for empty strings, ["None", "N/A"], ["nan", "null"]. Warning: Hive database supports only a single value
ar: قائمة Json بالقيم التي يجب التعامل معها على أنها خالية. أمثلة: [""] للسلاسل الفارغة، ["لا شيء"، "N/A"]، ["nan"، "null"]. تحذير: تدعم قاعدة بيانات Hive قيمة واحدة فقط

source: July
ar: تموز

source: June
ar: حزيران (يونيو)

source: KPI
ar: مؤشر الأداء الرئيسي

source: Keep control settings?
ar: هل تريد الاحتفاظ بإعدادات التحكم؟

source: Keep editing
ar: استمر في التحرير

source: Key
ar: مفتاح

source: Keyboard shortcuts
ar: اختصارات لوحة المفاتيح

source: Keys for table
ar: مفاتيح للجدول

source: Kilometers
ar: الكيلومترات

source: LIMIT
ar: حد

source: Label
ar: ملصق

source: Label Contents
ar: محتويات الملصق

source: Label Line
ar: خط التسمية

source: Label Type
ar: نوع الملصق

source: Label already exists
ar: التسمية موجودة بالفعل

source: Label for your query
ar: تسمية الاستعلام الخاص بك

source: Label position
ar: موضع التسمية

source: Label threshold
ar: عتبة التسمية

source: Labelling
ar: وضع العلامات

source: Labels
ar: ملصقات

source: Labels for the marker lines
ar: تسميات خطوط العلامات

source: Labels for the markers
ar: ملصقات للعلامات

source: Labels for the ranges
ar: ملصقات للنطاقات

source: Large
ar: كبير

source: Last
ar: الأخيرة

source: Last Changed
ar: آخر تغيير

source: Last Modified
ar: آخر تعديل

source: Last Updated %s
ar: آخر تحديث %s

source: Last Updated %s by %s
ar: آخر تحديث %s بواسطة %s

source: Last available value seen on %s
ar: آخر قيمة متاحة تمت مشاهدتها على %s

source: Last day
ar: اليوم الأخير

source: Last modified
ar: آخر تعديل

source: Last month
ar: الشهر الماضي

source: Last quarter
ar: الربع الأخير

source: Last run
ar: آخر تشغيل

source: Last week
ar: الأسبوع الماضي

source: Last year
ar: العام الماضي

source: Latitude
ar: خط العرض

source: Latitude of default viewport
ar: خط عرض منفذ العرض الافتراضي

source: Layer configuration
ar: تكوين الطبقة

source: Layout
ar: التخطيط

source: Layout elements
ar: عناصر التخطيط

source: Layout type of graph
ar: نوع تخطيط الرسم البياني

source: Layout type of tree
ar: نوع تخطيط الشجرة

source: Leaf nodes that represent fewer than this number of events will be initially hidden in the visualization
ar: سيتم إخفاء العقد الورقية التي تمثل أقل من هذا العدد من الأحداث مبدئيًا في التصور.

source: Least recently modified
ar: الأقل تعديلًا مؤخرًا

source: Left
ar: اليسار

source: Left Margin
ar: الهامش الأيسر

source: Left margin, in pixels, allowing for more room for axis labels
ar: الهامش الأيسر، بالبكسل، مما يتيح مساحة أكبر لتسميات المحاور

source: Left to Right
ar: من اليسار إلى اليمين

source: Left value
ar: القيمة اليسرى

source: Legacy
ar: تراث

source: Legend
ar: أسطورة

source: Legend Format
ar: صيغة الأسطورة

source: Legend Orientation
ar: اتجاه الأسطورة

source: Legend Position
ar: وضع الأسطورة

source: Legend type
ar: نوع الأسطورة

source: Less or equal (<=)
ar: أقل أو يساوي (<=)

source: Less than (<)
ar: أقل من (<)

source: Lift percent precision
ar: دقة نسبة الرفع

source: Light
ar: ضوء

source: Light mode
ar: وضع الإضاءة

source: Like
ar: أعجبني

source: Like (case insensitive)
ar: أعجبني (غير حساس لحالة الأحرف)

source: Limit reached
ar: تم بلوغ الحد

source: Limit type
ar: نوع الحد

source: Limiting rows may result in incomplete data and misleading charts. Consider filtering or grouping source/target names instead.
ar: قد يؤدي تحديد الصفوف إلى بيانات غير كاملة ومخططات مضللة. فكّر في تصفية أسماء المصدر/الهدف أو تجميعها بدلاً من ذلك.

source: Limits the number of cells that get retrieved.
ar: يحد من عدد الخلايا التي يتم استردادها.

source: Limits the number of rows that get displayed.
ar: يحد من عدد الصفوف التي يتم عرضها.

source: Limits the number of series that get displayed. A joined subquery (or an extra phase where subqueries are not supported) is applied to limit the number of series that get fetched and rendered. This feature is useful when grouping by high cardinality column(s) though does increase the query complexity and cost.
ar: يحد من عدد المسلسلات التي يتم عرضها. يتم تطبيق استعلام فرعي مرتبط (أو مرحلة إضافية حيث لا يتم دعم الاستعلامات الفرعية) للحد من عدد السلاسل التي يتم جلبها وعرضها. هذه الميزة مفيدة عند التجميع حسب العمود (الأعمدة) ذات الأهمية العالية على الرغم من أنها تزيد من تعقيد الاستعلام وتكلفته.

source: Limits the number of the rows that are computed in the query that is the source of the data used for this chart.
ar: يحدد عدد الصفوف التي تم حسابها في الاستعلام الذي يعد مصدر البيانات المستخدمة لهذا المخطط.

source: Line
ar: خط

source: Line Chart
ar: مخطط خطي

source: Line Chart (legacy)
ar: مخطط خطي (قديم)

source: Line Style
ar: لاين ستايل

source: Line chart is used to visualize measurements taken over a given category. Line chart is a type of chart which displays information as a series of data points connected by straight line segments. It is a basic type of chart common in many fields.
ar: يتم استخدام المخطط الخطي لتصور القياسات المأخوذة على فئة معينة. المخطط الخطي هو نوع من المخططات التي تعرض المعلومات كسلسلة من نقاط البيانات المتصلة بمقاطع الخط المستقيم. إنه نوع أساسي من المخططات الشائعة في العديد من الحقول.

source: Line interpolation as defined by d3.js
ar: إقحام الأسطر كما هو محدد بواسطة d3.js

source: Line width
ar: عرض الخط

source: Line width unit
ar: وحدة عرض الخط

source: Linear Color Scheme
ar: نظام الألوان الخطي

source: Linear color scheme
ar: نظام الألوان الخطي

source: Linear interpolation
ar: إقحام خطي

source: Lines column
ar: عمود الخطوط

source: Lines encoding
ar: ترميز الخطوط

source: Link Copied!
ar: تم نسخ الرابط!

source: List Unique Values
ar: قائمة القيم الفريدة

source: List of extra columns made available in JavaScript functions
ar: قائمة الأعمدة الإضافية المتاحة في وظائف JavaScript

source: List of n+1 values for bucketing metric into n buckets.
ar: قائمة بقيم n+1 لإدراج المقاييس في مجموعات n.

source: List of values to mark with lines
ar: قائمة القيم التي يجب وضع علامة عليها بالخطوط

source: List of values to mark with triangles
ar: قائمة القيم التي يجب تمييزها بالمثلثات

source: List updated
ar: تم تحديث القائمة

source: Live CSS editor
ar: محرر CSS مباشر

source: Live render
ar: التصيير المباشر

source: Load a CSS template
ar: قم بتحميل قالب CSS

source: Loaded data cached
ar: تم تخزين البيانات المحملة مؤقتًا

source: Loaded from cache
ar: تم تحميله من ذاكرة التخزين المؤقت

source: Loading...
ar: جارٍ التحميل…

source: Locate the chart
ar: حدد موقع المخطط

source: Log Scale
ar: مقياس لوغاريتمي

source: Log retention
ar: الاحتفاظ بالسجلات

source: Logarithmic axis
ar: المحور اللوغاريتمي

source: Logarithmic scale on primary y-axis
ar: مقياس لوغاريتمي على المحور y الأساسي

source: Logarithmic scale on secondary y-axis
ar: مقياس لوغاريتمي على المحور y الثانوي

source: Logarithmic x-axis
ar: المحور السيني اللوغاريتمي

source: Logarithmic y-axis
ar: المحور الصادي اللوغاريتمي

source: Login
ar: تسجيل الدخول

source: Login with
ar: تسجيل الدخول باستخدام

source: Logout
ar: تسجيل الخروج

source: Logs
ar: السجلات

source: Long dashed
ar: متقطع لفترة طويلة

source: Longitude
ar: خط الطول

source: Longitude & Latitude
ar: خطوط الطول والعرض

source: Longitude & Latitude columns
ar: أعمدة خطوط الطول والعرض

source: Longitude and Latitude
ar: خطوط الطول والعرض

source: Longitude of default viewport
ar: خط طول إطار العرض الافتراضي

source: Lower Threshold
ar: الحد الأدنى

source: Lower threshold must be lower than upper threshold
ar: يجب أن يكون الحد الأدنى أقل من الحد الأعلى

source: MAR
ar: مسخ

source: MAY
ar: أيار (مايو)

source: MON
ar: الإثنين

source: Main Datetime Column
ar: عمود التاريخ والوقت الرئيسي

source: Make sure that the controls are configured properly and the datasource contains data for the selected time range
ar: تأكد من تكوين عناصر التحكم بشكل صحيح وأن مصدر البيانات يحتوي على بيانات للنطاق الزمني المحدد

source: Make the x-axis categorical
ar: اجعل المحور السيني قاطعًا

source: Malformed request. slice_id or table_name and db_name arguments are expected
ar: طلب غير صحيح. من المتوقع استخدام وسيطات slice_id أو table_name و db_name

source: Manage
ar: قم بإدارة

source: Manage email report
ar: إدارة تقرير البريد الإلكتروني

source: Manage your databases
ar: إدارة قواعد البيانات الخاصة بك

source: Mandatory
ar: إجباري

source: Manually set min/max values for the y-axis.
ar: قم بتعيين قيم الحد الأدنى/الأقصى للمحور y يدويًا.

source: Map
ar: الخريطة

source: MapBox
ar: ماببوكس

source: Map Style
ar: نمط الخريطة

source: Mapbox
ar: ماببوكس

source: March
ar: آذار

source: Margin
ar: الهامش

source: Mark a column as temporal in "Edit datasource" modal
ar: حدد عمودًا كمؤقت في نموذج "تحرير مصدر البيانات"

source: Marker
ar: ماركر

source: Marker Size
ar: حجم العلامة

source: Marker labels
ar: ملصقات ماركر

source: Marker line labels
ar: ملصقات خطوط العلامات

source: Marker lines
ar: خطوط ماركر

source: Marker size
ar: حجم العلامة

source: Markers
ar: علامات

source: Markup type
ar: نوع الترميز

source: Max
ar: الحد الأقصى

source: Max Bubble Size
ar: الحد الأقصى لحجم الفقاعة

source: Max Events
ar: أحداث ماكس

source: Maximum
ar: حد اقصى

source: Maximum Font Size
ar: الحد الأقصى لحجم الخط

source: Maximum Radius
ar: الحد الأقصى للشعاع

source: Maximum radius size of the circle, in pixels. As the zoom level changes, this insures that the circle respects this maximum radius.
ar: الحد الأقصى لحجم نصف قطر الدائرة، بالبكسل. ومع تغير مستوى الزوم، يضمن ذلك أن الدائرة تحترم هذا الحد الأقصى لنصف القطر.

source: Maximum value
ar: القيمة القصوى

source: Maximum value on the gauge axis
ar: القيمة القصوى على محور القياس

source: May
ar: أيار (مايو)

source: Mean of values over specified period
ar: متوسط القيم خلال فترة محددة

source: Mean values
ar: القيم المتوسطة

source: Median
ar: الوسيط

source: Median edge width, the thickest edge will be 4 times thicker than the thinnest.
ar: متوسط عرض الحافة، ستكون الحافة السميكة أكثر سمكًا بأربع مرات من الحافة الأقل سمكًا.

source: Median node size, the largest node will be 4 times larger than the smallest
ar: متوسط حجم العقدة، ستكون العقدة الأكبر أكبر بأربع مرات من الأصغر

source: Median values
ar: القيم المتوسطة

source: Medium
ar: متوسط

source: Menu actions trigger
ar: مشغل إجراءات القائمة

source: Message content
ar: محتوى الرسالة

source: Metadata
ar: البيانات الوصفية

source: Metadata Parameters
ar: بارامترات البيانات الوصفية

source: Metadata has been synced
ar: تمت مزامنة البيانات الوصفية

source: Method
ar: الطريقة

source: Metric
ar: متري

source: Metric '%(metric)s' does not exist
ar: المقياس %(metric)s '' غير موجود

source: Metric Key
ar: مفتاح متري

source: Metric ascending
ar: تصاعدي متري

source: Metric assigned to the [X] axis
ar: المقياس المخصص للمحور [X]

source: Metric assigned to the [Y] axis
ar: المقياس المعين للمحور [Y]

source: Metric change in value from `since` to `until`
ar: تغيير المقياس في القيمة من «منذ» إلى «حتى»

source: Metric currency
ar: العملة المترية

source: Metric descending
ar: تنازلي متري

source: Metric factor change from `since` to `until`
ar: تغير العامل المتري من «منذ» إلى «حتى»

source: Metric for node values
ar: مقياس لقيم العقدة

source: Metric name
ar: اسم المقياس

source: Metric name [%s] is duplicated
ar: اسم المقياس [%s] مكرر

source: Metric percent change in value from `since` to `until`
ar: تغير النسبة المئوية للمترية في القيمة من «منذ» إلى «حتى»

source: Metric that defines the size of the bubble
ar: المقياس الذي يحدد حجم الفقاعة

source: Metric to display bottom title
ar: مقياس لعرض العنوان السفلي

source: Metric used as a weight for the grid's coloring
ar: المقياس المستخدم كوزن لتلوين الشبكة

source: Metric used to calculate bubble size
ar: المقياس المستخدم لحساب حجم الفقاعة

source: Metric used to control height
ar: المقياس المستخدم للتحكم في الارتفاع

source: Metric used to define how the top series are sorted if a series or cell limit is present. If undefined reverts to the first metric (where appropriate).
ar: يُستخدم المقياس لتحديد كيفية فرز السلسلة العليا في حالة وجود حد للسلسلة أو الخلية. إذا كان undefined يعود إلى المقياس الأول (عند الاقتضاء).

source: Metric used to define how the top series are sorted if a series or row limit is present. If undefined reverts to the first metric (where appropriate).
ar: يُستخدم المقياس لتحديد كيفية فرز السلسلة العليا في حالة وجود حد للسلسلة أو الصف. إذا كان undefined يعود إلى المقياس الأول (عند الاقتضاء).

source: Metric used to order the limit if a series limit is present. If undefined reverts to the first metric (where appropriate).
ar: يتم استخدام المقياس لترتيب الحد في حالة وجود حد السلسلة. إذا كان undefined يعود إلى المقياس الأول (عند الاقتضاء).

source: Metrics
ar: المقاييس

source: Middle
ar: وسط

source: Midnight
ar: منتصف الليل

source: Miles
ar: مايلز

source: Min
ar: دقيقة

source: Min/max (no outliers)
ar: الحد الأدنى/الأقصى (بدون قيم متطرفة)

source: Min Periods
ar: الحد الأدنى للفترات

source: Min Width
ar: الحد الأدنى للعرض

source: Min periods
ar: الحد الأدنى للفترات

source: Mine
ar: منجم

source: Minimum
ar: الحد الأدنى

source: Minimum Font Size
ar: الحد الأدنى لحجم الخط

source: Minimum Radius
ar: الحد الأدنى من الشعاع

source: Minimum leaf node event count
ar: الحد الأدنى لعدد أحداث العقدة الورقية

source: Minimum radius size of the circle, in pixels. As the zoom level changes, this insures that the circle respects this minimum radius.
ar: الحد الأدنى لحجم نصف قطر الدائرة، بالبكسل. ومع تغير مستوى الزوم، يضمن ذلك أن الدائرة تحترم هذا الحد الأدنى لنصف القطر.

source: Minimum threshold in percentage points for showing labels.
ar: الحد الأدنى بالنقاط المئوية لعرض التصنيفات.

source: Minimum value
ar: الحد الأدنى للقيمة

source: Minimum value for label to be displayed on graph.
ar: الحد الأدنى لقيمة التسمية التي سيتم عرضها على الرسم البياني.

source: Minimum value on the gauge axis
ar: الحد الأدنى للقيمة على محور القياس

source: Minor Split Line
ar: خط تقسيم صغير

source: Minor ticks
ar: القراد الصغير

source: Minute
ar: دقيقة

source: Minutes %s
ar: الدقائق %s

source: Missing URL parameters
ar: معلمات URL المفقودة

source: Missing dataset
ar: مجموعة بيانات مفقودة

source: Mixed Chart
ar: مخطط مختلط

source: Modified
ar: تم التعديل

source: Modified %s
ar: تم التعديل %s

source: Modified by
ar: تم التعديل بواسطة

source: Modified by: %s
ar: تم التعديل بواسطة: %s

source: Modified columns: %s
ar: الأعمدة المعدلة: %s

source: Monday
ar: الإثنين

source: Month
ar: الشهر

source: Months %s
ar: أشهر %s

source: More
ar: المزيد

source: More filters
ar: المزيد من الفلاتر

source: Move only
ar: تحرك فقط

source: Moves the given set of dates by a specified interval.
ar: ينقل مجموعة التواريخ المحددة بفاصل زمني محدد.

source: Multi-Dimensions
ar: أبعاد متعددة

source: Multi-Layers
ar: طبقات متعددة

source: Multi-Levels
ar: مستويات متعددة

source: Multi-Variables
ar: متغيرات متعددة

source: Multiple
ar: متعدد

source: Multiple file extensions are not allowed for columnar uploads. Please make sure all files are of the same extension.
ar: لا يُسمح بامتدادات الملفات المتعددة للتحميلات العمودية. يرجى التأكد من أن جميع الملفات من نفس الامتداد.

source: Multiple filtering
ar: تصفية متعددة

source: Multiple formats accepted, look the geopy.points Python library for more details
ar: تم قبول تنسيقات متعددة، ابحث في مكتبة geopy.points Python لمزيد من التفاصيل

source: Multiplier
ar: مضاعف

source: Must be unique
ar: يجب أن تكون فريدة

source: Must choose either a chart or a dashboard
ar: يجب اختيار مخطط أو لوحة معلومات

source: Must have a [Group By] column to have 'count' as the [Label]
ar: يجب أن يحتوي عمود [Group By] على «count» كـ [Label]

source: Must have at least one numeric column specified
ar: يجب تحديد عمود رقمي واحد على الأقل

source: Must provide credentials for the SSH Tunnel
ar: يجب تقديم بيانات اعتماد لنفق SSH

source: Must specify a value for filters with comparison operators
ar: يجب تحديد قيمة للفلاتر باستخدام عوامل المقارنة

source: My beautiful colors
ar: ألواني الجميلة

source: My column
ar: العمود الخاص بي

source: My metric
ar: المقياس الخاص بي

source: N/A
ar: غير متاح

source: NOT GROUPED BY
ar: لم يتم تجميعها بواسطة

source: NOV
ar: نوفمبر

source: NOW
ar: الآن

source: NUMERIC
ar: رقمية

source: Name
ar: اسم

source: Name is required
ar: الاسم مطلوب

source: Name must be unique
ar: يجب أن يكون الاسم فريدًا

source: Name of table to be created from columnar data.
ar: اسم الجدول الذي سيتم إنشاؤه من البيانات العمودية.

source: Name of table to be created from excel data.
ar: اسم الجدول الذي سيتم إنشاؤه من بيانات Excel.

source: Name of table to be created with CSV file
ar: اسم الجدول الذي سيتم إنشاؤه باستخدام ملف CSV

source: Name of the column containing the id of the parent node
ar: اسم العمود الذي يحتوي على معرف العقدة الأصلية

source: Name of the id column
ar: اسم عمود المعرف

source: Name of the source nodes
ar: اسم العقد المصدر

source: Name of the table that exists in the source database
ar: اسم الجدول الموجود في قاعدة البيانات المصدر

source: Name of the target nodes
ar: اسم العقد المستهدفة

source: Name of your tag
ar: اسم العلامة الخاصة بك

source: Name your database
ar: قم بتسمية قاعدة البيانات الخاصة بك

source: Need help? Learn how to connect your database
ar: هل تحتاج إلى مساعدة؟ تعرف على كيفية توصيل قاعدة البيانات الخاصة بك

source: Need help? Learn more about
ar: هل تحتاج إلى مساعدة؟ تعرف على المزيد حول

source: Network error
ar: خطأ في الشبكة

source: Network error.
ar: خطأ في الشبكة.

source: New chart
ar: مخطط جديد

source: New columns added: %s
ar: تمت إضافة أعمدة جديدة: %s

source: New dataset
ar: مجموعة بيانات جديدة

source: New dataset name
ar: اسم مجموعة بيانات جديد

source: New header
ar: عنوان جديد

source: New tab
ar: علامة تبويب جديدة

source: New tab (Ctrl + q)
ar: علامة تبويب جديدة (Ctrl+ q)

source: New tab (Ctrl + t)
ar: علامة تبويب جديدة (Ctrl+t)

source: Next
ar: التالي

source: Nightingale Rose Chart
ar: مخطط وردة العندليب

source: No %s yet
ar: لا %s حتى الآن

source: No Data
ar: ما من بيانات

source: No Results
ar: لا توجد نتائج

source: No Rules yet
ar: لا توجد قواعد حتى الآن

source: No Tags created
ar: لم يتم إنشاء أي علامات

source: No annotation layers
ar: لا توجد طبقات توضيحية

source: No annotation layers yet
ar: لا توجد طبقات توضيحية حتى الآن

source: No annotation yet
ar: لا يوجد تعليق توضيحي حتى الآن

source: No applied filters
ar: لا توجد فلاتر مطبقة

source: No available filters.
ar: لا توجد فلاتر متاحة.

source: No charts
ar: لا توجد رسوم بيانية

source: No charts yet
ar: لا توجد رسوم بيانية حتى الآن

source: No columns found
ar: لم يتم العثور على أي أعمدة

source: No compatible columns found
ar: لم يتم العثور على أعمدة متوافقة

source: No compatible datasets found
ar: لم يتم العثور على مجموعات بيانات متوافقة

source: No compatible schema found
ar: لم يتم العثور على مخطط متوافق
