Repository: rajpal-1/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: There was an error fetching dataset
ar: حدث خطأ أثناء جلب مجموعة البيانات

source: There was an error fetching dataset's related objects
ar: حدث خطأ أثناء جلب الكائنات ذات الصلة بمجموعة البيانات

source: There was an error fetching the favorite status: %s
ar: حدث خطأ أثناء جلب الحالة المفضلة: %s

source: There was an error fetching the filtered charts and dashboards:
ar: حدث خطأ أثناء جلب نشاطك الأخير:

source: There was an error loading the chart data
ar: حدث خطأ أثناء تحميل بيانات المخطط

source: There was an error loading the dataset metadata
ar: حدث خطأ أثناء تحميل البيانات الوصفية لمجموعة البيانات

source: There was an error loading the schemas
ar: حدث خطأ أثناء تحميل المخططات

source: There was an error loading the tables
ar: حدث خطأ أثناء تحميل الجداول

source: There was an error saving the favorite status: %s
ar: حدث خطأ أثناء حفظ الحالة المفضلة: %s

source: There was an error with your request
ar: حدث خطأ في طلبك

source: There was an issue deleting: %s
ar: حدثت مشكلة أثناء الحذف: %s

source: There was an issue deleting %s: %s
ar: حدثت مشكلة أثناء الحذف%s: %s

source: There was an issue deleting rules: %s
ar: حدثت مشكلة في حذف القواعد: %s

source: There was an issue deleting the selected %s: %s
ar: حدثت مشكلة أثناء حذف المحدد%s: %s

source: There was an issue deleting the selected annotations: %s
ar: حدثت مشكلة أثناء حذف التعليقات التوضيحية المحددة: %s

source: There was an issue deleting the selected charts: %s
ar: حدثت مشكلة أثناء حذف المخططات المحددة: %s

source: There was an issue deleting the selected dashboards:
ar: حدثت مشكلة أثناء حذف لوحات المعلومات المحددة:

source: There was an issue deleting the selected datasets: %s
ar: حدثت مشكلة أثناء حذف مجموعات البيانات المحددة: %s

source: There was an issue deleting the selected layers: %s
ar: حدثت مشكلة أثناء حذف الطبقات المحددة: %s

source: There was an issue deleting the selected queries: %s
ar: حدثت مشكلة أثناء حذف الاستعلامات المحددة: %s

source: There was an issue deleting the selected templates: %s
ar: حدثت مشكلة أثناء حذف القوالب المحددة: %s

source: There was an issue duplicating the dataset.
ar: كانت هناك مشكلة في تكرار مجموعة البيانات.

source: There was an issue duplicating the selected datasets: %s
ar: حدثت مشكلة في تكرار مجموعات البيانات المحددة: %s

source: There was an issue favoriting this dashboard.
ar: كانت هناك مشكلة في تفضيل لوحة التحكم هذه.

source: There was an issue fetching reports attached to this dashboard.
ar: حدثت مشكلة في جلب التقارير المرفقة بلوحة التحكم هذه.

source: There was an issue fetching the favorite status of this dashboard.
ar: حدثت مشكلة في جلب الحالة المفضلة للوحة التحكم هذه.

source: There was an issue fetching your chart: %s
ar: حدثت مشكلة أثناء جلب المخطط الخاص بك: %s

source: There was an issue fetching your dashboards: %s
ar: حدثت مشكلة أثناء جلب لوحات المعلومات الخاصة بك: %s

source: There was an issue fetching your recent activity: %s
ar: حدثت مشكلة أثناء جلب نشاطك الأخير: %s

source: There was an issue fetching your saved queries: %s
ar: حدثت مشكلة أثناء جلب الاستعلامات المحفوظة: %s

source: There was an issue previewing the selected query. %s
ar: حدثت مشكلة أثناء معاينة الاستعلام المحدد. %s

source: There was an issue previewing the selected query %s
ar: حدثت مشكلة أثناء معاينة الاستعلام المحدد %s

source: These are the datasets this filter will be applied to.
ar: هذه هي مجموعات البيانات التي سيتم تطبيق عامل التصفية عليها.

source: These parameters are generated dynamically when clicking the save or overwrite button in the explore view. This JSON object is exposed here for reference and for power users who may want to alter specific parameters.
ar: يتم إنشاء هذه المعلمات ديناميكيًا عند النقر فوق زر الحفظ أو الكتابة فوقه في عرض الاستكشاف. يتم عرض كائن JSON هذا هنا كمرجع وللمستخدمين المحترفين الذين قد يرغبون في تغيير معايير محددة.

source: This JSON object is generated dynamically when clicking the save or overwrite button in the dashboard view. It is exposed here for reference and for power users who may want to alter specific parameters.
ar: يتم إنشاء كائن JSON هذا ديناميكيًا عند النقر فوق زر الحفظ أو الكتابة فوقه في عرض لوحة المعلومات. يتم عرضه هنا كمرجع وللمستخدمين المحترفين الذين قد يرغبون في تغيير معايير محددة.

source: This action will permanently delete %s.
ar: سيتم حذف هذا الإجراء نهائيًا%s.

source: This action will permanently delete the layer.
ar: سيؤدي هذا الإجراء إلى حذف الطبقة نهائيًا.

source: This action will permanently delete the saved query.
ar: سيؤدي هذا الإجراء إلى حذف الاستعلام المحفوظ نهائيًا.

source: This action will permanently delete the template.
ar: سيؤدي هذا الإجراء إلى حذف القالب نهائيًا.

source: This can be either an IP address (e.g. 127.0.0.1) or a domain name (e.g. mydatabase.com).
ar: يمكن أن يكون هذا إما عنوان IP (على سبيل المثال 127.0.0.1) أو اسم نطاق (مثل mydatabase.com).

source: This chart applies cross-filters to charts whose datasets contain columns with the same name.
ar: يقوم هذا المخطط بتطبيق عوامل التصفية المتقاطعة على المخططات التي تحتوي مجموعات البيانات الخاصة بها على أعمدة بنفس الاسم.

source: This chart has been moved to a different filter scope.
ar: تم نقل هذا المخطط إلى نطاق تصفية مختلف.

source: This chart is managed externally, and can't be edited in Superset
ar: تتم إدارة هذا المخطط خارجيًا، ولا يمكن تحريره في Superset

source: This chart might be incompatible with the filter (datasets don't match)
ar: قد يكون هذا المخطط غير متوافق مع عامل التصفية (مجموعات البيانات غير متطابقة)

source: This chart type is not supported when using an unsaved query as a chart source.
ar: لا يتم دعم نوع المخطط هذا عند استخدام استعلام غير محفوظ كمصدر مخطط.

source: This color scheme is being overridden by custom label colors. Check the JSON metadata in the Advanced settings
ar: يتم تجاوز نظام الألوان هذا من خلال ألوان التسمية المخصصة. تحقق من بيانات JSON الوصفية في الإعدادات المتقدمة

source: This column might be incompatible with current dataset
ar: قد يكون هذا العمود غير متوافق مع مجموعة البيانات الحالية

source: This column must contain date/time information.
ar: يجب أن يحتوي هذا العمود على معلومات التاريخ/الوقت.

source: This control filters the whole chart based on the selected time range. All relative times, e.g. "Last month", "Last 7 days", "now", etc. are evaluated on the server using the server's local time (sans timezone). All tooltips and placeholder times are expressed in UTC (sans timezone). The timestamps are then evaluated by the database using the engine's local timezone. Note one can explicitly set the timezone per the ISO 8601 format if specifying either the start and/or end time.
ar: يقوم عنصر التحكم هذا بتصفية المخطط بالكامل بناءً على النطاق الزمني المحدد. يتم تقييم جميع الأوقات النسبية، مثل «الشهر الماضي» و «آخر 7 أيام» و «الآن» وما إلى ذلك على الخادم باستخدام التوقيت المحلي للخادم (بدون منطقة زمنية). يتم التعبير عن جميع تلميحات الأدوات وأوقات العناصر النائبة بالتوقيت العالمي المنسق (بدون منطقة زمنية). ثم يتم تقييم الطوابع الزمنية بواسطة قاعدة البيانات باستخدام المنطقة الزمنية المحلية للمحرك. لاحظ أنه يمكن للمرء تعيين المنطقة الزمنية بشكل صريح وفقًا لتنسيق ISO 8601 في حالة تحديد وقت البدء و/أو وقت الانتهاء.

source: This controls whether the "time_range" field from the current view should be passed down to the chart containing the annotation data.
ar: يتحكم هذا في ما إذا كان حقل «time_range» من الحالي يجب تمرير العرض إلى المخطط الذي يحتوي على بيانات التعليقات التوضيحية.

source: This controls whether the time grain field from the current view should be passed down to the chart containing the annotation data.
ar: يتحكم هذا في ما إذا كان حقل الحبوب الزمنية من التيار يجب تمرير العرض إلى المخطط الذي يحتوي على بيانات التعليقات التوضيحية.

source: This dashboard is currently auto refreshing; the next auto refresh will be in %s.
ar: يتم تحديث لوحة التحكم هذه تلقائيًا حاليًا؛ سيتم التحديث التلقائي التالي%s.

source: This dashboard is managed externally, and can't be edited in Superset
ar: تتم إدارة لوحة التحكم هذه خارجيًا، ولا يمكن تحريرها في Superset

source: This dashboard is not published, it will not show up in the list of dashboards. Click here to publish this dashboard.
ar: لم يتم نشر لوحة التحكم هذه، ولن تظهر في قائمة لوحات المعلومات. انقر هنا لنشر لوحة التحكم هذه.

source: This dashboard is not published which means it will not show up in the list of dashboards. Favorite it to see it there or access it by using the URL directly.
ar: لم يتم نشر لوحة التحكم هذه مما يعني أنها لن تظهر في قائمة لوحات المعلومات. قم بتفضيله لرؤيته هناك أو الوصول إليه باستخدام عنوان URL مباشرة.

source: This dashboard is now hidden
ar: لوحة التحكم هذه مخفية الآن

source: This dashboard is now published
ar: تم نشر لوحة التحكم هذه الآن

source: This dashboard is published. Click to make it a draft.
ar: تم نشر لوحة التحكم هذه. انقر لجعلها مسودة.

source: This dashboard is ready to embed. In your application, pass the following id to the SDK:
ar: لوحة التحكم هذه جاهزة للتضمين. في التطبيق الخاص بك، قم بتمرير المعرف التالي إلى SDK:

source: This dashboard was saved successfully.
ar: تم حفظ لوحة المعلومات هذه بنجاح.

source: This database is managed externally, and can't be edited in Superset
ar: تتم إدارة قاعدة البيانات هذه خارجيًا، ولا يمكن تحريرها في Superset

source: This database table does not contain any data. Please select a different table.
ar: لا يحتوي جدول قاعدة البيانات هذا على أية بيانات. يرجى تحديد جدول مختلف.

source: This dataset is managed externally, and can't be edited in Superset
ar: تتم إدارة مجموعة البيانات هذه خارجيًا، ولا يمكن تحريرها في Superset

source: This dataset is not used to power any charts.
ar: لا يتم استخدام مجموعة البيانات هذه لتشغيل أي مخططات.

source: This defines the element to be plotted on the chart
ar: هذا يحدد العنصر الذي سيتم رسمه على الرسم البياني

source: This field is used as a unique identifier to attach the calculated dimension to charts. It is also used as the alias in the SQL query.
ar: يتم استخدام هذا الحقل كمعرف فريد لإرفاق البعد المحسوب بالمخططات. يتم استخدامه أيضًا كاسم مستعار في استعلام SQL.

source: This field is used as a unique identifier to attach the metric to charts. It is also used as the alias in the SQL query.
ar: يتم استخدام هذا الحقل كمعرف فريد لإرفاق المقياس بالمخططات. يتم استخدامه أيضًا كاسم مستعار في استعلام SQL.

source: This fields acts a Superset view, meaning that Superset will run a query against this string as a subquery.
ar: تعمل هذه الحقول بطريقة عرض شاملة، مما يعني أن Superset ستقوم بتشغيل استعلام مقابل هذه السلسلة كاستعلام فرعي.

source: This filter might be incompatible with current dataset
ar: قد يكون عامل التصفية هذا غير متوافق مع مجموعة البيانات الحالية

source: This functionality is disabled in your environment for security reasons.
ar: تم تعطيل هذه الوظيفة في البيئة الخاصة بك لأسباب أمنية.

source: This is the condition that will be added to the WHERE clause. For example, to only return rows for a particular client, you might define a regular filter with the clause `client_id = 9`. To display no rows unless a user belongs to a RLS filter role, a base filter can be created with the clause `1 = 0` (always false).
ar: هذا هو الشرط الذي سيتم إضافته إلى جملة WHERE. على سبيل المثال، لإرجاع صفوف لعميل معين فقط، يمكنك تحديد عامل تصفية عادي باستخدام العبارة `client_id = 9`. لعرض أي صفوف ما لم يكن المستخدم ينتمي إلى دور عامل تصفية RLS، يمكن إنشاء عامل تصفية أساسي باستخدام العبارة `1 = 0` (always false).

source: This json object describes the positioning of the widgets in the dashboard. It is dynamically generated when adjusting the widgets size and positions by using drag & drop in the dashboard view
ar: يصف كائن json هذا موضع الأدوات في لوحة المعلومات. يتم إنشاؤه ديناميكيًا عند ضبط حجم الأدوات والمواضع باستخدام السحب والإسقاط في عرض لوحة المعلومات

source: This markdown component has an error.
ar: يوجد خطأ في مكون تخفيض السعر هذا.

source: This markdown component has an error. Please revert your recent changes.
ar: يوجد خطأ في مكون تخفيض السعر هذا. يرجى التراجع عن التغييرات الأخيرة.

source: This may be triggered by:
ar: قد يتم تشغيل هذا من خلال:

source: This metric is used to define row selection criteria (how the rows are sorted) if a series or row limit is present. If not defined, it reverts to the first metric (where appropriate).
ar: يُستخدم هذا المقياس لتعريف معايير اختيار الصفوف (كيفية فرز الصفوف) في حالة وجود حد للسلسلة أو الصف. إذا لم يتم تعريفه، فإنه يعود إلى المقياس الأول (عند الاقتضاء).

source: This metric might be incompatible with current dataset
ar: قد يكون هذا المقياس غير متوافق مع مجموعة البيانات الحالية

source: This section allows you to configure how to use the slice to generate annotations.
ar: يتيح لك هذا القسم تكوين كيفية استخدام الشريحة لإنشاء التعليقات التوضيحية.

source: This section contains options that allow for advanced analytical post processing of query results
ar: يحتوي هذا القسم على خيارات تسمح بالمعالجة التحليلية المتقدمة لنتائج الاستعلام

source: This section contains validation errors
ar: يحتوي هذا القسم على أخطاء التحقق

source: This session has encountered an interruption, and some controls may not work as intended. If you are the developer of this app, please check that the guest token is being generated correctly.
ar: واجهت جلسة العمل هذه انقطاعًا، وقد لا تعمل بعض عناصر التحكم على النحو المنشود. إذا كنت مطورًا لهذا التطبيق، فيرجى التحقق من إنشاء رمز الضيف بشكل صحيح.

source: This table already has a dataset
ar: يحتوي هذا الجدول بالفعل على مجموعة بيانات

source: This table already has a dataset associated with it. You can only associate one dataset with a table.
ar: يحتوي هذا الجدول بالفعل على مجموعة بيانات مرتبطة به. يمكنك فقط ربط مجموعة بيانات واحدة بجدول.

source: This value should be greater than the left target value
ar: يجب أن تكون هذه القيمة أكبر من القيمة المستهدفة اليسرى

source: This value should be smaller than the right target value
ar: يجب أن تكون هذه القيمة أصغر من القيمة المستهدفة الصحيحة

source: This visualization type does not support cross-filtering.
ar: لا يدعم نوع التصور هذا التصفية المتقاطعة.

source: This visualization type is not supported.
ar: هذا النوع من التصور غير مدعوم.

source: This will remove your current embed configuration.
ar: سيؤدي ذلك إلى إزالة تكوين التضمين الحالي.

source: Threshold
ar: عتبة

source: Threshold:
ar: العتبة:

source: Threshold alpha level for determining significance
ar: عتبة مستوى ألفا لتحديد الأهمية

source: Thumbnails
ar: الصور المصغرة

source: Thursday
ar: الخميس

source: Time
ar: زمن

source: Time-series Bar Chart (legacy)
ar: مخطط شريطي للسلسلة الزمنية (قديم)

source: Time-series Percent Change
ar: تغيير النسبة المئوية للسلسلة الزمنية

source: Time-series Period Pivot
ar: محور فترة السلاسل الزمنية

source: Time-series Table
ar: جدول السلاسل الزمنية

source: Time Column
ar: عمود الوقت

source: Time Comparison
ar: مقارنة الوقت

source: Time Format
ar: صيغة الوقت

source: Time Grain
ar: تايم جرين

source: Time Grain must be specified when using Time Shift.
ar: يجب تحديد الحبوب الزمنية عند استخدام Time Shift.

source: Time Granularity
ar: دقة الوقت

source: Time Lag
ar: الفارق الزمني

source: Time Range
ar: النطاق الزمني

source: Time Ratio
ar: نسبة الوقت

source: Time Series
ar: سلسلة زمنية

source: Time Series - Bar Chart
ar: السلاسل الزمنية - مخطط شريطي

source: Time Series - Line Chart
ar: السلاسل الزمنية - مخطط خطي

source: Time Series - Nightingale Rose Chart
ar: السلسلة الزمنية - مخطط وردة العندليب

source: Time Series - Paired t-test
ar: السلسلة الزمنية - اختبار t المقترن

source: Time Series - Percent Change
ar: السلاسل الزمنية - النسبة المئوية للتغير

source: Time Series - Period Pivot
ar: السلسلة الزمنية - محور الفترة

source: Time Series - Stacked
ar: سلسلة زمنية - مكدسة

source: Time Series Options
ar: خيارات السلاسل الزمنية

source: Time Shift
ar: تايم شيفت

source: Time Table View
ar: عرض الجدول الزمني

source: Time column
ar: عمود الوقت

source: Time column "%(col)s" does not exist in dataset
ar: عمود الوقت "%(col)s" غير موجود في مجموعة البيانات

source: Time column filter plugin
ar: المكون الإضافي لتصفية العمود الزمني

source: Time column to apply dependent temporal filter to
ar: عمود الوقت لتطبيق عامل التصفية الزمني التابع عليه

source: Time column to apply time range to
ar: عمود الوقت لتطبيق النطاق الزمني عليه

source: Time comparison
ar: مقارنة الوقت

source: Time delta in natural language (example: 24 hours, 7 days, 56 weeks, 365 days)
ar: دلتا الوقت في اللغة الطبيعية (على سبيل المثال: 24 ساعة، 7 أيام، 56 أسبوعًا، 365 يومًا)

source: Time delta is ambiguous. Please specify [%(human_readable)s ago] or [%(human_readable)s later].
ar: دلتا الوقت غامضة. يرجى تحديد [منذ %(human_readable)s] أو [بعد %(human_readable)s].

source: Time filter
ar: عامل تصفية الوقت

source: Time format
ar: صيغة الوقت

source: Time grain
ar: تايم جرين

source: Time grain filter plugin
ar: البرنامج المساعد لفلتر حبوب الوقت

source: Time grain missing
ar: حبة زمنية مفقودة

source: Time granularity
ar: دقة الوقت

source: Time in seconds
ar: الوقت بالثواني

source: Time lag
ar: الفارق الزمني

source: Time range
ar: النطاق الزمني

source: Time ratio
ar: نسبة الوقت

source: Time related form attributes
ar: سمات النموذج ذات الصلة بالوقت

source: Time series
ar: سلسلة زمنية

source: Time series columns
ar: أعمدة السلاسل الزمنية

source: Time shift
ar: تايم شيفت

source: Time string is ambiguous. Please specify [%(human_readable)s ago] or [%(human_readable)s later].
ar: السلسلة الزمنية غامضة. يرجى تحديد [منذ %(human_readable)s] أو [بعد %(human_readable)s].

source: Timeout error
ar: خطأ المهلة

source: Timestamp format
ar: صيغة الطابع الزمني

source: Timezone
ar: المنطقة الزمنية

source: Timezone offset (in hours) for this datasource
ar: إزاحة المنطقة الزمنية (بالساعات) لمصدر البيانات هذا

source: Timezone selector
ar: محدد المنطقة الزمنية

source: Tiny
ar: صغير

source: Title
ar: عنوان

source: Title Column
ar: عمود العنوان

source: Title is required
ar: العنوان مطلوب

source: Title or Slug
ar: العنوان أو البزاقة

source: To filter on a metric, use Custom SQL tab.
ar: للتصفية على مقياس، استخدم علامة تبويب SQL مخصصة.

source: To get a readable URL for your dashboard
ar: للحصول على عنوان URL قابل للقراءة للوحة التحكم

source: Tooltip
ar: تلميح الأدوات

source: Tooltip Contents
ar: محتويات تلميح الأدوات

source: Tooltip sort by metric
ar: ترتيب تلميح الأدوات حسب المقياس

source: Tooltip time format
ar: تنسيق وقت تلميح الأدوات

source: Top
ar: قمة

source: Top left
ar: أعلى اليسار

source: Top right
ar: أعلى اليمين

source: Top to Bottom
ar: من أعلى إلى أسفل

source: Total
ar: الإجمالي

source: Total: %s
ar: الإجمالي: %s

source: Total (%(aggfunc)s)
ar: المجموع (%(aggfunc)s)

source: Total (%(aggregatorName)s)
ar: المجموع (%(aggregatorName)s)

source: Total value
ar: القيمة الإجمالية

source: Totals
ar: المجاميع

source: Track job
ar: تعقب الوظيفة

source: Transformable
ar: قابل للتحويل

source: Transparent
ar: شفاف

source: Transpose pivot
ar: تبديل المحور

source: Treat values as categorical.
ar: تعامل مع القيم على أنها فئوية.

source: Tree Chart
ar: مخطط الشجرة

source: Tree layout
ar: تخطيط الشجرة

source: Tree orientation
ar: اتجاه الشجرة

source: Treemap
ar: خريطة الشجرة

source: Trend
ar: اتجاه

source: Triangle
ar: مثلث

source: Trigger Alert If...
ar: تشغيل التنبيه إذا...

source: Truncate Axis
ar: محور الاقتطاع

source: Truncate Cells
ar: الخلايا المقتطعة

source: Truncate Metric
ar: مقياس الاقتطاع

source: Truncate X Axis
ar: اقتطاع المحور X

source: Truncate X Axis. Can be overridden by specifying a min or max bound. Only applicable for numercal X axis.
ar: قم باقتطاع المحور X. يمكن تجاوزه عن طريق تحديد حد أدنى أو حد أقصى. ينطبق فقط على المحور X الرقمي.

source: Truncate Y Axis
ar: اقتطاع المحور Y

source: Truncate Y Axis. Can be overridden by specifying a min or max bound.
ar: قم باقتطاع المحور Y. يمكن تجاوزه عن طريق تحديد حد أدنى أو حد أقصى.

source: Truncate long cells to the "min width" set above
ar: قم باقتطاع الخلايا الطويلة إلى «العرض الأدنى» المحدد أعلاه

source: Truncates the specified date to the accuracy specified by the date unit.
ar: يقطع التاريخ المحدد إلى الدقة المحددة بواسطة وحدة التاريخ.

source: Try applying different filters or ensuring your datasource has data
ar: حاول تطبيق عوامل تصفية مختلفة أو التأكد من أن مصدر البيانات الخاص بك يحتوي على بيانات

source: Try different criteria to display results.
ar: جرب معايير مختلفة لعرض النتائج.

source: Tuesday
ar: يوم الثلاثاء

source: Tukey
ar: توكي

source: Type
ar: النوع

source: Type "%s" to confirm
ar: اكتب "%s" للتأكيد

source: Type a value
ar: اكتب قيمة

source: Type a value here
ar: اكتب قيمة هنا

source: Type is required
ar: النوع مطلوب

source: Type of Google Sheets allowed
ar: نوع جداول بيانات Google المسموح بها

source: Type of comparison, value difference or percentage
ar: نوع المقارنة أو فرق القيمة أو النسبة المئوية

source: UI Configuration
ar: تكوين واجهة المستخدم

source: URL
ar: عنوان Url

source: URL Parameters
ar: بارامترات عنوان URL

source: URL parameters
ar: بارامترات عنوان URL

source: URL slug
ar: رابط البزاقات

source: Unable to add a new tab to the backend. Please contact your administrator.
ar: غير قادر على إضافة علامة تبويب جديدة إلى الواجهة الخلفية. يرجى الاتصال بالمسؤول الخاص بك.

source: Unable to connect. Verify that the following roles are set on the service account: "BigQuery Data Viewer", "BigQuery Metadata Viewer", "BigQuery Job User" and the following permissions are set "bigquery.readsessions.create", "bigquery.readsessions.getData"
ar: غير قادر على الاتصال. تحقق من تعيين الأدوار التالية على حساب الخدمة: «عارض بيانات BigQuery»، «عارض البيانات الوصفية لـ BigQuery»، «مستخدم مهمة BigQuery» وتم تعيين الأذونات التالية «bigquery.readsessions.create»، «BigQuery.readSessions.getData»

source: Unable to connect to catalog named "%(catalog_name)s".
ar: غير قادر على الاتصال بالكتالوج المسمى "%(catalog_name)s".

source: Unable to connect to database "%(database)s".
ar: غير قادر على الاتصال بقاعدة البيانات "%(database)s".

source: Unable to create chart without a query id.
ar: غير قادر على إنشاء مخطط بدون معرف استعلام.

source: Unable to decode value
ar: غير قادر على فك شفرة القيمة

source: Unable to encode value
ar: غير قادر على ترميز القيمة

source: Unable to find such a holiday: [%(holiday)s]
ar: غير قادر على العثور على مثل هذه العطلة: [%(holiday)s]

source: Unable to load columns for the selected table. Please select a different table.
ar: غير قادر على تحميل الأعمدة للجدول المحدد. يرجى تحديد جدول مختلف.

source: Unable to migrate query editor state to backend. Superset will retry later. Please contact your administrator if this problem persists.
ar: غير قادر على ترحيل حالة محرر الاستعلام إلى الواجهة الخلفية. ستتم إعادة المحاولة من قبل Superset لاحقًا. يرجى الاتصال بالمسؤول إذا استمرت هذه المشكلة.

source: Unable to migrate query state to backend. Superset will retry later. Please contact your administrator if this problem persists.
ar: غير قادر على ترحيل حالة الاستعلام إلى الواجهة الخلفية. ستتم إعادة المحاولة من قبل Superset لاحقًا. يرجى الاتصال بالمسؤول إذا استمرت هذه المشكلة.

source: Unable to migrate table schema state to backend. Superset will retry later. Please contact your administrator if this problem persists.
ar: غير قادر على ترحيل حالة مخطط الجدول إلى الواجهة الخلفية. ستتم إعادة المحاولة من قبل Superset لاحقًا. يرجى الاتصال بالمسؤول إذا استمرت هذه المشكلة.

source: Unable to retrieve dashboard colors
ar: غير قادر على استرداد ألوان لوحة المعلومات

source: Unable to upload CSV file "%(filename)s" to table "%(table_name)s" in database "%(db_name)s". Error message: %(error_msg)s
ar: غير قادر على تحميل ملف CSV "%(filename)s" إلى الجدول "%(table_name)s" في قاعدة البيانات "%(db_name)s". رسالة خطأ: %(error_msg)s

source: Unable to upload Columnar file "%(filename)s" to table "%(table_name)s" in database "%(db_name)s". Error message: %(error_msg)s
ar: غير قادر على تحميل ملف عمودي "%(filename)s" إلى الجدول "%(table_name)s" في قاعدة البيانات "%(db_name)s". رسالة خطأ: %(error_msg)s
