Repository: rajpal-1/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Unable to upload Excel file "%(filename)s" to table "%(table_name)s" in database "%(db_name)s". Error message: %(error_msg)s
ar: غير قادر على تحميل ملف Excel "%(filename)s" إلى الجدول "%(table_name)s" في قاعدة البيانات "%(db_name)s". رسالة خطأ: %(error_msg)s

source: Undefined
ar: غير محدد

source: Undefined window for rolling operation
ar: نافذة غير محددة لعملية التدحرج

source: Undo?
ar: التراجع؟

source: Undo the action
ar: التراجع عن الإجراء

source: Unexpected error
ar: خطأ غير متوقع

source: Unexpected error:
ar: خطأ غير متوقع:

source: Unexpected error occurred, please check your logs for details
ar: حدث خطأ غير متوقع، يرجى التحقق من سجلاتك للحصول على التفاصيل

source: Unexpected time range: %(error)s
ar: نطاق زمني غير متوقع: %(error)s

source: Unknown
ar: غير معروف

source: Unknown Doris server host "%(hostname)s".
ar: مضيف خادم Doris غير معروف "%(hostname)s".

source: Unknown MySQL server host "%(hostname)s".
ar: مضيف خادم MySQL غير معروف "%(hostname)s".

source: Unknown Presto Error
ar: خطأ سريع غير معروف

source: Unknown Status
ar: حالة غير معروفة

source: Unknown column used in orderby: %(col)s
ar: عمود غير معروف يُستخدم بالترتيب حسب: %(col)s

source: Unknown error
ar: خطأ غير معروف

source: Unknown input format
ar: تنسيق إدخال غير معروف

source: Unknown type
ar: نوع غير معروف

source: Unknown value
ar: قيمة غير معروفة

source: Unsafe return type for function %(func)s: %(value_type)s
ar: نوع الإرجاع غير الآمن للوظيفة%(func)s: %(value_type)s

source: Unsafe template value for key %(key)s: %(value_type)s
ar: قيمة القالب غير الآمن للمفتاح%(key)s: %(value_type)s

source: Unsupported clause type: %(clause)s
ar: نوع جملة غير معتمد: %(clause)s

source: Unsupported post processing operation: %(operation)s
ar: عملية ما بعد المعالجة غير المدعومة: %(operation)s

source: Unsupported return value for method %(name)s
ar: قيمة إرجاع غير مدعومة للأسلوب %(name)s

source: Unsupported template value for key %(key)s
ar: قيمة قالب غير مدعومة للمفتاح %(key)s

source: Unsupported time grain: %(time_grain)s
ar: الحبوب الزمنية غير المدعومة: %(time_grain)s

source: Untitled Dataset
ar: مجموعة بيانات بدون عنوان

source: Untitled Query
ar: استعلام بدون عنوان

source: Untitled query
ar: استعلام بدون عنوان

source: Update chart
ar: تحديث المخطط

source: Updating chart was stopped
ar: تم إيقاف تحديث المخطط

source: Upload
ar: رفع

source: Upload CSV
ar: تحميل ملف CSV

source: Upload CSV to database
ar: تحميل CSV إلى قاعدة البيانات

source: Upload Credentials
ar: تحميل بيانات الاعتماد

source: Upload Enabled
ar: تم تمكين التحميل

source: Upload Excel file
ar: تحميل ملف إكسيل

source: Upload Excel file to database
ar: قم بتحميل ملف Excel إلى قاعدة البيانات

source: Upload JSON file
ar: تحميل ملف JSON

source: Upload columnar file
ar: تحميل ملف عمودي

source: Upload columnar file to database
ar: تحميل ملف عمودي إلى قاعدة البيانات

source: Upload file to database
ar: تحميل ملف إلى قاعدة البيانات

source: Upper Threshold
ar: العتبة العليا

source: Upper threshold must be greater than lower threshold
ar: يجب أن يكون الحد العلوي أكبر من الحد الأدنى

source: Usage
ar: الاستخدام

source: Use "%(menuName)s" menu instead.
ar: استخدم قائمة "%(menuName)s" بدلاً من ذلك.

source: Use %s to open in a new tab.
ar: يُستخدم %s للفتح في علامة تبويب جديدة.

source: Use Area Proportions
ar: استخدم نسب المنطقة

source: Use Columns
ar: استخدم الأعمدة

source: Use a log scale
ar: استخدم مقياس لوغاريتمي

source: Use a log scale for the X-axis
ar: استخدم مقياسًا لوغاريتميًا للمحور السيني

source: Use a log scale for the Y-axis
ar: استخدم مقياسًا لوغاريتميًا للمحور Y

source: Use an encrypted connection to the database
ar: استخدم اتصالاً مشفرًا بقاعدة البيانات

source: Use an ssh tunnel connection to the database
ar: استخدم اتصال نفق ssh بقاعدة البيانات

source: Use another existing chart as a source for annotations and overlays. Your chart must be one of these visualization types: [%s]
ar: استخدم مخططًا موجودًا آخر كمصدر للتعليقات التوضيحية والتراكبات. يجب أن يكون المخطط الخاص بك أحد أنواع التصور هذه: [%s]

source: Use date formatting even when metric value is not a timestamp
ar: استخدم تنسيق التاريخ حتى عندما لا تكون قيمة المقياس طابعًا زمنيًا

source: Use legacy datasource editor
ar: استخدم محرر مصدر البيانات القديم

source: Use metrics as a top level group for columns or for rows
ar: استخدم المقاييس كمجموعة ذات مستوى أعلى للأعمدة أو للصفوف

source: Use only a single value.
ar: استخدم قيمة واحدة فقط.

source: Use the Advanced Analytics options below
ar: استخدم خيارات التحليلات المتقدمة أدناه

source: Use the JSON file you automatically downloaded when creating your service account.
ar: استخدم ملف JSON الذي قمت بتنزيله تلقائيًا عند إنشاء حساب الخدمة الخاص بك.

source: Use the edit button to change this field
ar: استخدم زر التحرير لتغيير هذا الحقل

source: Use this section if you want a query that aggregates
ar: استخدم هذا القسم إذا كنت تريد استعلامًا يتم تجميعه

source: Use this section if you want to query atomic rows
ar: استخدم هذا القسم إذا كنت تريد الاستعلام عن الصفوف الذرية

source: Use this to define a static color for all circles
ar: استخدم هذا لتعريف لون ثابت لجميع الدوائر

source: Used internally to identify the plugin. Should be set to the package name from the pluginʼs package.json
ar: تستخدم داخليًا لتحديد المكون الإضافي. يجب تعيينه على اسم الحزمة من package.json للمكوِّن الإضافي

source: Used to summarize a set of data by grouping together multiple statistics along two axes. Examples: Sales numbers by region and month, tasks by status and assignee, active users by age and location. Not the most visually stunning visualization, but highly informative and versatile.
ar: يُستخدم لتلخيص مجموعة من البيانات من خلال تجميع إحصائيات متعددة على محورين. أمثلة: أرقام المبيعات حسب المنطقة والشهر، والمهام حسب الحالة والمحال إليه، والمستخدمون النشطون حسب العمر والموقع. ليس التصور الأكثر روعة من الناحية المرئية، ولكنه غني بالمعلومات ومتعدد الاستخدامات.

source: User
ar: مستخدم

source: User doesn't have the proper permissions.
ar: لا يمتلك المستخدم الأذونات المناسبة.

source: User must select a value before applying the filter
ar: يجب على المستخدم تحديد قيمة قبل تطبيق عامل التصفية

source: User query
ar: استعلام المستخدم

source: Username
ar: اسم المُستخدم

source: Users are not allowed to set a search path for security reasons.
ar: لا يُسمح للمستخدمين بتعيين مسار بحث لأسباب أمنية.

source: Uses Gaussian Kernel Density Estimation to visualize spatial distribution of data
ar: يستخدم تقدير كثافة النواة الغاوسية لتصور التوزيع المكاني للبيانات

source: Uses a gauge to showcase progress of a metric towards a target. The position of the dial represents the progress and the terminal value in the gauge represents the target value.
ar: يستخدم مقياسًا لعرض تقدم المقياس نحو الهدف. يمثل موضع القرص التقدم وتمثل القيمة النهائية في المقياس القيمة المستهدفة.

source: Uses circles to visualize the flow of data through different stages of a system. Hover over individual paths in the visualization to understand the stages a value took. Useful for multi-stage, multi-group visualizing funnels and pipelines.
ar: يستخدم الدوائر لتصور تدفق البيانات عبر مراحل مختلفة من النظام. مرر مؤشر الماوس فوق المسارات الفردية في التصور لفهم المراحل التي استغرقتها القيمة. مفيد لمسارات وخطوط الأنابيب للتصور متعددة المراحل ومتعددة المجموعات.

source: Value
ar: القيمة

source: Value Domain
ar: نطاق القيمة

source: Value Format
ar: تنسيق القيمة

source: Value and Percentage
ar: القيمة والنسبة المئوية

source: Value bounds
ar: حدود القيمة

source: Value cannot exceed %s
ar: لا يمكن أن تتجاوز القيمة %s

source: Value format
ar: تنسيق القيمة

source: Value is required
ar: القيمة مطلوبة

source: Value must be greater than 0
ar: يجب أن تكون القيمة أكبر من 0

source: Values are dependent on other filters
ar: تعتمد القيم على عوامل تصفية أخرى

source: Values dependent on
ar: القيم التي تعتمد على

source: Values selected in other filters will affect the filter options to only show relevant values
ar: ستؤثر القيم المحددة في عوامل التصفية الأخرى على خيارات التصفية لعرض القيم ذات الصلة فقط

source: Vehicle Types
ar: أنواع المركبات

source: Verbose Name
ar: اسم مطول

source: Version
ar: الإصدار

source: Version number
ar: رقم الإصدار

source: Vertical
ar: عمودي

source: Vertical (Left)
ar: عمودي (يسار)

source: Video game consoles
ar: أجهزة ألعاب الفيديو

source: View
ar: منظر

source: View All »
ar: عرض الكل »

source: View Dataset
ar: عرض مجموعة البيانات

source: View all charts
ar: عرض جميع الرسوم البيانية

source: View as table
ar: عرض كجدول

source: View in SQL Lab
ar: عرض في مختبر SQL

source: View keys & indexes (%s)
ar: عرض المفاتيح والفهارس (%s)

source: View query
ar: عرض الاستعلام

source: Viewed
ar: تمت مشاهدته

source: Viewed %s
ar: تمت مشاهدتها %s

source: Viewport
ar: منفذ العرض

source: Virtual
ar: افتراضية

source: Virtual (SQL)
ar: افتراضية (SQL)

source: Virtual dataset
ar: مجموعة بيانات افتراضية

source: Virtual dataset query cannot be empty
ar: لا يمكن أن يكون استعلام مجموعة البيانات الافتراضية فارغًا

source: Virtual dataset query cannot consist of multiple statements
ar: لا يمكن أن يتكون استعلام مجموعة البيانات الافتراضية من عبارات متعددة

source: Virtual dataset query must be read-only
ar: يجب أن يكون استعلام مجموعة البيانات الافتراضية للقراءة فقط

source: Visual Tweaks
ar: التعديلات المرئية

source: Visualization Type
ar: نوع التصور

source: Visualize a parallel set of metrics across multiple groups. Each group is visualized using its own line of points and each metric is represented as an edge in the chart.
ar: تصور مجموعة موازية من المقاييس عبر مجموعات متعددة. يتم تصور كل مجموعة باستخدام خط النقاط الخاص بها ويتم تمثيل كل مقياس كحافة في المخطط.

source: Visualize a related metric across pairs of groups. Heatmaps excel at showcasing the correlation or strength between two groups. Color is used to emphasize the strength of the link between each pair of groups.
ar: تخيل مقياسًا ذا صلة عبر أزواج من المجموعات. تتفوق خرائط الحرارة في عرض الارتباط أو القوة بين مجموعتين. يتم استخدام اللون للتأكيد على قوة الارتباط بين كل زوج من المجموعات.

source: Visualize geospatial data like 3D buildings, landscapes, or objects in grid view.
ar: تصور البيانات الجغرافية المكانية مثل المباني ثلاثية الأبعاد أو المناظر الطبيعية أو الكائنات في عرض الشبكة.

source: Visualize how a metric changes over time using bars. Add a group by column to visualize group level metrics and how they change over time.
ar: تخيل كيف يتغير المقياس بمرور الوقت باستخدام الأشرطة. أضف مجموعة بعمود لتصور المقاييس على مستوى المجموعة وكيفية تغيرها بمرور الوقت.

source: Visualize multiple levels of hierarchy using a familiar tree-like structure.
ar: تصور مستويات متعددة من التسلسل الهرمي باستخدام بنية مألوفة تشبه الشجرة.

source: Visualize two different series using the same x-axis. Note that both series can be visualized with a different chart type (e.g. 1 using bars and 1 using a line).
ar: تخيل سلسلتين مختلفتين باستخدام نفس المحور السيني. لاحظ أنه يمكن تصور كلتا السلسلتين بنوع مخطط مختلف (على سبيل المثال 1 باستخدام الأشرطة و 1 باستخدام خط).

source: Visualizes a metric across three dimensions of data in a single chart (X axis, Y axis, and bubble size). Bubbles from the same group can be showcased using bubble color.
ar: يعرض مقياسًا عبر ثلاثة أبعاد للبيانات في مخطط واحد (المحور X والمحور Y وحجم الفقاعة). يمكن عرض الفقاعات من نفس المجموعة باستخدام لون الفقاعة.

source: Visualizes connected points, which form a path, on a map.
ar: تصور النقاط المتصلة، التي تشكل مسارًا، على الخريطة.

source: Visualizes geographic areas from your data as polygons on a Mapbox rendered map. Polygons can be colored using a metric.
ar: تصور المناطق الجغرافية من بياناتك كمضلعات على خريطة تم عرضها على Mapbox. يمكن تلوين المضلعات باستخدام مقياس.

source: Visualizes how a metric has changed over a time using a color scale and a calendar view. Gray values are used to indicate missing values and the linear color scheme is used to encode the magnitude of each day's value.
ar: تصور كيف تغير المقياس بمرور الوقت باستخدام مقياس اللون وطريقة عرض التقويم. يتم استخدام القيم الرمادية للإشارة إلى القيم المفقودة ويتم استخدام نظام الألوان الخطي لترميز حجم قيمة كل يوم.

source: Visualizes how a single metric varies across a country's principal subdivisions (states, provinces, etc) on a choropleth map. Each subdivision's value is elevated when you hover over the corresponding geographic boundary.
ar: تصور كيف يختلف مقياس واحد عبر التقسيمات الفرعية الرئيسية للبلد (الولايات والمقاطعات وما إلى ذلك) على خريطة choropleth. يتم رفع قيمة كل قسم فرعي عندما تحوم فوق الحدود الجغرافية المقابلة.

source: Visualizes many different time-series objects in a single chart. This chart is being deprecated and we recommend using the Time-series Chart instead.
ar: تصور العديد من كائنات السلاسل الزمنية المختلفة في مخطط واحد. تم إيقاف هذا المخطط ونوصي باستخدام مخطط السلاسل الزمنية بدلاً من ذلك.

source: Visualizes the flow of different group's values through different stages of a system. New stages in the pipeline are visualized as nodes or layers. The thickness of the bars or edges represent the metric being visualized.
ar: تصور تدفق قيم المجموعة المختلفة عبر مراحل مختلفة من النظام. يتم تصور المراحل الجديدة في خط الأنابيب كعقد أو طبقات. يمثل سمك الأشرطة أو الحواف المقياس الذي يتم تصويره.

source: Visualizes the words in a column that appear the most often. Bigger font corresponds to higher frequency.
ar: تصور الكلمات في العمود الذي يظهر في أغلب الأحيان. الخط الأكبر يتوافق مع التردد العالي.

source: Viz is missing a datasource
ar: يفتقد Viz إلى مصدر بيانات

source: Viz type
ar: نوع الفيز

source: WED
ar: تزوج

source: Want to add a new database?
ar: هل تريد إضافة قاعدة بيانات جديدة؟

source: Warning
ar: تحذير

source: Warning!
ar: تحذير!

source: Warning! Changing the dataset may break the chart if the metadata does not exist.
ar: تحذير! قد يؤدي تغيير مجموعة البيانات إلى كسر المخطط في حالة عدم وجود البيانات الوصفية.

source: Warning Message
ar: رسالة تحذير

source: Was unable to check your query
ar: لم يكن قادرًا على التحقق من الاستعلام الخاص بك

source: Waterfall Chart
ar: مخطط الشلال

source: We are unable to connect to your database. Click "See more" for database-provided information that may help troubleshoot the issue.
ar: نحن غير قادرين على الاتصال بقاعدة البيانات الخاصة بك. انقر فوق «مشاهدة المزيد» للحصول على المعلومات التي توفرها قاعدة البيانات والتي قد تساعد في استكشاف المشكلة وإصلاحها.

source: We can't seem to resolve column "%(column)s" at line %(location)s.
ar: يبدو أننا لا نستطيع حل العمود "%(column)s" في السطر%(location)s.

source: We can't seem to resolve the column "%(column_name)s"
ar: يبدو أننا لا نستطيع حل العمود "%(column_name)s"

source: We can't seem to resolve the column "%(column_name)s" at line %(location)s.
ar: يبدو أننا لا نستطيع حل العمود "%(column_name)s" في السطر%(location)s.

source: We have the following keys: %s
ar: لدينا المفاتيح التالية: %s

source: We were unable to active or deactivate this report.
ar: لم نتمكن من تفعيل هذا التقرير أو إلغاء تنشيطه.

source: We were unable to carry over any controls when switching to this new dataset.
ar: لم نتمكن من نقل أي عناصر تحكم عند التبديل إلى مجموعة البيانات الجديدة هذه.

source: We were unable to connect to your database named "%(database)s". Please verify your database name and try again.
ar: لم نتمكن من الاتصال بقاعدة البيانات الخاصة بك المسماة "%(database)s". يرجى التحقق من اسم قاعدة البيانات الخاصة بك والمحاولة مرة أخرى.

source: Web
ar: الويب

source: Wednesday
ar: الأربعاء

source: Week
ar: الأسبوع

source: Week ending Saturday
ar: الأسبوع المنتهي يوم السبت

source: Week ending Sunday
ar: الأسبوع المنتهي يوم الأحد

source: Week starting Monday
ar: يبدأ الأسبوع يوم الاثنين

source: Week starting Sunday
ar: يبدأ الأسبوع يوم الأحد

source: Weekly Report
ar: تقرير أسبوعي

source: Weekly Report for %s
ar: تقرير أسبوعي لـ %s

source: Weekly seasonality
ar: موسمية أسبوعية

source: Weeks %s
ar: أسابيع %s

source: Weight
ar: وزن

source: What should be shown as the label
ar: ما الذي يجب إظهاره على أنه الملصق

source: What should be shown as the tooltip label
ar: ما الذي يجب إظهاره كتسمية تلميح الأدوات؟

source: What should be shown on the label?
ar: ما الذي يجب أن يظهر على الملصق؟

source: What should happen if the table already exists
ar: ماذا يجب أن يحدث إذا كان الجدول موجودًا بالفعل

source: When `Calculation type` is set to "Percentage change", the Y Axis Format is forced to `.1%`
ar: عند تعيين «نوع الحساب» على «تغيير النسبة المئوية»، يتم إجبار تنسيق المحور Y على `.1%`

source: When a secondary metric is provided, a linear color scale is used.
ar: عند توفير مقياس ثانوي، يتم استخدام مقياس لوني خطي.

source: When allowing CREATE TABLE AS option in SQL Lab, this option forces the table to be created in this schema
ar: عند السماح بخيار CREATE TABLE AS في SQL Lab، يفرض هذا الخيار إنشاء الجدول في هذا المخطط

source: When checked, the map will zoom to your data after each query
ar: عند التحقق، ستقوم الخريطة بتكبير بياناتك بعد كل استعلام

source: When enabled, users are able to visualize SQL Lab results in Explore.
ar: عند التمكين، يمكن للمستخدمين تصور نتائج SQL Lab في الاستكشاف.

source: When only a primary metric is provided, a categorical color scale is used.
ar: عند توفير مقياس أساسي فقط، يتم استخدام مقياس ألوان فئوي.

source: When specifying SQL, the datasource acts as a view. Superset will use this statement as a subquery while grouping and filtering on the generated parent queries.
ar: عند تحديد SQL، يعمل مصدر البيانات كعرض. سيستخدم Superset هذه العبارة كاستعلام فرعي أثناء التجميع والتصفية على الاستعلامات الأصلية التي تم إنشاؤها.

source: When the secondary temporal columns are filtered, apply the same filter to the main datetime column.
ar: عندما تتم تصفية الأعمدة الزمنية الثانوية، قم بتطبيق نفس عامل التصفية على عمود التاريخ والوقت الرئيسي.

source: When using "Autocomplete filters", this can be used to improve performance of the query fetching the values. Use this option to apply a predicate (WHERE clause) to the query selecting the distinct values from the table. Typically the intent would be to limit the scan by applying a relative time filter on a partitioned or indexed time-related field.
ar: عند استخدام «فلاتر الإكمال التلقائي»، يمكن استخدام هذا لتحسين أداء الاستعلام الذي يجلب القيم. استخدم هذا الخيار لتطبيق المسند (عبارة WHERE) على الاستعلام الذي يحدد القيم المميزة من الجدول. عادةً ما يكون الهدف هو الحد من الفحص من خلال تطبيق عامل تصفية الوقت النسبي على حقل مقسم أو مفهرس متعلق بالوقت.

source: When using 'Group By' you are limited to use a single metric
ar: عند استخدام «Group By»، فأنت مقيد باستخدام مقياس واحد

source: When using other than adaptive formatting, labels may overlap
ar: عند استخدام التنسيق بخلاف التنسيق التكيفي، قد تتداخل التسميات

source: When using this option, default value can’t be set
ar: عند استخدام هذا الخيار، لا يمكن تعيين القيمة الافتراضية

source: Whether the progress bar overlaps when there are multiple groups of data
ar: ما إذا كان شريط التقدم يتداخل عند وجود مجموعات متعددة من البيانات

source: Whether the table was generated by the 'Visualize' flow in SQL Lab
ar: ما إذا كان الجدول قد تم إنشاؤه بواسطة تدفق «Visualize» في SQL Lab

source: Whether this column is exposed in the `Filters` section of the explore view.
ar: ما إذا كان هذا العمود مكشوفًا في قسم «الفلاتر» من عرض الاستكشاف.

source: Whether to align background charts with both positive and negative values at 0
ar: ما إذا كنت تريد محاذاة مخططات الخلفية مع القيم الإيجابية والسلبية عند 0

source: Whether to align positive and negative values in cell bar chart at 0
ar: ما إذا كان يجب محاذاة القيم الإيجابية والسلبية في مخطط شريط الخلايا عند 0

source: Whether to always show the annotation label
ar: ما إذا كان سيتم عرض تسمية التعليق التوضيحي دائمًا

source: Whether to animate the progress and the value or just display them
ar: سواء لتحريك التقدم والقيمة أو مجرد عرضهما

source: Whether to apply a normal distribution based on rank on the color scale
ar: ما إذا كان سيتم تطبيق التوزيع الطبيعي بناءً على الترتيب على مقياس اللون

source: Whether to apply filter when items are clicked
ar: ما إذا كان سيتم تطبيق عامل التصفية عند النقر على العناصر

source: Whether to colorize numeric values by if they are positive or negative
ar: ما إذا كان يجب تلوين القيم الرقمية حسب ما إذا كانت إيجابية أو سلبية

source: Whether to colorize numeric values by whether they are positive or negative
ar: ما إذا كان سيتم تلوين القيم الرقمية من خلال ما إذا كانت إيجابية أو سلبية

source: Whether to display a bar chart background in table columns
ar: ما إذا كان سيتم عرض خلفية المخطط الشريطي في أعمدة الجدول

source: Whether to display a legend for the chart
ar: ما إذا كنت تريد عرض وسيلة إيضاح للمخطط

source: Whether to display bubbles on top of countries
ar: ما إذا كنت تريد عرض الفقاعات فوق البلدان

source: Whether to display the aggregate count
ar: ما إذا كان سيتم عرض العدد الإجمالي

source: Whether to display the interactive data table
ar: ما إذا كان سيتم عرض جدول البيانات التفاعلي

source: Whether to display the labels.
ar: ما إذا كان سيتم عرض الملصقات.

source: Whether to display the labels. Note that the label only displays when the 5% threshold.
ar: ما إذا كان سيتم عرض الملصقات. لاحظ أن التسمية تظهر فقط عند حد 5٪.

source: Whether to display the legend (toggles)
ar: ما إذا كنت تريد عرض وسيلة الإيضاح (مفاتيح التبديل)

source: Whether to display the metric name as a title
ar: ما إذا كان سيتم عرض اسم المقياس كعنوان

source: Whether to display the min and max values of the X-axis
ar: ما إذا كان سيتم عرض القيم الدنيا والقصوى للمحور X

source: Whether to display the min and max values of the Y-axis
ar: ما إذا كان سيتم عرض القيم الدنيا والقصوى للمحور Y

source: Whether to display the numerical values within the cells
ar: ما إذا كان سيتم عرض القيم العددية داخل الخلايا

source: Whether to display the stroke
ar: ما إذا كان سيتم عرض الحد

source: Whether to display the time range interactive selector
ar: ما إذا كان سيتم عرض المحدد التفاعلي للنطاق الزمني

source: Whether to display the timestamp
ar: ما إذا كان سيتم عرض الطابع الزمني

source: Whether to display the tooltip labels.
ar: ما إذا كنت تريد عرض تسميات تلميحات الأدوات.

source: Whether to display the trend line
ar: ما إذا كان سيتم عرض خط الاتجاه

source: Whether to enable changing graph position and scaling.
ar: ما إذا كان سيتم تمكين تغيير موضع الرسم البياني والتحجيم.

source: Whether to enable node dragging in force layout mode.
ar: ما إذا كان سيتم تمكين سحب العقدة في وضع تخطيط القوة.

source: Whether to fill the objects
ar: ما إذا كنت تريد ملء الكائنات

source: Whether to ignore locations that are null
ar: ما إذا كان سيتم تجاهل المواقع الخالية

source: Whether to include a client-side search box
ar: ما إذا كان سيتم تضمين مربع بحث من جانب العميل

source: Whether to include the percentage in the tooltip
ar: ما إذا كان سيتم تضمين النسبة المئوية في تلميح الأدوات

source: Whether to include the time granularity as defined in the time section
ar: ما إذا كان سيتم تضمين التفاصيل الزمنية كما هو محدد في قسم الوقت

source: Whether to make the grid 3D
ar: ما إذا كنت تريد جعل الشبكة ثلاثية الأبعاد

source: Whether to make the histogram cumulative
ar: ما إذا كان يجب جعل الرسم البياني تراكميًا

source: Whether to make this column available as a [Time Granularity] option, column has to be DATETIME or DATETIME-like
ar: سواء كنت تريد إتاحة هذا العمود كخيار [Time Granularity]، يجب أن يكون العمود DATETIME أو يشبه DateTime

source: Whether to normalize the histogram
ar: ما إذا كان سيتم تطبيع الرسم البياني

source: Whether to populate autocomplete filters options
ar: ما إذا كان سيتم ملء خيارات فلاتر الإكمال التلقائي

source: Whether to populate the filter's dropdown in the explore view's filter section with a list of distinct values fetched from the backend on the fly
ar: ما إذا كنت تريد ملء القائمة المنسدلة للفلتر في قسم التصفية في عرض الاستكشاف بقائمة من القيم المميزة التي يتم جلبها من الواجهة الخلفية بسرعة
