Repository: rajpal-1/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Error: %(text)s
ar: خطأ: %(text)s

source: This filter was inherited from the dashboard's context. It won't be saved when saving the chart.
ar: تم توريث هذا الفلتر من سياق لوحة المعلومات. لن يتم حفظه عند حفظ المخطط.

source: != (Is not equal)
ar: != (غير متساو)

source: %(dialect)s cannot be used as a data source for security reasons.
ar: لا يمكن استخدام %(dialect)s كمصدر بيانات لأسباب أمنية.

source: %(message)s This may be triggered by: %(issues)s
ar: %(message)s قد يحدث هذا بسبب: %(issues)s

source: %(object)s does not exist in this database.
ar: %(object)s غير موجود في قاعدة البيانات هذه.

source: %(other)s charts will appear here
ar: ستظهر مخططات %(other)s هنا

source: %(other)s dashboards will appear here
ar: ستظهر لوحات معلومات %(other)s هنا

source: %(other)s recents will appear here
ar: %(other)s ستظهر الأخيرة هنا

source: %(other)s saved queries will appear here
ar: %(other)s ستظهر الاستعلامات المحفوظة هنا

source: %(rows)d rows returned
ar: %(rows)d الصفوف التي تم إرجاعها

source: %(subtitle)s This may be triggered by: %(issue)s
ar: %(subtitle)s قد يحدث هذا بسبب: %(issue)s

source: %(validator)s was unable to check your query. Please recheck your query. Exception: %(ex)s
ar: %(validator)s تعذر التحقق من طلب البحث. يرجى إعادة التحقق من استفسارك. استثناء: %(ex)s

source: % calculation
ar: حساب ٪

source: %s-%s of %s
ar: %s-%s من %s

source: %s Error
ar: %s خطأ

source: %s PASSWORD
ar: %s كلمة المرور

source: %s SSH TUNNEL PASSWORD
ar: %s كلمة مرور نفق SSH

source: %s SSH TUNNEL PRIVATE KEY
ar: %s مفتاح نفق SSH الخاص

source: %s SSH TUNNEL PRIVATE KEY PASSWORD
ar: %s كلمة مرور المفتاح الخاص لنفق SSH

source: %s Selected
ar: %s المحدد

source: %s Selected (%s Physical, %s Virtual)
ar: %s محدد (%s مادي، %s افتراضي)

source: %s Selected (Physical)
ar: %s محدد (مادي)

source: %s Selected (Virtual)
ar: %s محدد (افتراضي)

source: %s aggregates(s)
ar: %s المجاميع

source: %s column(s)
ar: %s عمود (أعمدة)

source: %s items could not be tagged because you don’t have edit permissions to all selected objects.
ar: تعذر وضع علامة على عناصر %s لأنه ليس لديك أذونات تحرير لكافة الكائنات المحددة.

source: %s operator(s)
ar: %s عامل (مشغلين)

source: %s option(s)
ar: %s خيار (خيارات)

source: %s saved metric(s)
ar: %s المقاييس المحفوظة

source: %s updated
ar: %s محدث

source: *%(name)s* %(description)s Error: %(text)s
ar: *%(name)s* %(description)s خطأ: %(text)s

source: + %s more
ar: + %s أكثر

source: -- Note: Unless you save your query, these tabs will NOT persist if you clear your cookies or change browsers.
ar: - ملاحظة: ما لم تقم بحفظ استعلامك ، فلن تستمر علامات التبويب هذه إذا قمت بمسح ملفات تعريف الارتباط أو تغيير المتصفحات.

source: 0 Selected
ar: 0 محدد

source: 104 weeks
ar: أسابيع 104

source: 104 weeks ago
ar: منذ 104 أسابيع

source: 10 minute
ar: 10 دقائق

source: 156 weeks
ar: أسابيع 156

source: 156 weeks ago
ar: منذ 156 أسابيع

source: 15 minute
ar: 15 دقيقة

source: 1AS
ar: 1كما

source: 1H
ar: 1 ساعة

source: 1M
ar: 1 م

source: 1T
ar: 1 ت

source: 1 calendar day frequency
ar: 1 تردد يوم تقويمي

source: 1 day
ar: يوم واحد

source: 1 day ago
ar: منذ يوم واحد

source: 1 hour
ar: ساعة واحدة

source: 1 hourly frequency
ar: تردد 1 ساعة

source: 1 minute
ar: 1 دقيقة

source: 1 minutely frequency
ar: 1 تردد دقيق

source: 1 month end frequency
ar: 1 تردد نهاية الشهر

source: 1 month start frequency
ar: 1 شهر تردد البدء

source: 1 week
ar: 1 أسبوع

source: 1 week ago
ar: 1 الأسبوع منذ

source: 1 week starting Monday (freq=W-MON)
ar: 1 أسبوع ابتداء من يوم الاثنين (freq = W-MON)

source: 1 week starting Sunday (freq=W-SUN)
ar: 1 أسبوع ابتداء من يوم الأحد (التكرار = W-SUN)

source: 1 year
ar: 1 سنة

source: 1 year ago
ar: 1 سنة منذ

source: 1 year end frequency
ar: 1 تردد نهاية السنة

source: 1 year start frequency
ar: 1 سنة تردد البدء

source: 2/98 percentiles
ar: 2/98 النسب المئوية

source: 28 days
ar: 28 يوما

source: 28 days ago
ar: منذ 28 يوم

source: 2 years
ar: 2 سنوات

source: 2 years ago
ar: منذ سنوات 2

source: 30 days
ar: 30 يوما

source: 30 days ago
ar: منذ 30 يوم

source: 30 minute
ar: 30 دقيقة

source: 30 minutes
ar: 30 دقيقة

source: 30 second
ar: 30 ثانية

source: 30 seconds
ar: 30 ثانية

source: 3 letter code of the country
ar: رمز البلد المكون من 3 أحرف

source: 3 years
ar: 3 سنوات

source: 3 years ago
ar: منذ سنوات 3

source: 4 weeks (freq=4W-MON)
ar: 4 أسابيع (التكرار = 4W-MON)

source: 52 weeks
ar: أسابيع 52

source: 52 weeks ago
ar: منذ 52 أسابيع

source: 52 weeks starting Monday (freq=52W-MON)
ar: 52 أسبوعا بدءا من يوم الاثنين (التكرار = 52W-MON)

source: 5 minute
ar: 5 دقائق

source: 5 minutes
ar: 5 دقائق

source: 5 second
ar: 5 ثوان

source: 5 seconds
ar: 5 ثوان

source: 60 days
ar: 60 يوما

source: 6 hour
ar: 6 ساعات

source: 7 calendar day frequency
ar: تردد 7 أيام تقويمية

source: 7 days
ar: 7 أيام

source: 9/91 percentiles
ar: 9/91 النسب المئوية

source: 90 days
ar: 90 يوما

source: <= (Smaller or equal)
ar: <= (أصغر أو يساوي)

source: < (Smaller than)
ar: < (أصغر من)

source: == (Is equal)
ar: == (يساوي)

source: >= (Larger or equal)
ar: >= (أكبر أو يساوي)

source: > (Larger than)
ar: > (أكبر من)

source: APPLY
ar: طبق

source: APR
ar: ابريل

source: AUG
ar: اغسطس

source: AXIS TITLE MARGIN
ar: هامش عنوان المحور

source: AXIS TITLE POSITION
ar: موضع عنوان المحور

source: A Big Number
ar: عدد كبير

source: A comma-separated list of schemas that files are allowed to upload to.
ar: قائمة مفصولة بفواصل من المخططات التي يسمح للملفات بالتحميل إليها.

source: A comma separated list of columns that should be parsed as dates
ar: قائمة مفصولة بفواصل من الأعمدة التي يجب تحليلها كتواريخ

source: A comma separated list of columns that should be parsed as dates.
ar: قائمة مفصولة بفواصل من الأعمدة التي يجب تحليلها كتواريخ.

source: A database with the same name already exists.
ar: قاعدة بيانات بنفس الاسم موجودة بالفعل.

source: A dictionary with column names and their data types if you need to change the defaults. Example: {"user_id":"integer"}
ar: قاموس يحتوي على أسماء الأعمدة وأنواع بياناتها إذا كنت بحاجة إلى تغيير الإعدادات الافتراضية. مثال: {"user_id":"integer"}

source: A full URL pointing to the location of the built plugin (could be hosted on a CDN for example)
ar: عنوان URL كامل يشير إلى موقع المكون الإضافي المدمج (يمكن استضافته على CDN على سبيل المثال)

source: A handlebars template that is applied to the data
ar: قالب مقود يتم تطبيقه على البيانات

source: A human-friendly name
ar: اسم صديق للإنسان

source: A list of domain names that can embed this dashboard. Leaving this field empty will allow embedding from any domain.
ar: قائمة بأسماء النطاقات التي يمكنها تضمين لوحة المعلومات هذه. سيسمح ترك هذا الحقل فارغا بالتضمين من أي مجال.

source: A list of tags that have been applied to this chart.
ar: قائمة بالعلامات التي تم تطبيقها على هذا المخطط.

source: A list of users who can alter the chart. Searchable by name or username.
ar: قائمة بالمستخدمين الذين يمكنهم تغيير المخطط. يمكن البحث بالاسم أو اسم المستخدم.

source: A map of the world, that can indicate values in different countries.
ar: خريطة للعالم ، يمكن أن تشير إلى القيم في بلدان مختلفة.

source: A map that takes rendering circles with a variable radius at latitude/longitude coordinates
ar: خريطة تأخذ دوائر تجسيد ذات نصف قطر متغير عند إحداثيات خطوط الطول والعرض

source: A metric to use for color
ar: مقياس للاستخدام للون

source: A new chart and dashboard will be created.
ar: سيتم إنشاء مخطط ولوحة معلومات جديدين.

source: A new chart will be created.
ar: سيتم إنشاء مخطط جديد.

source: A new dashboard will be created.
ar: سيتم إنشاء لوحة معلومات جديدة.

source: A polar coordinate chart where the circle is broken into wedges of equal angle, and the value represented by any wedge is illustrated by its area, rather than its radius or sweep angle.
ar: مخطط إحداثي قطبي حيث يتم تقسيم الدائرة إلى أسافين متساوية الزاوية ، ويتم توضيح القيمة التي يمثلها أي إسفين بمساحتها ، بدلا من نصف قطرها أو زاوية الاجتياح.

source: A readable URL for your dashboard
ar: عنوان URL قابل للقراءة للوحة التحكم الخاصة بك

source: A reference to the [Time] configuration, taking granularity into account
ar: إشارة إلى تكوين [الوقت] ، مع مراعاة الدقة

source: A report named "%(name)s" already exists
ar: تقرير باسم "%(name)s" موجود بالفعل

source: A reusable dataset will be saved with your chart.
ar: سيتم حفظ مجموعة بيانات قابلة لإعادة الاستخدام مع الرسم البياني الخاص بك.

source: A screenshot of the dashboard will be sent to your email at
ar: سيتم إرسال لقطة شاشة للوحة القيادة إلى بريدك الإلكتروني على

source: A set of parameters that become available in the query using Jinja templating syntax
ar: مجموعة من المعلمات التي تصبح متوفرة في الاستعلام باستخدام بناء جملة Jinja templating

source: A time column must be specified when using a Time Comparison.
ar: يجب تحديد عمود وقت عند استخدام مقارنة الوقت.

source: A time series chart that visualizes how a related metric from multiple groups vary over time. Each group is visualized using a different color.
ar: مخطط سلسلة زمنية يصور كيفية اختلاف مقياس ذي صلة من مجموعات متعددة بمرور الوقت. يتم تصور كل مجموعة باستخدام لون مختلف.

source: A timeout occurred while executing the query.
ar: حدث انقاط أثناء تنفيذ الاستعلام.

source: A timeout occurred while generating a csv.
ar: حدثت انقطاع أثناء إنشاء ملف csv.

source: A timeout occurred while generating a dataframe.
ar: حدث انقطاع أثناء إنشاء إطار بيانات.

source: A timeout occurred while taking a screenshot.
ar: حدث انقطاع أثناء التقاط لقطة شاشة.

source: A valid color scheme is required
ar: مطلوب نظام ألوان صالح

source: A waterfall chart is a form of data visualization that helps in understanding the cumulative effect of sequentially introduced positive or negative values. These intermediate values can either be time based or category based.
ar: المخطط الانحداري هو شكل من أشكال تصور البيانات التي تساعد في فهم التأثير التراكمي للقيم الموجبة أو السلبية المقدمة بالتتابع. يمكن أن تكون هذه القيم الوسيطة إما قائمة على الوقت أو على أساس الفئة.

source: About
ar: عن

source: Access
ar: ولوج

source: Access token
ar: رمز الوصول

source: Action
ar: فعل

source: Action Log
ar: سجل الإجراءات

source: Actions
ar: الاجراءات

source: Active
ar: نشط

source: Actual Values
ar: القيم الفعلية

source: Actual time range
ar: النطاق الزمني الفعلي

source: Actual value
ar: القيمة الفعلية

source: Actual values
ar: القيم الفعلية

source: Adaptive formatting
ar: التنسيق التكيفي

source: Add
ar: جمع

source: Add/Edit Filters
ar: إضافة/تحرير الفلاتر

source: Add Alert
ar: إضافة تنبيه

source: Add CSS Template
ar: إضافة قالب CSS

source: Add CSS template
ar: إضافة قالب CSS

source: Add Chart
ar: إضافة مخطط

source: Add Column
ar: إضافة عمود

source: Add Dashboard
ar: إضافة لوحة معلومات

source: Add Database
ar: إضافة قاعدة بيانات

source: Add Log
ar: إضافة سجل

source: Add Metric
ar: إضافة مقياس

source: Add Report
ar: إضافة تقرير

source: Add Rule
ar: إضافة قاعدة

source: Add Tag
ar: إضافة علامة

source: Add a Plugin
ar: إضافة مكون إضافي

source: Add a dataset
ar: إضافة مجموعة بيانات

source: Add a new tab
ar: إضافة علامة تبويب جديدة

source: Add a new tab to create SQL Query
ar: إضافة علامة تبويب جديدة لإنشاء استعلام SQL

source: Add additional custom parameters
ar: إضافة معلمات مخصصة إضافية

source: Add an annotation layer
ar: إضافة طبقة تعليقات توضيحية

source: Add an item
ar: إضافة عنصر

source: Add and edit filters
ar: إضافة فلاتر وتعديلها

source: Add annotation
ar: إضافة تعليق توضيحي

source: Add annotation layer
ar: إضافة طبقة تعليقات توضيحية

source: Add calculated columns to dataset in "Edit datasource" modal
ar: إضافة أعمدة محسوبة إلى مجموعة البيانات في نموذج "تحرير مصدر البيانات"

source: Add calculated temporal columns to dataset in "Edit datasource" modal
ar: إضافة أعمدة زمنية محسوبة إلى مجموعة البيانات في نموذج "تحرير مصدر البيانات"

source: Add color for positive/negative change
ar: إضافة لون للتغيير الإيجابي / السلبي

source: Add cross-filter
ar: إضافة مرشح متقاطع

source: Add custom scoping
ar: إضافة نطاق مخصص

source: Add dataset columns here to group the pivot table columns.
ar: أضف أعمدة مجموعة البيانات هنا لتجميع أعمدة الجدول المحوري.

source: Add delivery method
ar: إضافة طريقة التسليم

source: Add description of your tag
ar: إضافة وصف لعلامتك

source: Add extra connection information.
ar: أضف معلومات اتصال إضافية.

source: Add filter
ar: إضافة فلتر

source: Add filter clauses to control the filter's source query, though only in the context of the autocomplete i.e., these conditions do not impact how the filter is applied to the dashboard. This is useful when you want to improve the query's performance by only scanning a subset of the underlying data or limit the available values displayed in the filter.
ar: إضافة عبارات عامل تصفية للتحكم في استعلام مصدر عامل التصفية ، على الرغم من أنه فقط في سياق الإكمال التلقائي ، أي هذه الشروط لا تؤثر على كيفية تطبيق الفلتر على لوحة المعلومات. هذا مفيد عندما تريد تحسين أداء الاستعلام عن طريق فحص مجموعة فرعية فقط من البيانات الأساسية أو الحد من القيم المتاحة المعروضة في عامل التصفية.

source: Add filters and dividers
ar: إضافة فلاتر وفواصل

source: Add item
ar: إضافة عنصر

source: Add metric
ar: إضافة مقياس

source: Add metrics to dataset in "Edit datasource" modal
ar: إضافة مقاييس إلى مجموعة البيانات في نموذج "تحرير مصدر البيانات"

source: Add new color formatter
ar: إضافة منسق لون جديد

source: Add new formatter
ar: إضافة منسق جديد

source: Add notification method
ar: إضافة طريقة إعلام

source: Add required control values to preview chart
ar: إضافة قيم التحكم المطلوبة لمعاينة المخطط

source: Add required control values to save chart
ar: إضافة قيم التحكم المطلوبة لحفظ المخطط

source: Add sheet
ar: إضافة ورقة

source: Add tag to entities
ar: إضافة علامة إلى الكيانات

source: Add the name of the chart
ar: إضافة اسم المخطط

source: Add the name of the dashboard
ar: إضافة اسم لوحة المعلومات

source: Add to dashboard
ar: إضافة إلى لوحة القيادة

source: Added
ar: مضاف

source: Additional Parameters
ar: معلمات إضافية

source: Additional fields may be required
ar: قد تكون هناك حاجة إلى حقول إضافية

source: Additional information
ar: معلومات إضافية

source: Additional metadata
ar: بيانات وصفية إضافية

source: Additional padding for legend.
ar: حشوة إضافية للأسطورة.

source: Additional parameters
ar: معلمات إضافية

source: Additional settings.
ar: إعدادات إضافية.

source: Additional text to add before or after the value, e.g. unit
ar: نص إضافي لإضافته قبل القيمة أو بعدها، على سبيل المثال الوحدة

source: Additive
ar: المضافه

source: Adjust how this database will interact with SQL Lab.
ar: اضبط كيفية تفاعل قاعدة البيانات هذه مع SQL Lab.

source: Adjust performance settings of this database.
ar: ضبط إعدادات أداء قاعدة البيانات هذه.

source: Advanced
ar: متقدم

source: Advanced-Analytics
ar: التحليلات المتقدمة

source: Advanced Analytics
ar: تحليلات متقدمة

source: Advanced Data type
ar: نوع البيانات المتقدمة

source: Advanced analytics
ar: تحليلات متقدمة

source: Advanced analytics Query A
ar: استعلام التحليلات المتقدمة أ

source: Advanced analytics Query B
ar: استعلام التحليلات المتقدمة ب

source: Advanced data type
ar: نوع البيانات المتقدمة

source: Aesthetic
ar: الجماليه

source: After
ar: بعد

source: Aggregate
ar: تجميع

source: Aggregate Mean
ar: المتوسط الكلي

source: Aggregate Sum
ar: المجموع الإجمالي

source: Aggregate function applied to the list of points in each cluster to produce the cluster label.
ar: يتم تطبيق دالة التجميع على قائمة النقاط في كل مجموعة لإنتاج تسمية المجموعة.

source: Aggregate function to apply when pivoting and computing the total rows and columns
ar: وظيفة التجميع لتطبيقها عند تمحور وحساب إجمالي الصفوف والأعمدة

source: Aggregates data within the boundary of grid cells and maps the aggregated values to a dynamic color scale
ar: تجميع البيانات داخل حدود خلايا الشبكة وتعيين القيم المجمعة إلى مقياس ألوان ديناميكي

source: Aggregation
ar: تجميع

source: Aggregation function
ar: وظيفة التجميع

source: Alert
ar: تنبيه

source: Alert Triggered, In Grace Period
ar: تم تشغيل التنبيه ، في فترة السماح

source: Alert condition
ar: حالة التنبيه

source: Alert condition schedule
ar: جدول حالة التنبيه

source: Alert ended grace period.
ar: انتهت فترة السماح للتنبيه.

source: Alert failed
ar: فشل التنبيه

source: Alert fired during grace period.
ar: تم إطلاق التنبيه خلال فترة السماح.

source: Alert found an error while executing a query.
ar: عثر التنبيه على خطأ أثناء تنفيذ استعلام.

source: Alert name
ar: اسم التنبيه

source: Alert on grace period
ar: تنبيه بشأن فترة السماح

source: Alert query returned a non-number value.
ar: أرجع استعلام التنبيه قيمة غير رقمية.

source: Alert query returned more than one column.
ar: أرجع استعلام التنبيه أكثر من عمود واحد.

source: Alert query returned more than one column. %(num_cols)s columns returned
ar: أرجع استعلام التنبيه أكثر من عمود واحد. %(num_cols)s الأعمدة التي تم إرجاعها

source: Alert query returned more than one row.
ar: أرجع استعلام التنبيه أكثر من صف واحد.

source: Alert query returned more than one row. %(num_rows)s rows returned
ar: أرجع استعلام التنبيه أكثر من صف واحد. %(num_rows)s الصفوف التي تم إرجاعها

source: Alert running
ar: تشغيل التنبيه

source: Alert triggered, notification sent
ar: تم تشغيل التنبيه ، وتم إرسال الإشعار

source: Alert validator config error.
ar: خطأ في تكوين مدقق التنبيه.

source: Alerts
ar: تنبيهات

source: Alerts & Reports
ar: التنبيهات والتقارير

source: Alerts & reports
ar: التنبيهات والتقارير

source: Align +/-
ar: محاذاة +/-

source: All
ar: كل

source: All Text
ar: كل النص

source: All charts
ar: جميع الرسوم البيانية

source: All charts/global scoping
ar: جميع الرسوم البيانية / النطاق العالمي

source: All filters
ar: كل عوامل التصفية

source: All panels
ar: جميع اللوحات

source: All panels with this column will be affected by this filter
ar: ستتأثر جميع اللوحات التي تحتوي على هذا العمود بهذا الفلتر

source: Allow CREATE TABLE AS
ar: السماح بإنشاء جدول ك

source: Allow CREATE TABLE AS option in SQL Lab
ar: السماح بالخيار "إنشاء جدول باسم" في SQL Lab

source: Allow CREATE VIEW AS
ar: السماح بإنشاء طريقة عرض باسم

source: Allow CREATE VIEW AS option in SQL Lab
ar: السماح بالخيار "إنشاء طريقة عرض باسم" في SQL Lab

source: Allow Csv Upload
ar: السماح بتحميل csv

source: Allow DML
ar: السماح ب DML

source: Allow column names to be changed to case insensitive format, if supported (e.g. Oracle, Snowflake).
ar: اسمح بتغيير أسماء الأعمدة إلى تنسيق غير حساس لحالة الأحرف ، إذا كان مدعوما (مثل Oracle و Snowflake).

source: Allow columns to be rearranged
ar: السماح بإعادة ترتيب الأعمدة

source: Allow creation of new tables based on queries
ar: السماح بإنشاء جداول جديدة استنادا إلى الاستعلامات

source: Allow creation of new views based on queries
ar: السماح بإنشاء طرق عرض جديدة استنادا إلى الاستعلامات

source: Allow data manipulation language
ar: السماح بلغة معالجة البيانات

source: Allow end user to drag-and-drop column headers to rearrange them. Note their changes won't persist for the next time they open the chart.
ar: اسمح للمستخدم النهائي بسحب رؤوس الأعمدة وإفلاتها لإعادة ترتيبها. لاحظ أن تغييراتهم لن تستمر في المرة التالية التي يفتحون فيها المخطط.

source: Allow file uploads to database
ar: السماح بتحميل الملفات إلى قاعدة البيانات

source: Allow manipulation of the database using non-SELECT statements such as UPDATE, DELETE, CREATE, etc.
ar: السماح بمعالجة قاعدة البيانات باستخدام عبارات غير محددة مثل التحديث والحذف والإنشاء وما إلى ذلك.

source: Allow node selections
ar: السماح بتحديد العقدة

source: Allow sending multiple polygons as a filter event
ar: السماح بإرسال مضلعات متعددة كحدث تصفية

source: Allow this database to be explored
ar: السماح باستكشاف قاعدة البيانات هذه

source: Allow this database to be queried in SQL Lab
ar: السماح بالاستعلام عن قاعدة البيانات هذه في SQL Lab

source: Allow users to run non-SELECT statements (UPDATE, DELETE, CREATE, ...) in SQL Lab
ar: السماح للمستخدمين بتشغيل عبارات غير محددة (تحديث ، حذف ، إنشاء ، ...) في SQL Lab

source: Allowed Domains (comma separated)
ar: المجالات المسموح بها (مفصولة بفواصل)

source: Alphabetical
ar: أبجدي

source: Also known as a box and whisker plot, this visualization compares the distributions of a related metric across multiple groups. The box in the middle emphasizes the mean, median, and inner 2 quartiles. The whiskers around each box visualize the min, max, range, and outer 2 quartiles.
ar: يعرف هذا التصور أيضا باسم مخطط المربع والشارب ، ويقارن توزيعات مقياس ذي صلة عبر مجموعات متعددة. يؤكد المربع الموجود في المنتصف على متوسط ومتوسط وأرباع 2 الداخلية. تصور الشعيرات حول كل صندوق الأرباع الدقيقة والقصوى والنطاق والخارجي 2.

source: Altered
ar: تغيير

source: Always filter main datetime column
ar: تصفية عمود التاريخ والوقت الرئيسي دائما

source: An Error Occurred
ar: حدث خطأ

source: An alert named "%(name)s" already exists
ar: تنبيه باسم "%(name)s" موجود بالفعل

source: An enclosed time range (both start and end) must be specified when using a Time Comparison.
ar: يجب تحديد نطاق زمني مرفق (بداية ونهاية) عند استخدام مقارنة الوقت.

source: An engine must be specified when passing individual parameters to a database.
ar: يجب تحديد المحرك عند تمرير المعلمات الفردية إلى قاعدة بيانات.

source: An error has occurred
ar: حدث خطأ

source: An error occurred
ar: حدث خطأ

source: An error occurred saving dataset
ar: حدث خطأ أثناء حفظ مجموعة البيانات

source: An error occurred when running alert query
ar: حدث خطأ عند تشغيل استعلام التنبيه

source: An error occurred while accessing the value.
ar: حدث خطأ أثناء الوصول إلى القيمة.

source: An error occurred while collapsing the table schema. Please contact your administrator.
ar: حدث خطأ أثناء طي مخطط الجدول. الرجاء الاتصال بالمسؤول.

source: An error occurred while creating %ss: %s
ar: حدث خطأ أثناء إنشاء %ss: %s

source: An error occurred while creating the data source
ar: حدث خطأ أثناء إنشاء مصدر البيانات

source: An error occurred while creating the value.
ar: حدث خطأ أثناء إنشاء القيمة.

source: An error occurred while deleting the value.
ar: حدث خطأ أثناء حذف القيمة.

source: An error occurred while expanding the table schema. Please contact your administrator.
ar: حدث خطأ أثناء توسيع مخطط الجدول. الرجاء الاتصال بالمسؤول.

source: An error occurred while fetching %s info: %s
ar: حدث خطأ أثناء جلب معلومات %s: %s

source: An error occurred while fetching %ss: %s
ar: حدث خطأ أثناء جلب %ss: %s

source: An error occurred while fetching available CSS templates
ar: حدث خطأ أثناء جلب قوالب CSS المتوفرة

source: An error occurred while fetching chart owners values: %s
ar: حدث خطأ أثناء جلب قيم مالكي المخططات: %s

source: An error occurred while fetching dashboard owner values: %s
ar: حدث خطأ أثناء جلب قيم مالك لوحة المعلومات: %s

source: An error occurred while fetching dashboards
ar: حدث خطأ أثناء جلب لوحات المعلومات

source: An error occurred while fetching dashboards: %s
ar: حدث خطأ أثناء جلب لوحات المعلومات: %s

source: An error occurred while fetching database related data: %s
ar: حدث خطأ أثناء جلب البيانات المتعلقة بقاعدة البيانات: %s

source: An error occurred while fetching database values: %s
ar: حدث خطأ أثناء جلب قيم قاعدة البيانات: %s

source: An error occurred while fetching dataset datasource values: %s
ar: حدث خطأ أثناء جلب قيم مصدر بيانات مجموعة البيانات: %s

source: An error occurred while fetching dataset owner values: %s
ar: حدث خطأ أثناء جلب قيم مالك مجموعة البيانات: %s

source: An error occurred while fetching dataset related data
ar: حدث خطأ أثناء جلب البيانات المتعلقة بمجموعة البيانات

source: An error occurred while fetching dataset related data: %s
ar: حدث خطأ أثناء جلب البيانات المتعلقة بمجموعة البيانات: %s

source: An error occurred while fetching datasets: %s
ar: حدث خطأ أثناء جلب مجموعات البيانات: %s

source: An error occurred while fetching function names.
ar: حدث خطأ أثناء جلب أسماء الوظائف.

source: An error occurred while fetching owners values: %s
ar: حدث خطأ أثناء جلب قيم المالكين: %s
