Repository: rajpal-1/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: No dashboards yet
ar: لا توجد لوحات معلومات حتى الآن

source: No data
ar: ما من بيانات

source: No data after filtering or data is NULL for the latest time record
ar: لا توجد بيانات بعد التصفية أو البيانات فارغة لأحدث سجل زمني

source: No data in file
ar: لا توجد بيانات في الملف

source: No databases match your search
ar: لا توجد قواعد بيانات تطابق بحثك

source: No description available.
ar: لا يوجد وصف متاح.

source: No entities have this tag currently assigned
ar: لم يتم تعيين هذه العلامة حاليًا لأي كيانات

source: No filter
ar: لا يوجد فلتر

source: No filter is selected.
ar: لم يتم تحديد أي فلتر.

source: No filters
ar: لا توجد فلاتر

source: No filters are currently added to this dashboard.
ar: لم تتم إضافة أي فلاتر حاليًا إلى لوحة التحكم هذه.

source: No form settings were maintained
ar: لم تتم المحافظة على إعدادات النموذج

source: No global filters are currently added
ar: لا توجد فلاتر عالمية مضافة حاليًا

source: No matching records found
ar: لم يتم العثور على سجلات مطابقة

source: No of Bins
ar: عدد الصناديق

source: No recents yet
ar: لا يوجد حديث حتى الآن

source: No records found
ar: لم يتم العثور على أية سجلات

source: No results
ar: لا توجد نتائج

source: No results found
ar: لم يتم العثور على نتائج

source: No results match your filter criteria
ar: لا توجد نتائج تطابق معايير التصفية

source: No results were returned for this query
ar: لم يتم إرجاع أي نتائج لهذا الاستعلام

source: No results were returned for this query. If you expected results to be returned, ensure any filters are configured properly and the datasource contains data for the selected time range.
ar: لم يتم إرجاع أي نتائج لهذا الاستعلام. إذا كنت تتوقع إرجاع النتائج، فتأكد من تكوين أي عوامل تصفية بشكل صحيح وأن مصدر البيانات يحتوي على بيانات للنطاق الزمني المحدد.

source: No rows were returned for this dataset
ar: لم يتم إرجاع أي صفوف لمجموعة البيانات هذه

source: No samples were returned for this dataset
ar: لم يتم إرجاع أي عينات لمجموعة البيانات هذه

source: No saved expressions found
ar: لم يتم العثور على تعبيرات محفوظة

source: No saved metrics found
ar: لم يتم العثور على مقاييس محفوظة

source: No saved queries yet
ar: لا توجد استعلامات محفوظة حتى الآن

source: No stored results found, you need to re-run your query
ar: لم يتم العثور على نتائج مخزنة، تحتاج إلى إعادة تشغيل الاستعلام

source: No such column found. To filter on a metric, try the Custom SQL tab.
ar: لم يتم العثور على مثل هذا العمود. للتصفية على مقياس، جرّب علامة تبويب SQL المخصصة.

source: No table columns
ar: لا توجد أعمدة جدول

source: No temporal columns found
ar: لم يتم العثور على أعمدة مؤقتة

source: No time columns
ar: لا توجد أعمدة زمنية

source: No validator found (configured for the engine)
ar: لم يتم العثور على مدقق (تم تكوينه للمحرك)

source: No validator named %(validator_name)s found (configured for the %(engine_spec)s engine)
ar: لم يتم %(validator_name)s العثور على مدقق مسمى (تم تكوينه %(engine_spec)s للمحرك)

source: Node label position
ar: موضع تسمية العقدة

source: Node select mode
ar: وضع تحديد العقدة

source: Node size
ar: حجم العقدة

source: None
ar: لا شيء

source: None -> Arrow
ar: لا شيء -> سهم

source: None -> None
ar: لا شيء -> لا شيء

source: Normal
ar: عادي

source: Normalize Across
ar: التطبيع عبر

source: Normalize column names
ar: تطبيع أسماء الأعمدة

source: Normalized
ar: تم تطبيعه

source: Not Time Series
ar: ليست سلسلة زمنية

source: Not added to any dashboard
ar: لم تتم إضافتها إلى أي لوحة معلومات

source: Not available
ar: غير متوفر

source: Not defined
ar: لم يتم تعريفه

source: Not equal to (≠)
ar: لا يساوي (≠)

source: Not in
ar: ليس في

source: Not null
ar: ليست خالية

source: Not triggered
ar: لم يتم تشغيله

source: Not up to date
ar: غير محدّث

source: Nothing triggered
ar: لم يتم تشغيل أي شيء

source: Notification method
ar: طريقة الإعلام

source: November
ar: شهر نوفمبر

source: Now
ar: الآن

source: Null Values
ar: القيم الخالية

source: Null imputation
ar: عزو لاغٍ

source: Null or Empty
ar: فارغ أو فارغ

source: Null values
ar: القيم الخالية

source: Number Format
ar: صيغة الأرقام

source: Number bounds used for color encoding from red to blue. Reverse the numbers for blue to red. To get pure red or blue, you can enter either only min or max.
ar: حدود الأرقام المستخدمة لترميز الألوان من الأحمر إلى الأزرق. قم بعكس الأرقام من الأزرق إلى الأحمر. للحصول على اللون الأحمر النقي أو الأزرق، يمكنك إدخال الحد الأدنى أو الحد الأقصى فقط.

source: Number format
ar: صيغة الأرقام

source: Number format string
ar: سلسلة بصيغة الأرقام

source: Number formatting
ar: تنسيق الأرقام

source: Number of buckets to group data
ar: عدد المجموعات لتجميع البيانات

source: Number of decimal digits to round numbers to
ar: عدد الأرقام العشرية لتقريب الأرقام إلى

source: Number of decimal places with which to display lift values
ar: عدد المنازل العشرية التي يتم بها عرض قيم الرفع

source: Number of decimal places with which to display p-values
ar: عدد المنازل العشرية التي يتم بها عرض قيم p

source: Number of periods to compare against. You can use negative numbers to compare from the beginning of the time range.
ar: عدد الفترات للمقارنة بها. يمكنك استخدام الأرقام السالبة للمقارنة من بداية النطاق الزمني.

source: Number of periods to ratio against
ar: عدد الفترات بالنسبة لها

source: Number of rows of file to read
ar: عدد صفوف الملف المراد قراءتها

source: Number of rows of file to read.
ar: عدد صفوف الملف المراد قراءتها.

source: Number of rows to skip at start of file
ar: عدد الصفوف التي يجب تخطيها في بداية الملف

source: Number of rows to skip at start of file.
ar: عدد الصفوف التي يجب تخطيها في بداية الملف.

source: Number of split segments on the axis
ar: عدد المقاطع المقسمة على المحور

source: Number of steps to take between ticks when displaying the X scale
ar: عدد الخطوات التي يجب اتخاذها بين العلامات عند عرض مقياس X

source: Number of steps to take between ticks when displaying the Y scale
ar: عدد الخطوات التي يجب اتخاذها بين العلامات عند عرض مقياس Y

source: Numerical range
ar: نطاق عددي

source: OCT
ar: أكتوبر

source: OVERWRITE
ar: الكتابة الفوقية

source: October
ar: اكتوبر

source: Offline
ar: غير متصل على الانترنت

source: Offset
ar: تعويض

source: On Grace
ar: أون غرايس

source: One or many columns to group by. High cardinality groupings should include a series limit to limit the number of fetched and rendered series.
ar: عمود واحد أو عدة أعمدة للتجميع حسب. يجب أن تتضمن مجموعات الكاردينالية العالية حدًا للسلسلة للحد من عدد السلاسل التي تم جلبها وعرضها.

source: One or many controls to group by. If grouping, latitude and longitude columns must be present.
ar: عنصر تحكم واحد أو أكثر للتجميع حسب. في حالة التجميع، يجب أن تكون أعمدة خطوط الطول والعرض موجودة.

source: One or many controls to pivot as columns
ar: عنصر تحكم واحد أو عدة عناصر للمحور كأعمدة

source: One or many metrics to display
ar: مقياس واحد أو عدة مقاييس لعرضها

source: One or more columns already exist
ar: عمود واحد أو أكثر موجود بالفعل

source: One or more columns are duplicated
ar: يتم تكرار عمود واحد أو أكثر

source: One or more columns do not exist
ar: لا يوجد عمود واحد أو أكثر

source: One or more metrics already exist
ar: يوجد بالفعل مقياس واحد أو أكثر

source: One or more metrics are duplicated
ar: يتم تكرار مقياس واحد أو أكثر

source: One or more metrics do not exist
ar: لا يوجد مقياس واحد أو أكثر

source: One or more parameters needed to configure a database are missing.
ar: هناك معلمة واحدة أو أكثر مطلوبة لتكوين قاعدة بيانات مفقودة.

source: One or more parameters specified in the query are malformed.
ar: تم تحديد معلمة واحدة أو أكثر في الاستعلام بشكل غير صحيح.

source: One or more parameters specified in the query are missing.
ar: هناك معلمة واحدة أو أكثر محددة في الاستعلام مفقودة.

source: One ore more annotation layers failed loading.
ar: فشلت طبقة أخرى من التعليقات التوضيحية في التحميل.

source: Only SELECT statements are allowed against this database.
ar: يُسمح فقط باستخدام عبارات SELECT مقابل قاعدة البيانات هذه.

source: Only Total
ar: الإجمالي فقط

source: Only `SELECT` statements are allowed
ar: يُسمح فقط بعبارات «SELECT»

source: Only applies when "Label Type" is not set to a percentage.
ar: ينطبق فقط عندما لا يتم تعيين «نوع التسمية» إلى نسبة مئوية.

source: Only applies when "Label Type" is set to show values.
ar: لا ينطبق إلا عند تعيين «نوع التسمية» لإظهار القيم.

source: Only selected panels will be affected by this filter
ar: اللوحات المحددة فقط هي التي ستتأثر بهذا الفلتر

source: Only show the total value on the stacked chart, and not show on the selected category
ar: اعرض القيمة الإجمالية فقط على المخطط المكدس، ولا تظهر في الفئة المحددة

source: Only single queries supported
ar: يتم دعم الاستعلامات الفردية فقط

source: Only the following file extensions are allowed: %(allowed_extensions)s
ar: يُسمح فقط بامتدادات الملفات التالية: %(allowed_extensions)s

source: Oops! An error occurred!
ar: عفوًا! حدث خطأ!

source: Opacity
ar: التعتيم

source: Opacity, expects values between 0 and 100
ar: العتامة، تتوقع القيم بين 0 و 100

source: Opacity of Area Chart. Also applies to confidence band.
ar: عتامة مخطط المنطقة. ينطبق أيضًا على فرقة الثقة.

source: Opacity of all clusters, points, and labels. Between 0 and 1.
ar: عتامة كل المجموعات والنقاط والتسميات. بين 0 و 1.

source: Opacity of area chart.
ar: عتامة المخطط المساحي.

source: Opacity of bubbles, 0 means completely transparent, 1 means opaque
ar: عتامة الفقاعات، 0 تعني الشفافية الكاملة، 1 تعني عدم الشفافية

source: Open Datasource tab
ar: افتح علامة تبويب مصدر البيانات

source: Open in SQL Lab
ar: افتح في مختبر SQL

source: Open query in SQL Lab
ar: افتح الاستعلام في SQL Lab

source: Operate the database in asynchronous mode, meaning that the queries are executed on remote workers as opposed to on the web server itself. This assumes that you have a Celery worker setup as well as a results backend. Refer to the installation docs for more information.
ar: قم بتشغيل قاعدة البيانات في الوضع غير المتزامن، مما يعني أن الاستعلامات يتم تنفيذها على العاملين عن بعد بدلاً من خادم الويب نفسه. يفترض هذا أن لديك إعداد عامل Celery بالإضافة إلى خلفية النتائج. راجع مستندات التثبيت لمزيد من المعلومات.

source: Operator
ar: المشغل

source: Operator undefined for aggregator: %(name)s
ar: عامل التشغيل غير محدد للمجمع: %(name)s

source: Optional CA_BUNDLE contents to validate HTTPS requests. Only available on certain database engines.
ar: محتويات CA_BUNDLE الاختيارية للتحقق من صحة طلبات HTTPS. متاح فقط على محركات قواعد بيانات معينة.

source: Optional d3 date format string
ar: سلسلة اختيارية لتنسيق التاريخ d3

source: Optional d3 number format string
ar: سلسلة اختيارية بصيغة رقم d3

source: Optional name of the data column.
ar: اسم اختياري لعمود البيانات.

source: Optional warning about use of this metric
ar: تحذير اختياري حول استخدام هذا المقياس

source: Options
ar: خيارات

source: Or choose from a list of other databases we support:
ar: أو اختر من قائمة قواعد البيانات الأخرى التي ندعمها:

source: Order by entity id
ar: الترتيب حسب معرف الكيان

source: Order results by selected columns
ar: ترتيب النتائج حسب الأعمدة المحددة

source: Ordering
ar: الترتيب

source: Orientation
ar: اتجاه

source: Orientation of bar chart
ar: اتجاه المخطط الشريطي

source: Orientation of filter bar
ar: اتجاه شريط التصفية

source: Orientation of tree
ar: اتجاه الشجرة

source: Original
ar: أصلي

source: Original table column order
ar: ترتيب أعمدة الجدول الأصلي

source: Original value
ar: القيمة الأصلية

source: Orthogonal
ar: متعامد

source: Other
ar: آخر

source: Outdoors
ar: في الهواء الطلق

source: Outer Radius
ar: الشعاع الخارجي

source: Outer edge of Pie chart
ar: الحافة الخارجية للمخطط الدائري

source: Overlap
ar: تداخل

source: Overlay one or more timeseries from a relative time period. Expects relative time deltas in natural language (example: 24 hours, 7 days, 52 weeks, 365 days). Free text is supported.
ar: قم بتراكب سلسلة زمنية واحدة أو أكثر من فترة زمنية نسبية. تتوقع فترات دلتا زمنية نسبية باللغة الطبيعية (على سبيل المثال: 24 ساعة، 7 أيام، 52 أسبوعًا، 365 يومًا). النص المجاني مدعوم.

source: Overlay one or more timeseries from a relative time period. Expects relative time deltas in natural language (example: 24 hours, 7 days, 52 weeks, 365 days). Free text is supported.
ar: قم بتراكب سلسلة زمنية واحدة أو أكثر من فترة زمنية نسبية. تتوقع فترات دلتا زمنية نسبية باللغة الطبيعية (على سبيل المثال: 24 ساعة، 7 أيام، 52 أسبوعًا، 365 يومًا). النص المجاني مدعوم.

source: Overlays a hexagonal grid on a map, and aggregates data within the boundary of each cell.
ar: يقوم بتراكب شبكة سداسية على الخريطة، ويقوم بتجميع البيانات داخل حدود كل خلية.

source: Override time grain
ar: تجاوز الحبوب الزمنية

source: Override time range
ar: تجاوز النطاق الزمني

source: Overwrite
ar: الكتابة الفوقية

source: Overwrite & Explore
ar: الكتابة والاستكشاف

source: Overwrite Dashboard [%s]
ar: استبدال لوحة التحكم [%s]

source: Overwrite Duplicate Columns
ar: الكتابة فوق الأعمدة المكررة

source: Overwrite existing
ar: الكتابة فوق القائمة

source: Overwrite text in the editor with a query on this table
ar: استبدل النص في المحرر باستخدام استعلام في هذا الجدول

source: Owned Created or Favored
ar: مملوك أو تم إنشاؤه أو تفضيله

source: Owner
ar: مالك

source: Owners
ar: المالكون

source: Owners are invalid
ar: المالكون غير صالحين

source: Owners is a list of users who can alter the dashboard.
ar: المالكون عبارة عن قائمة بالمستخدمين الذين يمكنهم تغيير لوحة المعلومات.

source: Owners is a list of users who can alter the dashboard. Searchable by name or username.
ar: المالكون عبارة عن قائمة بالمستخدمين الذين يمكنهم تغيير لوحة المعلومات. يمكن البحث عن طريق الاسم أو اسم المستخدم.

source: PDF download failed, please refresh and try again.
ar: فشل تنزيل ملف PDF، يرجى التحديث والمحاولة مرة أخرى.

source: Page length
ar: طول الصفحة

source: Paired t-test Table
ar: جدول اختبار t المقترن

source: Pandas resample method
ar: طريقة إعادة تشكيل الباندا

source: Pandas resample rule
ar: قواعد إعادة تشكيل الباندا

source: Parallel Coordinates
ar: الإحداثيات المتوازية

source: Parameter error
ar: خطأ المعلمة

source: Parameters
ar: المعلمات

source: Parameters
ar: المعلمات

source: Parameters related to the view and perspective on the map
ar: المعلمات المتعلقة بالعرض والمنظور على الخريطة

source: Parent
ar: ولي الأمر

source: Parse Dates
ar: تحليل التواريخ

source: Part of a Whole
ar: جزء من الكل

source: Partition Chart
ar: مخطط التقسيم

source: Partition Diagram
ar: مخطط التقسيم

source: Partition Limit
ar: حد التقسيم

source: Partition Threshold
ar: عتبة التقسيم

source: Partitions whose height to parent height proportions are below this value are pruned
ar: يتم تقليم الأقسام التي تكون نسب ارتفاعها إلى ارتفاع الأصل أقل من هذه القيمة.

source: Password
ar: كلمه المرور

source: Paste Private Key here
ar: قم بلصق المفتاح الخاص هنا

source: Paste content of service credentials JSON file here
ar: قم بلصق محتوى بيانات اعتماد الخدمة (ملف JSON) هنا

source: Paste the shareable Google Sheet URL here
ar: قم بلصق عنوان URL لورقة Google القابلة للمشاركة هنا

source: Pattern
ar: نمط

source: Percent Change
ar: تغيير النسبة المئوية

source: Percent of total
ar: النسبة المئوية من الإجمالي

source: Percentage
ar: النسبة المئوية

source: Percentage change
ar: تغيير النسبة المئوية

source: Percentage metrics
ar: مقاييس النسبة المئوية

source: Percentage threshold
ar: عتبة النسبة المئوية

source: Percentages
ar: النسب المئوية

source: Performance
ar: الأداء

source: Period average
ar: متوسط الفترة

source: Periods
ar: فترات

source: Periods must be a whole number
ar: يجب أن تكون الفترات عبارة عن رقم صحيح

source: Person or group that has certified this chart.
ar: الشخص أو المجموعة التي اعتمدت هذا المخطط.

source: Person or group that has certified this dashboard.
ar: الشخص أو المجموعة التي اعتمدت لوحة التحكم هذه.

source: Person or group that has certified this metric
ar: الشخص أو المجموعة التي اعتمدت هذا المقياس

source: Physical
ar: فيزيائي

source: Physical (table or view)
ar: المادية (الجدول أو العرض)

source: Physical dataset
ar: مجموعة البيانات المادية

source: Pick a dimension from which categorical colors are defined
ar: اختر البعد الذي يتم من خلاله تحديد الألوان الفئوية

source: Pick a metric for x, y and size
ar: اختر مقياسًا لـ x وy والحجم

source: Pick a metric to display
ar: اختر مقياسًا لعرضه

source: Pick a name to help you identify this database.
ar: اختر اسمًا لمساعدتك في تحديد قاعدة البيانات هذه.

source: Pick a nickname for how the database will display in Superset.
ar: اختر اسمًا مستعارًا لكيفية عرض قاعدة البيانات في Superset.

source: Pick a set of deck.gl charts to layer on top of one another
ar: اختر مجموعة من مخططات deck.gl لوضعها فوق بعضها البعض

source: Pick a title for you annotation.
ar: اختر عنوانًا للتعليق التوضيحي الخاص بك.

source: Pick at least one field for [Series]
ar: اختر حقلاً واحدًا على الأقل لـ [السلسلة]

source: Pick at least one metric
ar: اختر مقياسًا واحدًا على الأقل

source: Pick exactly 2 columns as [Source / Target]
ar: اختر عمودين بالضبط كـ [المصدر/الهدف]

source: Pick one or more columns that should be shown in the annotation. If you don't select a column all of them will be shown.
ar: اختر عمودًا واحدًا أو أكثر يجب عرضه في التعليق التوضيحي. إذا لم تقم بتحديد عمود، فسيتم عرض كل منهم.

source: Pick your favorite markup language
ar: اختر لغة الترميز المفضلة لديك

source: Pie Chart
ar: مخطط دائري

source: Pie Chart (legacy)
ar: مخطط دائري (قديم)

source: Pie shape
ar: شكل فطيرة

source: Pin
ar: الرقم السري

source: Pivot Table
ar: الجدول المحوري

source: Pivot operation must include at least one aggregate
ar: يجب أن تتضمن العملية المحورية تجميعًا واحدًا على الأقل

source: Pivot operation requires at least one index
ar: تتطلب العملية المحورية فهرسًا واحدًا على الأقل

source: Pivoted
ar: ممحور

source: Pixel height of each series
ar: ارتفاع البكسل لكل سلسلة

source: Pixels
ar: بكسل

source: Plain
ar: عادي

source: Please DO NOT overwrite the "filter_scopes" key.
ar: يرجى عدم الكتابة فوق مفتاح «filter_scopes».

source: Please check your query and confirm that all template parameters are surround by double braces, for example, "{{ ds }}". Then, try running your query again.
ar: يرجى التحقق من الاستعلام الخاص بك والتأكد من أن جميع معلمات القالب محاطة بأقواس مزدوجة، على سبيل المثال، "{{ ds }}». ثم حاول تشغيل الاستعلام مرة أخرى.

source: Please check your query for syntax errors at or near "%(syntax_error)s". Then, try running your query again.
ar: يرجى التحقق من الاستعلام الخاص بك بحثًا عن أخطاء في بناء الجملة عند "%(syntax_error)s» أو بالقرب منه. ثم حاول تشغيل الاستعلام مرة أخرى.

source: Please check your query for syntax errors near "%(server_error)s". Then, try running your query again.
ar: يرجى التحقق من الاستعلام الخاص بك عن أخطاء بناء الجملة بالقرب من "%(server_error)s». ثم حاول تشغيل الاستعلام مرة أخرى.

source: Please check your template parameters for syntax errors and make sure they match across your SQL query and Set Parameters. Then, try running your query again.
ar: يرجى التحقق من معاملات القالب بحثًا عن أخطاء بناء الجملة والتأكد من تطابقها عبر استعلام SQL وتعيين المعلمات. ثم حاول تشغيل الاستعلام مرة أخرى.

source: Please choose at least one groupby
ar: يرجى اختيار مجموعة واحدة على الأقل حسب

source: Please confirm
ar: يرجى التأكيد

source: Please confirm the overwrite values.
ar: يرجى تأكيد قيم الاستبدال.

source: Please enter a SQLAlchemy URI to test
ar: يرجى إدخال عنوان URL الخاص بـ SQLalChemy للاختبار

source: Please re-enter the password.
ar: يرجى إعادة إدخال كلمة المرور.

source: Please re-export your file and try importing again
ar: يرجى إعادة تصدير الملف ومحاولة الاستيراد مرة أخرى

source: Please save the query to enable sharing
ar: يرجى حفظ الاستعلام لتمكين المشاركة

source: Please save your chart first, then try creating a new email report.
ar: يرجى حفظ المخطط أولاً، ثم محاولة إنشاء تقرير بريد إلكتروني جديد.

source: Please save your dashboard first, then try creating a new email report.
ar: يرجى حفظ لوحة التحكم أولاً، ثم محاولة إنشاء تقرير بريد إلكتروني جديد.

source: Please select both a Dataset and a Chart type to proceed
ar: يرجى تحديد كل من مجموعة البيانات ونوع المخطط للمتابعة

source: Please use 3 different metric labels
ar: يرجى استخدام 3 ملصقات مترية مختلفة

source: Plot the distance (like flight paths) between origin and destination.
ar: ارسم المسافة (مثل مسارات الطيران) بين الأصل والوجهة.

source: Plots the individual metrics for each row in the data vertically and links them together as a line. This chart is useful for comparing multiple metrics across all of the samples or rows in the data.
ar: يرسم المقاييس الفردية لكل صف في البيانات عموديًا ويربطها معًا كخط. يعد هذا المخطط مفيدًا لمقارنة مقاييس متعددة عبر جميع العينات أو الصفوف في البيانات.

source: Plugins
ar: الإضافات

source: Point Color
ar: لون النقاط

source: Point Radius
ar: بوينت راديوس

source: Point Radius Scale
ar: مقياس الشعاع النقطي

source: Point Radius Unit
ar: وحدة بوينت راديوس

source: Point Size
ar: حجم النقطة

source: Point Unit
ar: وحدة النقاط

source: Point to your spatial columns
ar: أشر إلى الأعمدة المكانية

source: Points
ar: نقاط

source: Points and clusters will update as the viewport is being changed
ar: سيتم تحديث النقاط والمجموعات عندما يتم تغيير إطار العرض

source: Polygon Column
ar: عمود مضلع

source: Polygon Encoding
ar: ترميز المضلع

source: Polygon Settings
ar: إعدادات المضلع

source: Polyline
ar: متعدد الخطوط

source: Popular
ar: رائج

source: Populate "Default value" to enable this control
ar: قم بتعبئة «القيمة الافتراضية» لتمكين عنصر التحكم هذا

source: Population age data
ar: بيانات عمر السكان

source: Port
ar: ميناء

source: Port %(port)s on hostname "%(hostname)s" refused the connection.
ar: رفض المنفذ الموجود %(port)s على اسم المضيف %(hostname)s "" الاتصال.

source: Port out of range 0-65535
ar: منفذ خارج النطاق 0-65535

source: Position JSON
ar: الموضع: جسون

source: Position of child node label on tree
ar: موضع تسمية العقدة الفرعية على الشجرة

source: Position of column level subtotal
ar: موضع المجموع الفرعي على مستوى العمود

source: Position of intermediate node label on tree
ar: موضع تسمية العقدة الوسيطة على الشجرة

source: Position of row level subtotal
ar: موضع المجموع الفرعي لمستوى الصف

source: Powered by Apache Superset
ar: مدعوم من أباتشي سوبيرسيت

source: Pre-filter
ar: التصفية المسبقة

source: Pre-filter available values
ar: التصفية المسبقة للقيم المتاحة

source: Pre-filter is required
ar: التصفية المسبقة مطلوبة

source: Predicate applied when fetching distinct value to populate the filter control component. Supports jinja template syntax. Applies only when `Enable Filter Select` is on.
ar: يتم تطبيق المسند عند جلب قيمة مميزة لتعبئة مكون التحكم في التصفية. يدعم صيغة قالب جينجا. لا ينطبق إلا عند تشغيل «تمكين تحديد عامل التصفية».

source: Predictive
ar: تنبؤي

source: Predictive Analytics
ar: تحليلات تنبؤية

source: Prefix
ar: بادئة

source: Prefix or suffix
ar: بادئة أو لاحقة

source: Preview
ar: استطلاع

source: Preview: `%s`
ar: المعاينة: `%s`

source: Previous
ar: السابق

source: Previous Line
ar: السطر السابق

source: Primary
ar: ابتدائي

source: Primary Metric
ar: المقياس الأساسي

source: Primary key
ar: المفتاح الأساسي

source: Primary or secondary y-axis
ar: المحور الصادي الأساسي أو الثانوي

source: Primary y-axis Bounds
ar: حدود المحور الصادي الأساسي

source: Primary y-axis format
ar: تنسيق المحور الصادي الأساسي

source: Private Key
ar: مفتاح خاص

source: Private Key & Password
ar: المفتاح الخاص وكلمة المرور

source: Private Key Password
ar: كلمة مرور المفتاح الخاص

source: Proceed
ar: تابع

source: Progress
ar: التقدم

source: Progressive
ar: التقدمية

source: Propagate
ar: نشر

source: Proportional
ar: نسبي

source: Public and privately shared sheets
ar: أوراق عامة ومشتركة بشكل خاص

source: Publicly shared sheets only
ar: أوراق تمت مشاركتها علنًا فقط

source: Published
ar: منشورة

source: Purple
ar: أرجواني

source: Put labels outside
ar: ضع الملصقات في الخارج

source: Put the labels outside of the pie?
ar: ضع الملصقات خارج الفطيرة؟
