Repository: rajpal-1/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: An error occurred while fetching schema values: %s
ar: حدث خطأ أثناء جلب قيم المخطط: %s

source: An error occurred while fetching tab state
ar: حدث خطأ أثناء جلب حالة علامة التبويب

source: An error occurred while fetching table metadata
ar: حدث خطأ أثناء جلب بيانات تعريف الجدول

source: An error occurred while fetching table metadata. Please contact your administrator.
ar: حدث خطأ أثناء جلب بيانات تعريف الجدول. الرجاء الاتصال بالمسؤول.

source: An error occurred while fetching user values: %s
ar: حدث خطأ أثناء جلب قيم المستخدم: %s

source: An error occurred while importing %s: %s
ar: حدث خطأ أثناء استيراد %s: %s

source: An error occurred while loading dashboard information.
ar: حدث خطأ أثناء تحميل معلومات لوحة المعلومات.

source: An error occurred while loading the SQL
ar: حدث خطأ أثناء تحميل SQL

source: An error occurred while opening Explore
ar: حدث خطأ أثناء فتح استكشاف

source: An error occurred while parsing the key.
ar: حدث خطأ أثناء تحليل المفتاح.

source: An error occurred while pruning logs
ar: حدث خطأ أثناء تقليم السجلات

source: An error occurred while removing query. Please contact your administrator.
ar: حدث خطأ أثناء إزالة الاستعلام. الرجاء الاتصال بالمسؤول.

source: An error occurred while removing tab. Please contact your administrator.
ar: حدث خطأ أثناء إزالة علامة التبويب. الرجاء الاتصال بالمسؤول.

source: An error occurred while removing the table schema. Please contact your administrator.
ar: حدث خطأ أثناء إزالة مخطط الجدول. الرجاء الاتصال بالمسؤول.

source: An error occurred while rendering the visualization: %s
ar: حدث خطأ أثناء عرض المرئيات: %s

source: An error occurred while setting the active tab. Please contact your administrator.
ar: حدث خطأ أثناء تعيين علامة التبويب النشطة. الرجاء الاتصال بالمسؤول.

source: An error occurred while starring this chart
ar: حدث خطأ أثناء تمييز هذا المخطط بنجمة

source: An error occurred while storing your query in the backend. To avoid losing your changes, please save your query using the "Save Query" button.
ar: حدث خطأ أثناء تخزين الاستعلام في الواجهة الخلفية. لتجنب فقدان التغييرات ، يرجى حفظ استفسارك باستخدام زر "حفظ الاستعلام".

source: An error occurred while updating the value.
ar: حدث خطأ أثناء تحديث القيمة.

source: An error occurred while upserting the value.
ar: حدث خطأ أثناء رفع القيمة.

source: An unexpected error occurred
ar: حدث خطأ غير متوقع

source: Anchor to
ar: مرساة إلى

source: Angle at which to end progress axis
ar: الزاوية التي ينتهي عندها محور التقدم

source: Angle at which to start progress axis
ar: الزاوية التي يبدأ عندها محور التقدم

source: Animation
ar: رسم متحرك

source: Annotation
ar: تعليق توضيحي

source: Annotation Layer %s
ar: طبقة التعليقات التوضيحية %s

source: Annotation Layers
ar: طبقات التعليقات التوضيحية

source: Annotation Slice Configuration
ar: تكوين شريحة التعليق التوضيحي

source: Annotation could not be created.
ar: تعذر إنشاء التعليق التوضيحي.

source: Annotation could not be updated.
ar: تعذر تحديث التعليق التوضيحي.

source: Annotation layer
ar: طبقة التعليقات التوضيحية

source: Annotation layer could not be created.
ar: تعذر إنشاء طبقة التعليقات التوضيحية.

source: Annotation layer could not be updated.
ar: تعذر تحديث طبقة التعليقات التوضيحية.

source: Annotation layer description columns
ar: أعمدة وصف طبقة التعليقات التوضيحية

source: Annotation layer has associated annotations.
ar: تحتوي طبقة التعليقات التوضيحية على تعليقات توضيحية مرتبطة.

source: Annotation layer interval end
ar: نهاية الفاصل الزمني لطبقة التعليقات التوضيحية

source: Annotation layer name
ar: اسم طبقة التعليقات التوضيحية

source: Annotation layer not found.
ar: لم يتم العثور على طبقة التعليقات التوضيحية.

source: Annotation layer opacity
ar: عتامة طبقة التعليق التوضيحي

source: Annotation layer parameters are invalid.
ar: معلمات طبقة التعليقات التوضيحية غير صالحة.

source: Annotation layer stroke
ar: حد طبقة التعليق التوضيحي

source: Annotation layer time column
ar: العمود الزمني لطبقة التعليقات التوضيحية

source: Annotation layer title column
ar: عمود عنوان طبقة التعليقات التوضيحية

source: Annotation layer type
ar: نوع طبقة التعليق التوضيحي

source: Annotation layer value
ar: قيمة طبقة التعليق التوضيحي

source: Annotation layers
ar: طبقات التعليقات التوضيحية

source: Annotation layers are still loading.
ar: لا تزال طبقات التعليقات التوضيحية قيد التحميل.

source: Annotation layers could not be deleted.
ar: تعذر حذف طبقات التعليقات التوضيحية.

source: Annotation not found.
ar: لم يتم العثور على التعليق التوضيحي.

source: Annotation parameters are invalid.
ar: معلمات التعليقات التوضيحية غير صالحة.

source: Annotation source
ar: مصدر التعليق التوضيحي

source: Annotation source type
ar: نوع مصدر التعليق التوضيحي

source: Annotation template created
ar: تم إنشاء قالب التعليق التوضيحي

source: Annotation template updated
ar: تم تحديث قالب التعليق التوضيحي

source: Annotations and Layers
ar: التعليقات التوضيحية والطبقات

source: Annotations and layers
ar: التعليقات التوضيحية والطبقات

source: Annotations could not be deleted.
ar: تعذر حذف التعليقات التوضيحية.

source: Any
ar: أي

source: Any additional detail to show in the certification tooltip.
ar: أي تفاصيل إضافية لعرضها في تلميح أداة الاعتماد.

source: Any color palette selected here will override the colors applied to this dashboard's individual charts
ar: ستتجاوز أي لوحة ألوان محددة هنا الألوان المطبقة على المخططات الفردية للوحة المعلومات هذه

source: Any databases that allow connections via SQL Alchemy URIs can be added.
ar: يمكن إضافة أي قواعد بيانات تسمح بالاتصالات عبر عناوين URI ل SQL Alchemy.

source: Any databases that allow connections via SQL Alchemy URIs can be added. Learn about how to connect a database driver
ar: يمكن إضافة أي قواعد بيانات تسمح بالاتصالات عبر عناوين URI ل SQL Alchemy. تعرف على كيفية توصيل برنامج تشغيل قاعدة بيانات

source: Append
ar: ألحق

source: Applied cross-filters (%d)
ar: المرشحات المتقاطعة المطبقة (%d)

source: Applied filters: %s
ar: المرشحات التطبيقية: %s

source: Applied filters (%d)
ar: المرشحات المطبقة (%d)

source: Applied rolling window did not return any data. Please make sure the source query satisfies the minimum periods defined in the rolling window.
ar: نافذة المتداول المطبقة لم ترجع أي بيانات. يرجى التأكد من أن الاستعلام المصدر يفي بالحد الأدنى من الفترات المحددة في النافذة المتداولة.

source: Apply
ar: طبق

source: Apply conditional color formatting to metric
ar: تطبيق تنسيق الألوان الشرطي على القياس

source: Apply conditional color formatting to metrics
ar: تطبيق تنسيق الألوان الشرطي على المقاييس

source: Apply conditional color formatting to numeric columns
ar: تطبيق تنسيق الألوان الشرطي على الأعمدة الرقمية

source: Apply filters
ar: تطبيق الفلاتر

source: Apply metrics on
ar: تطبيق المقاييس على

source: Apply to all panels
ar: تنطبق على جميع اللوحات

source: Apply to specific panels
ar: تنطبق على لوحات محددة

source: April
ar: أبريل

source: Arc
ar: قوس

source: Are you sure you intend to overwrite the following values?
ar: هل أنت متأكد من أنك تنوي الكتابة فوق القيم التالية؟

source: Are you sure you want to cancel?
ar: هل أنت متأكد من أنك تريد الإلغاء؟

source: Are you sure you want to delete
ar: هل أنت متأكد من أنك تريد الحذف

source: Are you sure you want to delete %s?
ar: هل أنت متأكد من أنك تريد حذف %s؟

source: Are you sure you want to delete the selected %s?
ar: هل أنت متأكد من أنك تريد حذف معرف %s؟

source: Are you sure you want to delete the selected annotations?
ar: هل أنت متأكد من أنك تريد حذف التعليقات التوضيحية المحددة؟

source: Are you sure you want to delete the selected charts?
ar: هل أنت متأكد من أنك تريد حذف المخططات المحددة؟

source: Are you sure you want to delete the selected dashboards?
ar: هل أنت متأكد من أنك تريد حذف لوحات المعلومات المحددة؟

source: Are you sure you want to delete the selected datasets?
ar: هل أنت متأكد من أنك تريد حذف مجموعات البيانات المحددة؟

source: Are you sure you want to delete the selected layers?
ar: هل أنت متأكد من أنك تريد حذف الطبقات المحددة؟

source: Are you sure you want to delete the selected queries?
ar: هل أنت متأكد من رغبتك في حذف الاستعلامات المحددة؟

source: Are you sure you want to delete the selected rules?
ar: هل أنت متأكد من أنك تريد حذف القواعد المحددة؟

source: Are you sure you want to delete the selected tags?
ar: هل أنت متأكد من أنك تريد حذف العلامات المحددة؟

source: Are you sure you want to delete the selected templates?
ar: هل أنت متأكد من أنك تريد حذف القوالب المحددة؟

source: Are you sure you want to overwrite this dataset?
ar: هل أنت متأكد من أنك تريد الكتابة فوق مجموعة البيانات هذه؟

source: Are you sure you want to proceed?
ar: هل أنت متأكد من أنك تريد المتابعة؟

source: Are you sure you want to save and apply changes?
ar: هل أنت متأكد من أنك تريد حفظ التغييرات وتطبيقها؟

source: Area Chart
ar: مخطط مساحي

source: Area Chart (legacy)
ar: مخطط مساحي (قديم)

source: Area chart
ar: مخطط مساحي

source: Area chart opacity
ar: عتامة المخطط المساحي

source: Area charts are similar to line charts in that they represent variables with the same scale, but area charts stack the metrics on top of each other.
ar: تتشابه المخططات المساحية مع المخططات الخطية من حيث أنها تمثل متغيرات بنفس المقياس ، لكن المخططات المساحية تكدس المقاييس فوق بعضها البعض.

source: Arrow
ar: سهم

source: Assign a set of parameters as
ar: تعيين مجموعة من المعلمات ك

source: Assist
ar: ساعد

source: Associated Charts
ar: الرسوم البيانية المرتبطة

source: Async Execution
ar: التنفيذ غير المتزامن

source: Asynchronous query execution
ar: تنفيذ استعلام غير متزامن

source: August
ar: أغسطس

source: Auto
ar: تلقائي

source: Auto Zoom
ar: التكبير التلقائي

source: Autocomplete
ar: الإكمال التلقائي

source: Autocomplete filters
ar: فلاتر الإكمال التلقائي

source: Autocomplete query predicate
ar: استعلام الإكمال التلقائي المسند

source: Automatic Color
ar: اللون التلقائي

source: Available sorting modes:
ar: أوضاع الفرز المتاحة:

source: Average
ar: متوسط

source: Average value
ar: متوسط القيمة

source: Axis
ar: محور

source: Axis Bounds
ar: حدود المحور

source: Axis Format
ar: تنسيق المحور

source: Axis Title
ar: عنوان المحور

source: Axis ascending
ar: محور تصاعدي

source: Axis descending
ar: محور تنازلي

source: BOOLEAN
ar: منطقيه

source: Back
ar: ظهر

source: Back to all
ar: العودة إلى الكل

source: Backend
ar: الواجهة الخلفية

source: Backward values
ar: القيم العكسية

source: Bad formula.
ar: صيغة سيئة.

source: Bad spatial key
ar: مفتاح مكاني سيئ

source: Bar
ar: بار

source: Bar Chart
ar: مخطط شريطي

source: Bar Chart (legacy)
ar: مخطط شريطي (قديم)

source: Bar Charts are used to show metrics as a series of bars.
ar: تستخدم المخططات الشريطية لإظهار المقاييس كسلسلة من الأشرطة.

source: Bar Values
ar: القيم الشريطية

source: Bar orientation
ar: اتجاه الشريط

source: Base
ar: قاعدة

source: Base layer map style. See Mapbox documentation: %s
ar: نمط خريطة الطبقة الأساسية. راجع وثائق Mapbox: %s

source: Based on a metric
ar: استنادا إلى مقياس

source: Based on granularity, number of time periods to compare against
ar: استنادا إلى الدقة ، عدد الفترات الزمنية للمقارنة بها

source: Based on what should series be ordered on the chart and legend
ar: بناء على ما يجب ترتيب السلسلة على الرسم البياني والأسطورة

source: Basic
ar: أساسي

source: Basic information
ar: المعلومات الأساسية

source: Batch editing %d filters:
ar: مرشحات تحرير الدفعات %d:

source: Battery level over time
ar: مستوى البطارية بمرور الوقت

source: Be careful.
ar: انتبه.

source: Before
ar: قبل

source: Big Number
ar: عدد كبير

source: Big Number Font Size
ar: حجم خط الرقم الكبير

source: Big Number with Time Period Comparison
ar: رقم كبير مع مقارنة الفترة الزمنية

source: Big Number with Trendline
ar: رقم كبير مع خط الاتجاه

source: Bottom
ar: قاع

source: Bottom Margin
ar: الهامش السفلي

source: Bottom left
ar: أسفل اليسار

source: Bottom margin, in pixels, allowing for more room for axis labels
ar: الهامش السفلي، بالبكسل، مما يسمح بمساحة أكبر لتسميات المحاور

source: Bottom right
ar: أسفل اليمين

source: Bottom to Top
ar: من الأسفل إلى الأعلى

source: Bounds for numerical X axis. Not applicable for temporal or categorical axes. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
ar: حدود المحور X العددي. لا ينطبق على المحاور الزمنية أو الفئوية. عند تركها فارغة ، يتم تحديد الحدود ديناميكيا بناء على الحد الأدنى / الأقصى للبيانات. لاحظ أن هذه الميزة ستوسع نطاق المحور فقط. لن يضيق نطاق البيانات.

source: Bounds for the Y-axis. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
ar: حدود المحور الصادي. عند تركها فارغة ، يتم تحديد الحدود ديناميكيا بناء على الحد الأدنى / الأقصى للبيانات. لاحظ أن هذه الميزة ستوسع نطاق المحور فقط. لن يضيق نطاق البيانات.

source: Bounds for the axis. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
ar: حدود المحور. عند تركها فارغة ، يتم تحديد الحدود ديناميكيا بناء على الحد الأدنى / الأقصى للبيانات. لاحظ أن هذه الميزة ستوسع نطاق المحور فقط. لن يضيق نطاق البيانات.

source: Bounds for the primary Y-axis. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
ar: حدود المحور الصادي الأساسي. عند تركها فارغة ، يتم تحديد الحدود ديناميكيا بناء على الحد الأدنى / الأقصى للبيانات. لاحظ أن هذه الميزة ستوسع نطاق المحور فقط. لن يضيق نطاق البيانات.

source: Bounds for the secondary Y-axis. Only works when Independent Y-axis bounds are enabled. When left empty, the bounds are dynamically defined based on the min/max of the data. Note that this feature will only expand the axis range. It won't narrow the data's extent.
ar: حدود المحور الصادي الثانوي. يعمل فقط عندما يكون المحور Y المستقل يتم تمكين الحدود. عند تركها فارغة ، يتم تحديد الحدود ديناميكيا بناء على الحد الأدنى / الحد الأقصى للبيانات. لاحظ أن هذه الميزة ستتوسع فقط نطاق المحور. لن يضيق نطاق البيانات.

source: Box Plot
ar: مؤامرة مربع

source: Breakdowns
ar: اعطال

source: Breaks down the series by the category specified in this control. This can help viewers understand how each category affects the overall value.
ar: يقسم السلسلة حسب الفئة المحددة في عنصر التحكم هذا. ويمكن أن يساعد ذلك المشاهدين على فهم كيفية تأثير كل فئة في القيمة الإجمالية.

source: Bubble Chart
ar: مخطط فقاعي

source: Bubble Chart (legacy)
ar: مخطط فقاعي (قديم)

source: Bubble Color
ar: لون الفقاعة

source: Bubble Opacity
ar: عتامة الفقاعة

source: Bubble Size
ar: حجم الفقاعة

source: Bubble size
ar: حجم الفقاعة

source: Bubble size number format
ar: تنسيق رقم حجم الفقاعة

source: Bucket break points
ar: نقاط كسر الجرافة

source: Build
ar: بنى

source: Bulk select
ar: تحديد مجمع

source: Bulk tag
ar: علامة مجمعة

source: Bullet Chart
ar: مخطط نقطي

source: Business
ar: مهنة

source: Business Data Type
ar: نوع بيانات العمل

source: By default, each filter loads at most 1000 choices at the initial page load. Check this box if you have more than 1000 filter values and want to enable dynamically searching that loads filter values as users type (may add stress to your database).
ar: بشكل افتراضي ، يتم تحميل كل مرشح على الأكثر 1000 خيار عند تحميل الصفحة الأولي. حدد هذا المربع إذا كان لديك أكثر من 1000 قيمة تصفية وتريد تمكين البحث الديناميكي الذي يقوم بتحميل قيم التصفية أثناء كتابة المستخدمين (قد يضيف ضغطا على قاعدة البيانات الخاصة بك).

source: By key: use column names as sorting key
ar: حسب المفتاح: استخدم أسماء الأعمدة كمفتاح فرز

source: By key: use row names as sorting key
ar: حسب المفتاح: استخدم أسماء الصفوف كمفتاح فرز

source: By value: use metric values as sorting key
ar: حسب القيمة: استخدام قيم المقاييس كمفتاح فرز

source: CANCEL
ar: إلغاء الأمر

source: CREATE DATASET
ar: إنشاء مجموعة بيانات

source: CREATE TABLE AS
ar: إنشاء جدول ك

source: CREATE VIEW AS
ar: إنشاء طريقة عرض ك

source: CREATE VIEW statement
ar: إنشاء بيان طريقة عرض

source: CRON Schedule
ar: جدول كرون

source: CRON expression
ar: تعبير كرون

source: CSS
ar: المغلق

source: CSS Styles
ar: أنماط CSS

source: CSS Templates
ar: قوالب CSS

source: CSS applied to the chart
ar: CSS المطبقة على الرسم البياني

source: CSS template
ar: قالب CSS

source: CSS template not found.
ar: لم يتم العثور على قالب CSS.

source: CSS templates
ar: قوالب CSS

source: CSS templates could not be deleted.
ar: تعذر حذف قوالب CSS.

source: CSV Upload
ar: تحميل CSV

source: CSV file "%(csv_filename)s" uploaded to table "%(table_name)s" in database "%(db_name)s"
ar: ملف CSV "%(csv_filename)s" تم تحميله إلى الجدول "%(table_name)s" في قاعدة البيانات "%(db_name)s"

source: CSV to Database configuration
ar: CSV لتكوين قاعدة البيانات

source: CSV upload
ar: تحميل CSV

source: CTAS & CVAS SCHEMA
ar: CTAS ومخطط CVAS

source: CTAS Schema
ar: مخطط CTAS

source: CTAS (create table as select) can only be run with a query where the last statement is a SELECT. Please make sure your query has a SELECT as its last statement. Then, try running your query again.
ar: لا يمكن تشغيل CTAS (إنشاء جدول كتحديد) إلا باستخدام استعلام حيث تكون العبارة الأخيرة عبارة عن SELECT. يرجى التأكد من أن استفسارك يحتوي على SELECT كبيان أخير له. ثم حاول تشغيل الاستعلام مرة أخرى.

source: CVAS (create view as select) can only be run with a query with a single SELECT statement. Please make sure your query has only a SELECT statement. Then, try running your query again.
ar: لا يمكن تشغيل CVAS (إنشاء طريقة عرض كتحديد) إلا باستخدام استعلام يحتوي على عبارة SELECT واحدة. يرجى التأكد من أن استفسارك يحتوي على عبارة SELECT فقط. ثم حاول تشغيل الاستعلام مرة أخرى.

source: CVAS (create view as select) query has more than one statement.
ar: يحتوي استعلام CVAS (إنشاء طريقة عرض كتحديد) على أكثر من عبارة واحدة.

source: CVAS (create view as select) query is not a SELECT statement.
ar: استعلام CVAS (إنشاء طريقة عرض كتحديد) ليس عبارة SELECT.

source: Cache Timeout
ar: انقطاع ذاكرة التخزين المؤقت

source: Cache Timeout (seconds)
ar: مهلة ذاكرة التخزين المؤقت (بالثواني)

source: Cache timeout
ar: مهلة ذاكرة التخزين المؤقت

source: Cached
ar: المخزنه مؤقتا

source: Cached %s
ar: التخزين المؤقت %s

source: Cached value not found
ar: لم يتم العثور على القيمة المخزنة مؤقتا

source: Calculate contribution per series or row
ar: حساب المساهمة لكل سلسلة أو صف

source: Calculate from first step
ar: احسب من الخطوة الأولى

source: Calculate from previous step
ar: احسب من الخطوة السابقة

source: Calculated column [%s] requires an expression
ar: يتطلب العمود المحسوب [%s] تعبيرا

source: Calculated columns
ar: الأعمدة المحسوبة

source: Calculation type
ar: نوع الحساب

source: Calendar Heatmap
ar: خريطة التمثيل اللوني للتقويم

source: Can't have overlap between Series and Breakdowns
ar: لا يمكن أن يكون هناك تداخل بين السلسلة والأعطال

source: Can not move top level tab into nested tabs
ar: لا يمكن نقل علامة تبويب المستوى الأعلى إلى علامات تبويب متداخلة

source: Can select multiple values
ar: يمكن تحديد قيم متعددة

source: Cancel
ar: إلغاء الأمر

source: Cancel query on window unload event
ar: إلغاء الاستعلام في حدث إلغاء تحميل النافذة

source: Cannot access the query
ar: لا يمكن الوصول إلى الاستعلام

source: Cannot delete a database that has datasets attached
ar: لا يمكن حذف قاعدة بيانات تحتوي على مجموعات بيانات مرفقة

source: Cannot have multiple credentials for the SSH Tunnel
ar: لا يمكن أن يكون لديك بيانات اعتماد متعددة لنفق SSH

source: Cannot load filter
ar: لا يمكن تحميل عامل التصفية

source: Cannot parse time string [%(human_readable)s]
ar: لا يمكن تحليل السلسلة الزمنية [%(human_readable)s]

source: Categorical
ar: بات

source: Categorical Color
ar: اللون القاطع

source: Categories to group by on the x-axis.
ar: الفئات المراد تجميعها على المحور السيني.

source: Category
ar: باب

source: Category, Value and Percentage
ar: الفئة والقيمة والنسبة المئوية

source: Category Name
ar: اسم الفئة

source: Category and Percentage
ar: الفئة والنسبة المئوية

source: Category and Value
ar: الفئة والقيمة

source: Category name
ar: اسم الفئة

source: Category of target nodes
ar: فئة العقد الهدف

source: Cell Padding
ar: حشوة الخلية

source: Cell Radius
ar: نصف قطر الخلية

source: Cell Size
ar: حجم الخلية

source: Cell bars
ar: أشرطة الخلايا

source: Cell content
ar: محتوى الخلية

source: Cell limit
ar: حد الخلية

source: Centroid (Longitude and Latitude):
ar: النقطه الوسطى (خطوط الطول والعرض):

source: Certification
ar: شهاده

source: Certification details
ar: تفاصيل الشهادة

source: Certified
ar: معتمد

source: Certified By
ar: معتمد من قبل

source: Certified by
ar: معتمد من قبل

source: Certified by %s
ar: معتمد من قبل %s

source: Change order of columns.
ar: تغيير ترتيب الأعمدة.

source: Change order of rows.
ar: تغيير ترتيب الصفوف.

source: Changed By
ar: تم التغيير بواسطة

source: Changed by
ar: تم التغيير بواسطة

source: Changes saved.
ar: التغييرات المحفوظة.

source: Changing one or more of these dashboards is forbidden
ar: يحظر تغيير واحدة أو أكثر من لوحات المعلومات هذه

source: Changing the dataset may break the chart if the chart relies on columns or metadata that does not exist in the target dataset
ar: قد يؤدي تغيير مجموعة البيانات إلى كسر المخطط إذا كان المخطط يعتمد على أعمدة أو بيانات تعريف غير موجودة في مجموعة البيانات الهدف

source: Changing these settings will affect all charts using this dataset, including charts owned by other people.
ar: سيؤثر تغيير هذه الإعدادات على جميع المخططات التي تستخدم مجموعة البيانات هذه، بما في ذلك المخططات التي يملكها أشخاص آخرون.

source: Changing this Dashboard is forbidden
ar: يحظر تغيير لوحة التحكم هذه

source: Changing this chart is forbidden
ar: تغيير هذا المخطط ممنوع

source: Changing this control takes effect instantly
ar: يسري تغيير عنصر التحكم هذا على الفور

source: Changing this dataset is forbidden
ar: يحظر تغيير مجموعة البيانات هذه

source: Changing this dataset is forbidden.
ar: يحظر تغيير مجموعة البيانات هذه.

source: Changing this datasource is forbidden
ar: يحظر تغيير مصدر البيانات هذا

source: Changing this report is forbidden
ar: تغيير هذا التقرير ممنوع

source: Character to interpret as decimal point
ar: حرف لتفسيره كعلامة عشرية

source: Character to interpret as decimal point.
ar: حرف لتفسيره كعلامة عشرية.

source: Chart
ar: جدول

source: Chart %(id)s not found
ar: لم يتم العثور على الرسم البياني %(id)s

source: Chart Cache Timeout
ar: مهلة ذاكرة التخزين المؤقت للمخطط

source: Chart Data: %s
ar: بيانات الرسم البياني: %s

source: Chart ID
ar: معرف الرسم البياني

source: Chart Options
ar: خيارات الرسم البياني

source: Chart Orientation
ar: اتجاه الرسم البياني

source: Chart Source
ar: مصدر الرسم البياني

source: Chart Title
ar: عنوان الرسم البياني

source: Chart [%s] has been overwritten
ar: تمت الكتابة فوق المخطط [%s]

source: Chart [%s] has been saved
ar: تم حفظ المخطط [%s]

source: Chart [%s] was added to dashboard [%s]
ar: تمت إضافة المخطط [%s] إلى لوحة المعلومات [%s]

source: Chart [{}] has been overwritten
ar: تمت الكتابة فوق المخطط [{}]

source: Chart [{}] has been saved
ar: تم حفظ الرسم البياني [{}]

source: Chart [{}] was added to dashboard [{}]
ar: الرسم البياني [{}] was added to dashboard [{}]

source: Chart cache timeout
ar: مهلة ذاكرة التخزين المؤقت للمخطط

source: Chart changes
ar: تغييرات المخطط

source: Chart could not be created.
ar: تعذر إنشاء مخطط.

source: Chart could not be updated.
ar: تعذر تحديث المخطط.

source: Chart does not exist
ar: الرسم البياني غير موجود

source: Chart has no query context saved. Please save the chart again.
ar: لا يحتوي المخطط على سياق استعلام محفوظ. يرجى حفظ الرسم البياني مرة أخرى.

source: Chart height
ar: ارتفاع الرسم البياني

source: Chart imported
ar: تم استيراد الرسم البياني

source: Chart last modified
ar: آخر تعديل للمخطط

source: Chart last modified by
ar: آخر تعديل للمخطط بواسطة

source: Chart name
ar: اسم المخطط
