Repository: rajpal-1/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: The classic. Great for showing how much of a company each investor gets, what demographics follow your blog, or what portion of the budget goes to the military industrial complex. Pie charts can be difficult to interpret precisely. If clarity of relative proportion is important, consider using a bar or other chart type instead.
ar: الكلاسيكية. رائع لإظهار مقدار الشركة التي يحصل عليها كل مستثمر، أو التركيبة السكانية التي تتبع مدونتك، أو أي جزء من الميزانية يذهب إلى المجمع الصناعي العسكري. قد يكون من الصعب تفسير المخططات الدائرية بدقة. إذا كان وضوح النسبة النسبية مهمًا، ففكر في استخدام شريط أو نوع مخطط آخر بدلاً من ذلك.

source: The color for points and clusters in RGB
ar: لون النقاط والمجموعات في RGB

source: The color of the isoband
ar: لون الإيزوبوند

source: The color of the isoline
ar: لون الإيزولين

source: The color scheme for rendering chart
ar: نظام الألوان لعرض المخطط

source: The color scheme is determined by the related dashboard. Edit the color scheme in the dashboard properties.
ar: يتم تحديد نظام الألوان من خلال لوحة المعلومات ذات الصلة. قم بتحرير نظام الألوان في خصائص لوحة المعلومات.

source: The column header label
ar: تسمية رأس العمود

source: The column was deleted or renamed in the database.
ar: تم حذف العمود أو إعادة تسميته في قاعدة البيانات.

source: The country code standard that Superset should expect to find in the [country] column
ar: معيار رمز البلد الذي يجب أن تتوقع Superset العثور عليه في عمود [البلد]

source: The dashboard has been saved
ar: تم حفظ لوحة التحكم

source: The data source seems to have been deleted
ar: يبدو أن مصدر البيانات قد تم حذفه

source: The data type that was inferred by the database. It may be necessary to input a type manually for expression-defined columns in some cases. In most case users should not need to alter this.
ar: نوع البيانات الذي تم استنتاجه بواسطة قاعدة البيانات. قد يكون من الضروري إدخال نوع يدويًا للأعمدة المحددة بالتعبير في بعض الحالات. في معظم الحالات، يجب ألا يحتاج المستخدمون إلى تغيير هذا.

source: The database %s is linked to %s charts that appear on %s dashboards and users have %s SQL Lab tabs using this database open. Are you sure you want to continue? Deleting the database will break those objects.
ar: ترتبط قاعدة البيانات %s بالمخططات التي تظهر على %s لوحات المعلومات %s ويكون لدى المستخدمين علامات تبويب %s SQL Lab باستخدام قاعدة البيانات هذه مفتوحة. هل أنت متأكد أنك تريد المتابعة؟ سيؤدي حذف قاعدة البيانات إلى كسر هذه الكائنات.

source: The database columns that contains lines information
ar: أعمدة قاعدة البيانات التي تحتوي على معلومات الأسطر

source: The database could not be found
ar: لا يمكن العثور على قاعدة البيانات

source: The database is currently running too many queries.
ar: تقوم قاعدة البيانات حاليًا بتشغيل عدد كبير جدًا من الاستعلامات.

source: The database is under an unusual load.
ar: قاعدة البيانات تحت حمولة غير عادية.

source: The database referenced in this query was not found. Please contact an administrator for further assistance or try again.
ar: لم يتم العثور على قاعدة البيانات المشار إليها في هذا الاستعلام. يرجى الاتصال بالمسؤول للحصول على مزيد من المساعدة أو المحاولة مرة أخرى.

source: The database returned an unexpected error.
ar: قامت قاعدة البيانات بإرجاع خطأ غير متوقع.

source: The database was deleted.
ar: تم حذف قاعدة البيانات.

source: The database was not found.
ar: لم يتم العثور على قاعدة البيانات.

source: The dataset %s is linked to %s charts that appear on %s dashboards. Are you sure you want to continue? Deleting the dataset will break those objects.
ar: ترتبط مجموعة البيانات %s بالمخططات %s التي تظهر على لوحات معلومات %s. هل أنت متأكد أنك تريد المتابعة؟ سيؤدي حذف مجموعة البيانات إلى كسر هذه الكائنات.

source: The dataset associated with this chart no longer exists
ar: لم تعد مجموعة البيانات المرتبطة بهذا المخطط موجودة

source: The dataset column/metric that returns the values on your chart's x-axis.
ar: عمود/مقياس مجموعة البيانات الذي يعرض القيم على المحور السيني للمخطط.

source: The dataset column/metric that returns the values on your chart's y-axis.
ar: عمود/مقياس مجموعة البيانات الذي يعرض القيم على المحور y للمخطط.

source: The dataset configuration exposed here affects all the charts using this dataset. Be mindful that changing settings here may affect other charts in undesirable ways.
ar: تم عرض تكوين مجموعة البيانات هنا يؤثر على جميع المخططات التي تستخدم مجموعة البيانات هذه. ضع في اعتبارك أن تغيير الإعدادات هنا قد تؤثر على الرسوم البيانية الأخرى بطرق غير مرغوب فيها.

source: The dataset has been saved
ar: تم حفظ مجموعة البيانات

source: The dataset linked to this chart may have been deleted.
ar: ربما تم حذف مجموعة البيانات المرتبطة بهذا المخطط.

source: The datasource couldn't be loaded
ar: تعذر تحميل مصدر البيانات

source: The datasource is too large to query.
ar: مصدر البيانات كبير جدًا بحيث لا يمكن الاستعلام عنه.

source: The description can be displayed as widget headers in the dashboard view. Supports markdown.
ar: يمكن عرض الوصف كرؤوس عناصر واجهة مستخدم في عرض لوحة المعلومات. يدعم تخفيض السعر.

source: The distance between cells, in pixels
ar: المسافة بين الخلايا، بالبكسل

source: The duration of time in seconds before the cache is invalidated. Set to -1 to bypass the cache.
ar: تم إبطال المدة الزمنية بالثواني قبل ذاكرة التخزين المؤقت. اضبط على -1 لتجاوز ذاكرة التخزين المؤقت.

source: The encoding format of the lines
ar: تنسيق ترميز الخطوط

source: The engine_params object gets unpacked into the sqlalchemy.create_engine call.
ar: يتم تفكيك كائن engine_params في استدعاء sqlalchemy.create_engine.

source: The following entries in `series_columns` are missing in `columns`: %(columns)s.
ar: الإدخالات التالية في `series_columns` مفقودة في «الأعمدة»:. %(columns)s

source: The function to use when aggregating points into groups
ar: الوظيفة التي يجب استخدامها عند تجميع النقاط في مجموعات

source: The host "%(hostname)s" might be down, and can't be reached on port %(port)s.
ar: قد يكون المضيف %(hostname)s "" معطلاً، ولا يمكن الوصول إليه على المنفذ%(port)s.

source: The host "%(hostname)s" might be down and can't be reached.
ar: قد يكون المضيف %(hostname)s "" معطلاً ولا يمكن الوصول إليه.

source: The host might be down, and can't be reached on the provided port.
ar: قد يكون المضيف معطلاً، ولا يمكن الوصول إليه على المنفذ المتوفر.

source: The hostname "%(hostname)s" cannot be resolved.
ar: لا يمكن حل اسم المضيف %(hostname)s "».

source: The hostname provided can't be resolved.
ar: لا يمكن حل اسم المضيف المقدم.

source: The id of the active chart
ar: معرف المخطط النشط

source: The list of charts associated with this table. By altering this datasource, you may change how these associated charts behave. Also note that charts need to point to a datasource, so this form will fail at saving if removing charts from a datasource. If you want to change the datasource for a chart, overwrite the chart from the 'explore view'
ar: قائمة المخططات المرتبطة بهذا الجدول. من خلال تغيير مصدر البيانات هذا، يمكنك تغيير طريقة عمل هذه المخططات المرتبطة. لاحظ أيضًا أن المخططات تحتاج إلى الإشارة إلى مصدر بيانات، لذلك سيفشل هذا النموذج في الحفظ في حالة إزالة المخططات من مصدر البيانات. إذا كنت تريد تغيير مصدر البيانات للمخطط، فاستبدل المخطط من «عرض الاستكشاف»

source: The lower limit of the threshold range of the Isoband
ar: الحد الأدنى لنطاق عتبة Isoband

source: The maximum number of events to return, equivalent to the number of rows
ar: الحد الأقصى لعدد الأحداث المراد إرجاعها، أي ما يعادل عدد الصفوف

source: The maximum number of subdivisions of each group; lower values are pruned first
ar: الحد الأقصى لعدد التقسيمات الفرعية لكل مجموعة؛ يتم تقليم القيم الأقل أولاً

source: The maximum value of metrics. It is an optional configuration
ar: الحد الأقصى لقيمة المقاييس. إنه تكوين اختياري

source: The metadata_params in Extra field is not configured correctly. The key %(key)s is invalid.
ar: لم يتم تكوين metadata_params في الحقل الإضافي بشكل صحيح. المفتاح %(key)s غير صالح.

source: The metadata_params in Extra field is not configured correctly. The key %{key}s is invalid.
ar: لم يتم تكوين metadata_params في الحقل الإضافي بشكل صحيح. المفتاح %{key} s غير صالح.

source: The metadata_params object gets unpacked into the sqlalchemy.MetaData call.
ar: يتم فك ضغط كائن metadata_params في استدعاء SqlalChemy.Metadata.

source: The minimum number of rolling periods required to show a value. For instance if you do a cumulative sum on 7 days you may want your "Min Period" to be 7, so that all data points shown are the total of 7 periods. This will hide the "ramp up" taking place over the first 7 periods
ar: الحد الأدنى لعدد فترات التدوير المطلوبة لإظهار القيمة. على سبيل المثال، إذا قمت بعمل مبلغ تراكمي في 7 أيام، فقد ترغب في أن تكون «الفترة الدنيا» 7، بحيث تكون جميع نقاط البيانات المعروضة هي إجمالي 7 فترات. سيؤدي هذا إلى إخفاء «الزيادة» التي تحدث خلال الفترات السبع الأولى

source: The name of the rule must be unique
ar: يجب أن يكون اسم القاعدة فريدًا

source: The number color "steps"
ar: لون الرقم «الخطوات»

source: The number of hours, negative or positive, to shift the time column. This can be used to move UTC time to local time.
ar: عدد الساعات، السلبية أو الإيجابية، لتغيير عمود الوقت. يمكن استخدام هذا لنقل توقيت UTC إلى التوقيت المحلي.

source: The number of results displayed is limited to %(rows)d. Please add additional limits/filters, download to csv, or contact an admin to see more rows up to the %(limit)d limit.
ar: يقتصر عدد النتائج المعروضة على%(rows)d. يرجى إضافة حدود/فلاتر إضافية أو التنزيل إلى csv أو الاتصال بالمسؤول لرؤية المزيد من الصفوف حتى الحد %(limit)d الأقصى.

source: The number of results displayed is limited to %(rows)d by the configuration DISPLAY_MAX_ROW. Please add additional limits/filters or download to csv to see more rows up to the %(limit)d limit.
ar: يقتصر عدد النتائج المعروضة على %(rows)d في إعداد DISPLAY_MAX_ROW. يرجى إضافة حدود/فلاتر إضافية أو التنزيل إلى csv لرؤية المزيد من الصفوف حتى الحد %(limit)d الأقصى.

source: The number of rows displayed is limited to %(rows)d by the dropdown.
ar: يقتصر عدد الصفوف المعروضة على %(rows)d القائمة المنسدلة.

source: The number of rows displayed is limited to %(rows)d by the limit dropdown.
ar: يقتصر عدد الصفوف المعروضة على %(rows)d قائمة الحد المنسدلة.

source: The number of rows displayed is limited to %(rows)d by the query
ar: يقتصر الاستعلام على %(rows)d عدد الصفوف المعروضة

source: The number of rows displayed is limited to %(rows)d by the query and limit dropdown.
ar: يقتصر عدد الصفوف المعروضة على %(rows)d قائمة الاستعلام والحد المنسدلة.

source: The number of seconds before expiring the cache
ar: عدد الثواني قبل انتهاء صلاحية ذاكرة التخزين المؤقت

source: The object does not exist in the given database.
ar: الكائن غير موجود في قاعدة البيانات المحددة.

source: The password provided for username "%(username)s" is incorrect.
ar: كلمة المرور المقدمة لاسم المستخدم "%(username)s" غير صحيحة.

source: The password provided when connecting to a database is not valid.
ar: كلمة المرور المقدمة عند الاتصال بقاعدة بيانات غير صالحة.

source: The passwords for the databases below are needed in order to import them. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in explore files and should be added manually after the import if they are needed.
ar: كلمات المرور لقواعد البيانات أدناه مطلوبة لاستيرادها. يرجى ملاحظة أن أقسام «Secure Extra» و «الشهادة» من تكوين قاعدة البيانات غير موجودة في ملفات الاستكشاف ويجب إضافتها يدويًا بعد الاستيراد إذا لزم الأمر.

source: The passwords for the databases below are needed in order to import them together with the charts. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
ar: كلمات المرور لقواعد البيانات أدناه مطلوبة لاستيرادها مع المخططات. يرجى ملاحظة أن أقسام «Secure Extra» و «الشهادة» من تكوين قاعدة البيانات غير موجودة في ملفات التصدير، ويجب إضافتها يدويًا بعد الاستيراد إذا لزم الأمر.

source: The passwords for the databases below are needed in order to import them together with the dashboards. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
ar: كلمات المرور لقواعد البيانات أدناه مطلوبة لاستيرادها مع لوحات المعلومات. يرجى ملاحظة أن أقسام «Secure Extra» و «الشهادة» من تكوين قاعدة البيانات غير موجودة في ملفات التصدير، ويجب إضافتها يدويًا بعد الاستيراد إذا لزم الأمر.

source: The passwords for the databases below are needed in order to import them together with the datasets. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
ar: كلمات المرور لقواعد البيانات أدناه مطلوبة لاستيرادها مع مجموعات البيانات. يرجى ملاحظة أن أقسام «Secure Extra» و «الشهادة» من تكوين قاعدة البيانات غير موجودة في ملفات التصدير، ويجب إضافتها يدويًا بعد الاستيراد إذا لزم الأمر.

source: The passwords for the databases below are needed in order to import them together with the saved queries. Please note that the "Secure Extra" and "Certificate" sections of the database configuration are not present in export files, and should be added manually after the import if they are needed.
ar: كلمات المرور لقواعد البيانات أدناه مطلوبة لاستيرادها مع الاستعلامات المحفوظة. يرجى ملاحظة أن أقسام «Secure Extra» و «الشهادة» من تكوين قاعدة البيانات غير موجودة في ملفات التصدير، ويجب إضافتها يدويًا بعد الاستيراد إذا لزم الأمر.

source: The pattern of timestamp format. For strings use
ar: نمط تنسيق الطابع الزمني. لاستخدام السلاسل

source: The periodicity over which to pivot time. Users can provide "Pandas" offset alias. Click on the info bubble for more details on accepted "freq" expressions.
ar: الدورية التي يتم خلالها توجيه الوقت. يمكن للمستخدمين تقديم الاسم المستعار لأوفست «الباندا». انقر فوق فقاعة المعلومات لمزيد من التفاصيل حول تعبيرات «freq» المقبولة.

source: The pixel radius
ar: نصف قطر البكسل

source: The pointer to a physical table (or view). Keep in mind that the chart is associated to this Superset logical table, and this logical table points the physical table referenced here.
ar: المؤشر إلى جدول فعلي (أو عرض). ضع في اعتبارك أن المخطط مرتبط بهذا الجدول المنطقي الفائق، ويشير هذا الجدول المنطقي إلى الجدول المادي المشار إليه هنا.

source: The port is closed.
ar: المنفذ مغلق.

source: The port number is invalid.
ar: رقم المنفذ غير صالح.

source: The primary metric is used to define the arc segment sizes
ar: يتم استخدام المقياس الأساسي لتحديد أحجام مقاطع القوس

source: The provided table was not found in the provided database
ar: لم يتم العثور على الجدول المقدم في قاعدة البيانات المقدمة

source: The query associated with the results was deleted.
ar: تم حذف الاستعلام المرتبط بالنتائج.

source: The query associated with these results could not be found. You need to re-run the original query.
ar: لا يمكن العثور على الاستعلام المرتبط بهذه النتائج. تحتاج إلى إعادة تشغيل الاستعلام الأصلي.

source: The query contains one or more malformed template parameters.
ar: يحتوي الاستعلام على واحدة أو أكثر من معاملات القالب غير الصحيحة.

source: The query couldn't be loaded
ar: لا يمكن تحميل الاستعلام

source: The query estimation was killed after %(sqllab_timeout)s seconds. It might be too complex, or the database might be under heavy load.
ar: تم إيقاف تقدير الاستعلام بعد %(sqllab_timeout)s ثوانٍ. قد يكون الأمر معقدًا جدًا، أو قد تكون قاعدة البيانات تحت عبء ثقيل.

source: The query has a syntax error.
ar: يحتوي الاستعلام على خطأ في بناء الجملة.

source: The query returned no data
ar: لم يعرض الاستعلام أي بيانات

source: The query was killed after %(sqllab_timeout)s seconds. It might be too complex, or the database might be under heavy load.
ar: تم إيقاف الاستعلام بعد %(sqllab_timeout)s ثوانٍ. قد يكون الأمر معقدًا جدًا، أو قد تكون قاعدة البيانات تحت عبء ثقيل.

source: The radius (in pixels) the algorithm uses to define a cluster. Choose 0 to turn off clustering, but beware that a large number of points (>1000) will cause lag.
ar: نصف القطر (بالبكسل) الذي تستخدمه الخوارزمية لتعريف الكتلة. اختر 0 لإيقاف التجميع، ولكن احذر من أن عددًا كبيرًا من النقاط (> 1000) سيؤدي إلى التأخير.

source: The radius of individual points (ones that are not in a cluster). Either a numerical column or `Auto`, which scales the point based on the largest cluster
ar: نصف قطر النقاط الفردية (تلك التي ليست في الكتلة). إما عمود رقمي أو «تلقائي»، والذي يقيس النقطة بناءً على أكبر مجموعة

source: The report has been created
ar: تم إنشاء التقرير

source: The result of this query should be a numeric-esque value
ar: يجب أن تكون نتيجة هذا الاستعلام قيمة عددية

source: The results backend no longer has the data from the query.
ar: لم تعد الواجهة الخلفية للنتائج تحتوي على البيانات من الاستعلام.

source: The results stored in the backend were stored in a different format, and no longer can be deserialized.
ar: تم تخزين النتائج المخزنة في الواجهة الخلفية بتنسيق مختلف، ولم يعد من الممكن إلغاء تسلسلها.

source: The rich tooltip shows a list of all series for that point in time
ar: يعرض تلميح الأدوات الغني قائمة بجميع السلاسل لتلك النقطة الزمنية.

source: The schema "%(schema)s" does not exist. A valid schema must be used to run this query.
ar: المخطط "%(schema)s" غير موجود. يجب استخدام مخطط صالح لتشغيل هذا الاستعلام.

source: The schema "%(schema_name)s" does not exist. A valid schema must be used to run this query.
ar: المخطط "%(schema_name)s" غير موجود. يجب استخدام مخطط صالح لتشغيل هذا الاستعلام.

source: The schema of the submitted payload is invalid.
ar: مخطط الحمولة المرسلة غير صالح.

source: The schema was deleted or renamed in the database.
ar: تم حذف المخطط أو إعادة تسميته في قاعدة البيانات.

source: The size of each cell in meters
ar: حجم كل خلية بالأمتار

source: The size of the square cell, in pixels
ar: حجم الخلية المربعة بالبكسل

source: The submitted payload failed validation.
ar: فشلت عملية التحقق من الحمولة المرسلة.

source: The submitted payload has the incorrect format.
ar: تحتوي الحمولة المرسلة على تنسيق غير صحيح.

source: The submitted payload has the incorrect schema.
ar: تحتوي الحمولة المرسلة على مخطط غير صحيح.

source: The table "%(table)s" does not exist. A valid table must be used to run this query.
ar: الجدول "%(table)s" غير موجود. يجب استخدام جدول صالح لتشغيل هذا الاستعلام.

source: The table "%(table_name)s" does not exist. A valid table must be used to run this query.
ar: الجدول "%(table_name)s" غير موجود. يجب استخدام جدول صالح لتشغيل هذا الاستعلام.

source: The table was created. As part of this two-phase configuration process, you should now click the edit button by the new table to configure it.
ar: تم إنشاء الجدول. كجزء من عملية التكوين المكونة من مرحلتين، يجب عليك الآن النقر فوق زر التحرير بجوار الجدول الجديد لتكوينه.

source: The table was deleted or renamed in the database.
ar: تم حذف الجدول أو إعادة تسميته في قاعدة البيانات.

source: The time column for the visualization. Note that you can define arbitrary expression that return a DATETIME column in the table. Also note that the filter below is applied against this column or expression
ar: العمود الزمني للتصور. لاحظ أنه يمكنك تعريف التعبير التعسفي الذي يعرض عمود DATETIME في الجدول. لاحظ أيضًا أن عامل التصفية أدناه مطبق على هذا العمود أو التعبير

source: The time granularity for the visualization. Note that you can type and use simple natural language as in `10 seconds`, `1 day` or `56 weeks`
ar: التفاصيل الزمنية للتصور. لاحظ أنه يمكنك كتابة واستخدام لغة طبيعية بسيطة كما هو الحال في «10 ثوانٍ» أو «يوم واحد» أو «56 أسبوعًا»

source: The time granularity for the visualization. Note that you can type and use simple natural language as in `10 seconds`,`1 day` or `56 weeks`
ar: التفاصيل الزمنية للتصور. لاحظ أنه يمكنك كتابة واستخدام لغة طبيعية بسيطة كما هو الحال في «10 ثوانٍ» أو «يوم واحد» أو «56 أسبوعًا»

source: The time granularity for the visualization. This applies a date transformation to alter your time column and defines a new time granularity. The options here are defined on a per database engine basis in the Superset source code.
ar: التفاصيل الزمنية للتصور. يؤدي هذا إلى تطبيق تحويل التاريخ لتغيير عمود الوقت الخاص بك وتحديد تفاصيل زمنية جديدة. يتم تحديد الخيارات هنا على أساس كل محرك قاعدة بيانات في شفرة مصدر Superset.

source: The time range for the visualization. All relative times, e.g. "Last month", "Last 7 days", "now", etc. are evaluated on the server using the server's local time (sans timezone). All tooltips and placeholder times are expressed in UTC (sans timezone). The timestamps are then evaluated by the database using the engine's local timezone. Note one can explicitly set the timezone per the ISO 8601 format if specifying either the start and/or end time.
ar: النطاق الزمني للتصور. يتم تقييم جميع الأوقات النسبية، مثل «الشهر الماضي» و «آخر 7 أيام» و «الآن» وما إلى ذلك على الخادم باستخدام التوقيت المحلي للخادم (بدون منطقة زمنية). يتم التعبير عن جميع تلميحات الأدوات وأوقات العناصر النائبة بالتوقيت العالمي المنسق (بدون منطقة زمنية). ثم يتم تقييم الطوابع الزمنية بواسطة قاعدة البيانات باستخدام المنطقة الزمنية المحلية للمحرك. لاحظ أنه يمكن للمرء تعيين المنطقة الزمنية بشكل صريح وفقًا لتنسيق ISO 8601 في حالة تحديد وقت البدء و/أو وقت الانتهاء.

source: The time unit for each block. Should be a smaller unit than domain_granularity. Should be larger or equal to Time Grain
ar: الوحدة الزمنية لكل كتلة. يجب أن تكون وحدة أصغر من domain_granularity. يجب أن تكون أكبر أو مساوية لـ Time Grain

source: The time unit used for the grouping of blocks
ar: الوحدة الزمنية المستخدمة لتجميع الكتل

source: The type of visualization to display
ar: نوع التصور المراد عرضه

source: The unit of measure for the specified point radius
ar: وحدة القياس لنصف قطر النقطة المحدد

source: The upper limit of the threshold range of the Isoband
ar: الحد الأعلى لنطاق عتبة Isoband

source: The user/password combination is not valid (Incorrect password for user).
ar: تركيبة المستخدم/كلمة المرور غير صالحة (كلمة مرور غير صحيحة للمستخدم).

source: The user seems to have been deleted
ar: يبدو أن المستخدم قد تم حذفه

source: The username "%(username)s" does not exist.
ar: اسم المستخدم "%(username)s" غير موجود.

source: The username provided when connecting to a database is not valid.
ar: اسم المستخدم المقدم عند الاتصال بقاعدة بيانات غير صالح.

source: The way the ticks are laid out on the X-axis
ar: الطريقة التي يتم بها وضع القراد على المحور السيني

source: The width of the Isoline in pixels
ar: عرض Isoline بالبكسل

source: The width of the lines
ar: عرض الخطوط

source: There's a loop in your Sankey, please provide a tree. Here's a faulty link: {}
ar: هناك حلقة في سانكي الخاص بك، يرجى تقديم شجرة. إليك رابط خاطئ: {}

source: There are associated alerts or reports
ar: هناك تنبيهات أو تقارير مرتبطة

source: There are associated alerts or reports: %(report_names)s
ar: هناك تنبيهات أو تقارير مرتبطة: %(report_names)s

source: There are no charts added to this dashboard
ar: لا توجد مخططات مضافة إلى لوحة التحكم هذه

source: There are no components added to this tab
ar: لا توجد مكونات مضافة إلى علامة التبويب هذه

source: There are no databases available
ar: لا توجد قواعد بيانات متاحة

source: There are no filters in this dashboard.
ar: لا توجد فلاتر في لوحة التحكم هذه.

source: There are unsaved changes.
ar: هناك تغييرات غير محفوظة.

source: There is a syntax error in the SQL query. Perhaps there was a misspelling or a typo.
ar: يوجد خطأ في بناء الجملة في استعلام SQL. ربما كان هناك خطأ إملائي أو خطأ مطبعي.

source: There is no chart definition associated with this component, could it have been deleted?
ar: لا يوجد تعريف مخطط مرتبط بهذا المكون، هل يمكن حذفه؟

source: There is not enough space for this component. Try decreasing its width, or increasing the destination width.
ar: لا توجد مساحة كافية لهذا المكون. حاول تقليل عرضها أو زيادة عرض الوجهة.
