Repository: rajpal-1/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: End (Longitude, Latitude):
ar: النهاية (خط الطول والعرض):

source: End angle
ar: زاوية النهاية

source: End date
ar: تاريخ النهاية

source: End date excluded from time range
ar: تم استبعاد تاريخ الانتهاء من النطاق الزمني

source: End date must be after start date
ar: يجب أن يكون تاريخ الانتهاء بعد تاريخ البدء

source: Engine "%(engine)s" cannot be configured through parameters.
ar: لا يمكن تكوين المحرك %(engine)s "" من خلال المعلمات.

source: Engine Parameters
ar: بارامترات المحرك

source: Engine spec "InvalidEngine" does not support being configured via individual parameters.
ar: لا تدعم مواصفات المحرك «InvalidEngine» التهيئة عبر المعلمات الفردية.

source: Enter CA_BUNDLE
ar: أدخل حزمة CA_BUNDLE

source: Enter Primary Credentials
ar: أدخل بيانات الاعتماد الأساسية

source: Enter a delimiter for this data
ar: أدخل محددًا لهذه البيانات

source: Enter a name for this sheet
ar: أدخل اسمًا لهذه الورقة

source: Enter a new title for the tab
ar: أدخل عنوانًا جديدًا لعلامة التبويب

source: Enter duration in seconds
ar: أدخل المدة بالثواني

source: Enter fullscreen
ar: أدخل ملء الشاشة

source: Enter the required %(dbModelName)s credentials
ar: أدخل %(dbModelName)s بيانات الاعتماد المطلوبة

source: Entity
ar: الكيان

source: Entity ID
ar: معرف الكيان

source: Equal Date Sizes
ar: مقاسات متساوية للتواريخ

source: Equal to (=)
ar: يساوي (=)

source: Error
ar: خطأ

source: Error: %(error)s
ar: خطأ: %(error)s

source: Error: %(msg)s
ar: خطأ: %(msg)s

source: Error: permalink state not found
ar: خطأ: لم يتم العثور على حالة الرابط الثابت

source: Error Fetching Tagged Objects
ar: حدث خطأ أثناء جلب الكائنات ذات العلامات

source: Error in jinja expression in HAVING clause: %(msg)s
ar: خطأ في تعبير jinja في جملة Having: %(msg)s

source: Error in jinja expression in RLS filters: %(msg)s
ar: خطأ في تعبير jinja في فلاتر RLS: %(msg)s

source: Error in jinja expression in WHERE clause: %(msg)s
ar: خطأ في تعبير jinja في جملة WHERE: %(msg)s

source: Error in jinja expression in fetch values predicate: %(msg)s
ar: خطأ في تعبير jinja في مسند قيم الجلب: %(msg)s

source: Error loading chart datasources. Filters may not work correctly.
ar: حدث خطأ أثناء تحميل مصادر بيانات المخطط. قد لا تعمل الفلاتر بشكل صحيح.

source: Error message
ar: رسالة خطأ

source: Error saving dataset
ar: حدث خطأ أثناء حفظ مجموعة البيانات

source: Error while fetching charts
ar: حدث خطأ أثناء جلب المخططات

source: Error while fetching data: %s
ar: حدث خطأ أثناء جلب البيانات: %s

source: Error while rendering virtual dataset query: %(msg)s
ar: حدث خطأ أثناء عرض استعلام مجموعة البيانات الافتراضية: %(msg)s

source: Estimate cost
ar: التكلفة التقديرية

source: Estimate selected query cost
ar: تقدير تكلفة الاستعلام المحدد

source: Estimate the cost before running a query
ar: قم بتقدير التكلفة قبل تشغيل الاستعلام

source: Event
ar: حدث

source: Event Flow
ar: تدفق الأحداث

source: Event Names
ar: أسماء الأحداث

source: Event definition
ar: تعريف الحدث

source: Event flow
ar: تدفق الأحداث

source: Event time column
ar: عمود وقت الحدث

source: Every
ar: كل

source: Evolution
ar: تطور

source: Exact
ar: دقيق

source: Example
ar: مثال

source: Examples
ar: أمثلة

source: Excel File
ar: ملف إكسيل

source: Excel file "%(excel_filename)s" uploaded to table "%(table_name)s" in database "%(db_name)s"
ar: تم تحميل ملف Excel %(excel_filename)s "" إلى الجدول "%(table_name)s" في قاعدة البيانات "%(db_name)s»

source: Excel to Database configuration
ar: تكوين Excel إلى قاعدة البيانات

source: Exclude selected values
ar: استبعاد القيم المحددة

source: Excluded roles
ar: الأدوار المستبعدة

source: Executed SQL
ar: تم تنفيذ SQL

source: Executed query
ar: استعلام تم تنفيذه

source: Execution ID
ar: معرف التنفيذ

source: Execution log
ar: سجل التنفيذ

source: Existing dataset
ar: مجموعة البيانات الحالية

source: Exit fullscreen
ar: الخروج من وضع ملء الشاشة

source: Expand
ar: قم بالتوسع

source: Expand all
ar: قم بتوسيع الكل

source: Expand data panel
ar: قم بتوسيع لوحة البيانات

source: Expand row
ar: قم بتوسيع الصف

source: Expand table preview
ar: قم بتوسيع معاينة الجدول

source: Expand tool bar
ar: قم بتوسيع شريط الأدوات

source: Expects a formula with depending time parameter 'x' in milliseconds since epoch. mathjs is used to evaluate the formulas. Example: '2x+5'
ar: تتوقع صيغة تعتمد على معامل الوقت 'x' بالمللي ثانية منذ العصر. يتم استخدام الرياضيات لتقييم الصيغ. مثال: «2x+5"

source: Experimental
ar: تجريبي

source: Explore
ar: اكتشف

source: Explore - %(table)s
ar: اكتشف - %(table)s

source: Explore the result set in the data exploration view
ar: استكشف مجموعة النتائج في عرض استكشاف البيانات

source: Export
ar: تصدير

source: Export dashboards?
ar: تصدير لوحات المعلومات؟

source: Export query
ar: استعلام التصدير

source: Export to Excel
ar: تصدير إلى Excel

source: Export to PDF
ar: تصدير إلى PDF

source: Export to YAML
ar: التصدير إلى YAML

source: Export to YAML?
ar: التصدير إلى YAML؟

source: Export to .CSV
ar: تصدير إلى .CSV

source: Export to .JSON
ar: تصدير إلى.JSON

source: Export to full Excel
ar: تصدير إلى Excel الكامل

source: Export to full .CSV
ar: تصدير إلى ملف CSV الكامل

source: Export to original .CSV
ar: تصدير إلى ملف CSV الأصلي

source: Export to pivoted .CSV
ar: التصدير إلى ملف CSV المحوري

source: Expose database in SQL Lab
ar: عرض قاعدة البيانات في SQL Lab

source: Expose in SQL Lab
ar: كشف في مختبر SQL

source: Expose this DB in SQL Lab
ar: قم بكشف قاعدة البيانات هذه في مختبر SQL

source: Expression
ar: التعبير

source: Extra
ar: -إضافي

source: Extra Controls
ar: عناصر تحكم إضافية

source: Extra Parameters
ar: المعلمات الإضافية

source: Extra data for JS
ar: بيانات إضافية لـ JS

source: Extra data to specify table metadata. Currently supports metadata of the format: `{ "certification": { "certified_by": "Data Platform Team", "details": "This table is the source of truth." }, "warning_markdown": "This is a warning." }`.
ar: بيانات إضافية لتحديد بيانات تعريف الجدول. يدعم حاليًا البيانات الوصفية للتنسيق: `{ "certification": { "certified_by": "Data Platform Team", "details": "This table is the source of truth." }, «warning_markdown»: «هذا تحذير.»}`.

source: Extra field cannot be decoded by JSON. %(msg)s
ar: لا يمكن فك تشفير الحقل الإضافي بواسطة JSON. %(msg)s

source: Extra parameters for use in jinja templated queries
ar: المعلمات الإضافية للاستخدام في استعلامات jinja النموذجية

source: Extra parameters that any plugins can choose to set for use in Jinja templated queries
ar: المعلمات الإضافية التي يمكن لأي مكونات إضافية اختيار تعيينها للاستخدام في استعلامات Jinja النموذجية

source: Extra url parameters for use in Jinja templated queries
ar: معلمات url إضافية للاستخدام في استعلامات Jinja النموذجية

source: Extruded
ar: مقذوف

source: FEB
ar: فبراير

source: FRI
ar: جمعة

source: Factor
ar: عامل

source: Factor to multiply the metric by
ar: عامل ضرب المقياس به

source: Fail
ar: فشل

source: Failed
ar: فشلت

source: Failed at retrieving results
ar: فشل في استرداد النتائج

source: Failed at stopping query. %s
ar: فشل في إيقاف الاستعلام. %s

source: Failed to create report
ar: فشلت عملية إنشاء التقرير

source: Failed to execute %(query)s
ar: فشل التنفيذ %(query)s

source: Failed to generate chart edit URL
ar: فشل إنشاء عنوان URL لتحرير المخطط

source: Failed to load chart data
ar: فشل تحميل بيانات المخطط

source: Failed to load chart data.
ar: فشل تحميل بيانات المخطط.

source: Failed to load dimensions for drill by
ar: فشل تحميل الأبعاد للحفر بواسطة

source: Failed to retrieve advanced type
ar: فشل استرداد النوع المتقدم

source: Failed to save cross-filter scoping
ar: فشلت عملية حفظ تحديد نطاق عوامل التصفية المشتركة

source: Failed to start remote query on a worker.
ar: فشل بدء الاستعلام عن بعد على عامل.

source: Failed to tag items
ar: فشلت عملية وضع علامة على العناصر

source: Failed to update report
ar: أخفق تحديث التقرير

source: Failed to verify select options: %s
ar: فشلت عملية التحقق من خيارات التحديد: %s

source: Favorite
ar: مفضل

source: February
ar: شهر فبراير

source: Fetch Values Predicate
ar: مسند قيم الإحضار

source: Fetch data preview
ar: إحضار معاينة البيانات

source: Fetched %s
ar: تم جلبه %s

source: Fetching
ar: جلب

source: Field cannot be decoded by JSON. %(json_error)s
ar: لا يمكن فك تشفير الحقل بواسطة JSON. %(json_error)s

source: Field cannot be decoded by JSON. %(msg)s
ar: لا يمكن فك تشفير الحقل بواسطة JSON. %(msg)s

source: Field is required
ar: الحقل مطلوب

source: File
ar: الملف

source: File size must be less than or equal to %(max_size)s bytes
ar: يجب أن يكون حجم الملف أقل من أو يساوي %(max_size)s وحدات البايت

source: Fill Color
ar: لون التعبئة

source: Fill all required fields to enable "Default Value"
ar: املأ جميع الحقول المطلوبة لتمكين «القيمة الافتراضية»

source: Fill method
ar: طريقة التعبئة

source: Filled
ar: معبأ

source: Filter
ar: عامل التصفية

source: Filter Configuration
ar: تكوين عامل التصفية

source: Filter List
ar: قائمة التصفية

source: Filter Settings
ar: إعدادات التصفية

source: Filter Type
ar: نوع الفلتر

source: Filter charts
ar: مخططات التصفية

source: Filter has default value
ar: يحتوي عامل التصفية على قيمة افتراضية

source: Filter menu
ar: قائمة التصفية

source: Filter name
ar: اسم عامل التصفية

source: Filter only displays values relevant to selections made in other filters.
ar: يعرض عامل التصفية فقط القيم ذات الصلة بالتحديدات التي تم إجراؤها في عوامل تصفية أخرى.

source: Filter results
ar: نتائج التصفية

source: Filter type
ar: نوع الفلتر

source: Filter value (case sensitive)
ar: قيمة الفلتر (حساس لحالة الأحرف)

source: Filter value is required
ar: قيمة التصفية مطلوبة

source: Filter value list cannot be empty
ar: لا يمكن أن تكون قائمة قيم التصفية فارغة

source: Filter your charts
ar: تصفية الرسوم البيانية الخاصة بك

source: Filterable
ar: قابل للفلترة

source: Filters
ar: مرشحات

source: Filters by columns
ar: الفلاتر حسب الأعمدة

source: Filters by metrics
ar: الفلاتر حسب المقاييس

source: Filters for Comparison
ar: فلاتر للمقارنة

source: Filters for comparison must have a value
ar: يجب أن تحتوي الفلاتر للمقارنة على قيمة

source: Filters out of scope (%d)
ar: الفلاتر خارج النطاق (%d)

source: Filters with the same group key will be ORed together within the group, while different filter groups will be ANDed together. Undefined group keys are treated as unique groups, i.e. are not grouped together. For example, if a table has three filters, of which two are for departments Finance and Marketing (group key = 'department'), and one refers to the region Europe (group key = 'region'), the filter clause would apply the filter (department = 'Finance' OR department = 'Marketing') AND (region = 'Europe').
ar: سيتم ربط الفلاتر التي لها نفس مفتاح المجموعة معًا داخل المجموعة، بينما سيتم دمج مجموعات التصفية المختلفة معًا. يتم التعامل مع مفاتيح المجموعة غير المحددة كمجموعات فريدة، أي لا يتم تجميعها معًا. على سبيل المثال، إذا كان الجدول يحتوي على ثلاثة فلاتر، اثنان منها للإدارات المالية والتسويق (مفتاح المجموعة = 'القسم')، وواحد يشير إلى المنطقة الأوروبية (مفتاح المجموعة = 'المنطقة')، فإن جملة التصفية ستطبق عامل التصفية (القسم = 'الشؤون المالية' أو القسم = 'التسويق') و (المنطقة = 'أوروبا').

source: Find
ar: ابحث

source: Finish
ar: إنهاء

source: First
ar: الأولى

source: Fix the trend line to the full time range specified in case filtered results do not include the start or end dates
ar: قم بإصلاح خط الاتجاه إلى النطاق الزمني الكامل المحدد في حالة عدم تضمين النتائج التي تمت تصفيتها لتواريخ البدء أو الانتهاء

source: Fix to selected Time Range
ar: إصلاح النطاق الزمني المحدد

source: Fixed
ar: ثابت

source: Fixed Color
ar: لون ثابت

source: Fixed color
ar: لون ثابت

source: Fixed point radius
ar: نصف قطر النقطة الثابت

source: Flow
ar: التدفق

source: Font size
ar: حجم الخط

source: Font size for axis labels, detail value and other text elements
ar: حجم الخط لتسميات المحور وقيمة التفاصيل وعناصر النص الأخرى

source: Font size for the biggest value in the list
ar: حجم الخط لأكبر قيمة في القائمة

source: Font size for the smallest value in the list
ar: حجم الخط لأصغر قيمة في القائمة

source: For Bigquery, Presto and Postgres, shows a button to compute cost before running a query.
ar: بالنسبة إلى Bigquery وPresto وPostgres، يعرض زرًا لحساب التكلفة قبل تشغيل الاستعلام.

source: For Trino, describe full schemas of nested ROW types, expanding them with dotted paths
ar: بالنسبة لـ Trino، قم بوصف المخططات الكاملة لأنواع ROW المتداخلة، وقم بتوسيعها بمسارات منقطة

source: For further instructions, consult the
ar: لمزيد من التعليمات، راجع

source: For more information about objects are in context in the scope of this function, refer to the
ar: لمزيد من المعلومات حول الكائنات الموجودة في السياق في نطاق هذه الوظيفة، راجع

source: For regular filters, these are the roles this filter will be applied to. For base filters, these are the roles that the filter DOES NOT apply to, e.g. Admin if admin should see all data.
ar: بالنسبة للفلاتر العادية، هذه هي الأدوار التي سيتم تطبيق عامل التصفية هذا عليها. بالنسبة للفلاتر الأساسية، هذه هي الأدوار التي لا ينطبق عليها عامل التصفية، على سبيل المثال Admin إذا كان يجب على المشرف رؤية جميع البيانات.

source: Force
ar: القوة

source: Force all tables and views to be created in this schema when clicking CTAS or CVAS in SQL Lab.
ar: قم بفرض إنشاء كافة الجداول وطرق العرض في هذا المخطط عند النقر فوق CTAS أو CVAS في SQL Lab.

source: Force categorical
ar: القوة الفئوية

source: Force date format
ar: صيغة تاريخ القوة

source: Force refresh
ar: تحديث القوة

source: Force refresh schema list
ar: قائمة مخطط تحديث القوة

source: Force refresh table list
ar: قائمة جدول تحديث القوة

source: Forecast periods
ar: فترات التنبؤ

source: Foreign key
ar: مفتاح خارجي

source: Forest Green
ar: فورست جرين

source: Form data not found in cache, reverting to chart metadata.
ar: لم يتم العثور على بيانات النموذج في ذاكرة التخزين المؤقت، مع العودة إلى البيانات الوصفية للمخطط.

source: Form data not found in cache, reverting to dataset metadata.
ar: لم يتم العثور على بيانات النموذج في ذاكرة التخزين المؤقت، حيث يتم الرجوع إلى بيانات تعريف مجموعة البيانات.

source: Format SQL
ar: صيغة SQL

source: Formatted CSV attached in email
ar: ملف CSV منسق مرفق بالبريد الإلكتروني

source: Formatted date
ar: تاريخ منسق

source: Formatted value
ar: قيمة منسقة

source: Formatting
ar: التنسيق

source: Formula
ar: صيغة

source: Forward values
ar: القيم المستقبلية

source: Found invalid orderby options
ar: تم العثور على ترتيب غير صالح حسب الخيارات

source: Fraction digits
ar: أرقام الكسور

source: Frequency
ar: التردد

source: Friction
ar: احتكاك

source: Friction between nodes
ar: الاحتكاك بين العقد

source: Friday
ar: الجمعة

source: From date cannot be larger than to date
ar: من التاريخ لا يمكن أن يكون أكبر من التاريخ

source: Full name
ar: الأسم بالكامل

source: Funnel Chart
ar: مخطط قمعي

source: Further customize how to display each column
ar: قم بتخصيص المزيد من كيفية عرض كل عمود

source: Further customize how to display each metric
ar: قم بتخصيص المزيد من كيفية عرض كل مقياس

source: GROUP BY
ar: مجموعة حسب

source: Gauge Chart
ar: مخطط القياس

source: General
ar: جنرال لواء

source: Generating link, please wait..
ar: جاري إنشاء الرابط، يرجى الانتظار..

source: Generic Chart
ar: مخطط عام

source: Geo
ar: الجغرافية

source: GeoJson Column
ar: عمود جيوجسون

source: GeoJson Settings
ar: إعدادات جيوجسون

source: Geohash
ar: جيوهاش

source: Get the last date by the date unit.
ar: احصل على التاريخ الأخير حسب وحدة التاريخ.

source: Get the specify date for the holiday
ar: احصل على التاريخ المحدد للعطلة

source: Go to the edit mode to configure the dashboard and add charts
ar: انتقل إلى وضع التحرير لتكوين لوحة المعلومات وإضافة المخططات

source: Gold
ar: الذهب

source: Google Sheet Name and URL
ar: اسم ورقة Google وعنوان URL

source: Grace period
ar: فترة السماح

source: Graph Chart
ar: مخطط بياني

source: Graph layout
ar: تخطيط الرسم البياني

source: Gravity
ar: الجاذبية

source: Greater or equal (>=)
ar: أكبر أو يساوي (>=)

source: Greater than (>)
ar: أكبر من (>)

source: Grid
ar: جريد

source: Grid Size
ar: حجم الشبكة

source: Group By
ar: مجموعة حسب

source: Group By, Metrics or Percentage Metrics must have a value
ar: يجب أن تحتوي المجموعة حسب أو المقاييس أو مقاييس النسبة المئوية على قيمة

source: Group Key
ar: مفتاح المجموعة

source: Group by
ar: مجموعة حسب

source: Groupable
ar: قابل للتجميع

source: Guest user cannot modify chart payload
ar: لا يمكن للمستخدم الضيف تعديل حمولة المخطط

source: Handlebars
ar: المقاود

source: Handlebars Template
ar: قالب المقاود

source: Hard value bounds applied for color coding. Is only relevant and applied when the normalization is applied against the whole heatmap.
ar: يتم تطبيق حدود القيمة الثابتة للترميز اللوني. تكون ذات صلة ويتم تطبيقها فقط عندما يتم تطبيق التطبيع على خريطة الحرارة بأكملها.

source: Has created by
ar: تم إنشاؤه بواسطة

source: Header
ar: رأس الصفحة

source: Header Row
ar: صف رأس الصفحة

source: Heatmap
ar: خريطة الحرارة

source: Heatmap Options
ar: خيارات خريطة التمثيل اللوني

source: Height
ar: الارتفاع

source: Height of the sparkline
ar: ارتفاع خط الشرارة

source: Hide Line
ar: إخفاء الخط

source: Hide chart description
ar: إخفاء وصف المخطط

source: Hide layer
ar: إخفاء الطبقة

source: Hide password.
ar: إخفاء كلمة المرور.

source: Hide tool bar
ar: إخفاء شريط الأدوات

source: Hides the Line for the time series
ar: يخفي الخط الخاص بالسلسلة الزمنية

source: Hierarchy
ar: التسلسل الهرمي

source: Histogram
ar: الرسم البياني

source: Horizon Chart
ar: مخطط الأفق

source: Horizon Charts
ar: مخططات هورايزن

source: Horizontal
ar: أفقي

source: Horizontal (Top)
ar: أفقي (أعلى)

source: Horizontal alignment
ar: محاذاة أفقية

source: Host
ar: المضيف

source: Hostname or IP address
ar: اسم المضيف أو عنوان IP

source: Hour
ar: ساعة

source: Hours %s
ar: ساعات %s

source: Hours offset
ar: تعويض الساعات

source: How do you want to enter service account credentials?
ar: كيف تريد إدخال بيانات اعتماد حساب الخدمة؟

source: How many buckets should the data be grouped in.
ar: كم عدد المجموعات التي يجب تجميع البيانات فيها.

source: How many periods into the future do we want to predict
ar: كم عدد الفترات في المستقبل التي نريد التنبؤ بها

source: How to display time shifts: as individual lines; as the difference between the main time series and each time shift; as the percentage change; or as the ratio between series and time shifts.
ar: كيفية عرض التحولات الزمنية: كخطوط فردية؛ أو كفرق بين السلسلة الزمنية الرئيسية وكل تحول زمني؛ أو كتغير النسبة المئوية؛ أو كنسبة بين السلاسل والتحولات الزمنية.

source: Huge
ar: ضخم

source: ISO 3166-2 Codes
ar: رموز أيزو 3166-2

source: ISO 8601
ar: أيزو 8601

source: Id
ar: هوية شخصية

source: Id of root node of the tree.
ar: معرف العقدة الجذرية للشجرة.

source: If Presto, all the queries in SQL Lab are going to be executed as the currently logged on user who must have permission to run them.<br/>If Hive and hive.server2.enable.doAs is enabled, will run the queries as service account, but impersonate the currently logged on user via hive.server2.proxy.user property.
ar: إذا كان Presto، فسيتم تنفيذ جميع الاستعلامات في SQL Lab كمستخدم يقوم بتسجيل الدخول حاليًا والذي يجب أن يكون لديه إذن لتشغيلها. <br/>إذا تم تمكين Hive و Hive.server2.enable.doas، فسيتم تشغيل الاستعلامات كحساب خدمة، ولكن مع انتحال شخصية المستخدم الذي قام بتسجيل الدخول حاليًا عبر خاصية hive.server2.proxy.user.

source: If Presto or Trino, all the queries in SQL Lab are going to be executed as the currently logged on user who must have permission to run them. If Hive and hive.server2.enable.doAs is enabled, will run the queries as service account, but impersonate the currently logged on user via hive.server2.proxy.user property.
ar: إذا كان Presto أو Trino، فسيتم تنفيذ جميع الاستعلامات في SQL Lab كمستخدم يقوم بتسجيل الدخول حاليًا والذي يجب أن يكون لديه إذن لتشغيلها. إذا تم تمكين Hive و Hive.server2.enable.doas، فسيتم تشغيل الاستعلامات كحساب خدمة، ولكن مع انتحال شخصية المستخدم الذي قام بتسجيل الدخول حاليًا عبر خاصية hive.server2.proxy.user.

source: If Table Already Exists
ar: إذا كان الجدول موجودًا بالفعل

source: If a metric is specified, sorting will be done based on the metric value
ar: إذا تم تحديد مقياس، فسيتم الفرز استنادًا إلى قيمة المقياس

source: If duplicate columns are not overridden, they will be presented as "X.1, X.2 ...X.x"
ar: إذا لم يتم تجاوز الأعمدة المكررة، فسيتم تقديمها كـ «X.1، X.2... X.x»

source: If enabled, this control sorts the results/values descending, otherwise it sorts the results ascending.
ar: في حالة التمكين، يقوم عنصر التحكم هذا بفرز النتائج/القيم تنازليًا، وإلا فإنه يقوم بفرز النتائج تصاعديًا.

source: If selected, please set the schemas allowed for csv upload in Extra.
ar: في حالة التحديد، يرجى تعيين المخططات المسموح بها لتحميل csv في Extra.

source: If table exists do one of the following: Fail (do nothing), Replace (drop and recreate table) or Append (insert data).
ar: في حالة وجود جدول، قم بتنفيذ أحد الإجراءات التالية: الفشل (عدم القيام بأي شيء) أو الاستبدال (إسقاط الجدول وإعادة إنشائه) أو الإلحاق (إدراج البيانات).

source: Ignore cache when generating report
ar: تجاهل ذاكرة التخزين المؤقت عند إنشاء التقرير

source: Ignore null locations
ar: تجاهل المواقع الخالية

source: Ignore time
ar: تجاهل الوقت

source: Image (PNG) embedded in email
ar: صورة (PNG) مضمنة في البريد الإلكتروني

source: Image download failed, please refresh and try again.
ar: فشل تنزيل الصورة، يرجى التحديث والمحاولة مرة أخرى.

source: Impersonate logged in user (Presto, Trino, Drill, Hive, and GSheets)
ar: انتحال شخصية المستخدم الذي قام بتسجيل الدخول (بريستو، ترينو، دريل، هايف، وGSheets)

source: Impersonate the logged on user
ar: انتحال شخصية المستخدم الذي قام بتسجيل الدخول

source: Import
ar: الاستيراد

source: Import %s
ar: الاستيراد %s

source: Import Dashboard(s)
ar: لوحة (لوحات) الاستيراد

source: Import a table definition
ar: استيراد تعريف جدول

source: Import chart failed for an unknown reason
ar: فشل مخطط الاستيراد لسبب غير معروف

source: Import charts
ar: استيراد الرسوم البيانية

source: Import dashboard failed for an unknown reason
ar: فشلت لوحة معلومات الاستيراد لسبب غير معروف

source: Import dashboards
ar: استيراد لوحات المعلومات

source: Import database failed for an unknown reason
ar: فشل استيراد قاعدة بيانات لسبب غير معروف

source: Import database from file
ar: استيراد قاعدة بيانات من ملف

source: Import dataset failed for an unknown reason
ar: فشل استيراد مجموعة البيانات لسبب غير معروف

source: Import datasets
ar: استيراد مجموعات البيانات

source: Import queries
ar: استعلامات الاستيراد

source: Import saved query failed for an unknown reason.
ar: فشل استيراد الاستعلام المحفوظ لسبب غير معروف.

source: Important! Select this if the table is not already sorted by entity id, else there is no guarantee that all events for each entity are returned.
ar: هام! حدد هذا إذا لم يتم فرز الجدول بالفعل حسب معرف الكيان، وإلا فلن يكون هناك ضمان بإرجاع جميع الأحداث لكل كيان.

source: In
ar: في

source: Include Series
ar: قم بتضمين السلسلة

source: Include a description that will be sent with your report
ar: قم بتضمين وصف سيتم إرساله مع تقريرك

source: Include series name as an axis
ar: قم بتضمين اسم السلسلة كمحور

source: Include time
ar: قم بتضمين الوقت

source: Increase
ar: زيادة

source: Index
ar: الفهرس

source: Index Column
ar: عمود الفهرس

source: Info
ar: معلومات

source: Inner Radius
ar: الشعاع الداخلي

source: Inner radius of donut hole
ar: نصف القطر الداخلي لفتحة الدونات

source: Input custom width in pixels
ar: عرض الإدخال المخصص بالبكسل

source: Input field supports custom rotation. e.g. 30 for 30°
ar: يدعم حقل الإدخال التدوير المخصص. على سبيل المثال 30 لـ 30 درجة

source: Intensity
ar: الكثافة

source: Intensity Radius
ar: نطاق الكثافة

source: Intensity Radius is the radius at which the weight is distributed
ar: نصف قطر الكثافة هو نصف القطر الذي يتم فيه توزيع الوزن

source: Intensity is the value multiplied by the weight to obtain the final weight
ar: الكثافة هي القيمة مضروبة في الوزن للحصول على الوزن النهائي
