Repository: rajpal-1/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Put the labels outside the pie?
ar: ضع الملصقات خارج الفطيرة؟

source: Put your code here
ar: ضع الكود الخاص بك هنا

source: Python datetime string pattern
ar: نمط سلسلة التاريخ والوقت في بايثون

source: QUERY DATA IN SQL LAB
ar: الاستعلام عن البيانات في مختبر SQL

source: Quarter
ar: الربع

source: Quarters %s
ar: أرباع %s

source: Queries
ar: الاستعلامات

source: Query
ar: استعلام

source: Query %s: %s
ar: الاستعلام%s: %s

source: Query A
ar: الاستعلام أ

source: Query B
ar: الاستعلام B

source: Query History
ar: سجل الاستعلام

source: Query does not exist
ar: الاستعلام غير موجود

source: Query history
ar: سجل الاستعلام

source: Query imported
ar: تم استيراد الاستعلام

source: Query in a new tab
ar: استعلام في علامة تبويب جديدة

source: Query is too complex and takes too long to run.
ar: الاستعلام معقد للغاية ويستغرق وقتًا طويلاً للتشغيل.

source: Query mode
ar: وضع الاستعلام

source: Query name
ar: اسم الاستعلام

source: Query preview
ar: معاينة الاستعلام

source: Query was stopped
ar: تم إيقاف الاستعلام

source: Query was stopped.
ar: تم إيقاف الاستعلام.

source: RANGE TYPE
ar: نوع النطاق

source: RGB Color
ar: لون آر جي بي

source: RLS Rule not found.
ar: لم يتم العثور على قاعدة RLS.

source: RLS rules could not be deleted.
ar: لا يمكن حذف قواعد RLS.

source: Radar
ar: رادار

source: Radar Chart
ar: مخطط الرادار

source: Radar render type, whether to display 'circle' shape.
ar: نوع عرض الرادار، سواء لعرض شكل «الدائرة».

source: Radial
ar: شعاعي

source: Radius in kilometers
ar: نصف القطر بالكيلومترات

source: Radius in meters
ar: نصف القطر بالأمتار

source: Radius in miles
ar: الشعاع بالأميال

source: Ran %s
ar: ران %s

source: Range
ar: النطاق

source: Range filter
ar: مرشح النطاق

source: Range filter plugin using AntD
ar: البرنامج المساعد لتصفية النطاق باستخدام AntD

source: Range for Comparison
ar: نطاق للمقارنة

source: Range labels
ar: ملصقات النطاق

source: Ranges
ar: النطاقات

source: Ranges to highlight with shading
ar: نطاقات لتسليط الضوء عليها باستخدام التظليل

source: Ranking
ar: الترتيب

source: Ratio
ar: نسبة

source: Raw records
ar: السجلات الخام

source: Recently created charts, dashboards, and saved queries will appear here
ar: ستظهر هنا المخططات ولوحات المعلومات والاستعلامات المحفوظة التي تم إنشاؤها مؤخرًا

source: Recently edited charts, dashboards, and saved queries will appear here
ar: ستظهر هنا المخططات ولوحات المعلومات والاستعلامات المحفوظة التي تم تحريرها مؤخرًا

source: Recently modified
ar: تم تعديله مؤخرًا

source: Recently viewed charts, dashboards, and saved queries will appear here
ar: ستظهر هنا المخططات ولوحات المعلومات والاستعلامات المحفوظة التي تمت مشاهدتها مؤخرًا

source: Recents
ar: الأخيرة

source: Recipients are separated by "," or ";"
ar: يتم فصل المستلمين بـ «أو» أو «؛»

source: Recommended tags
ar: العلامات الموصى بها

source: Record Count
ar: عدد السجلات

source: Rectangle
ar: مستطيل

source: Redirects to this endpoint when clicking on the table from the table list
ar: يعيد التوجيه إلى نقطة النهاية هذه عند النقر على الجدول من قائمة الجدول

source: Redo the action
ar: أعد الإجراء

source: Reduce X ticks
ar: تقليل القراد X

source: Reduces the number of X-axis ticks to be rendered. If true, the x-axis will not overflow and labels may be missing. If false, a minimum width will be applied to columns and the width may overflow into an horizontal scroll.
ar: يقلل من عدد علامات المحور X التي سيتم عرضها. إذا كان هذا صحيحًا، فلن يتم تجاوز المحور السيني وقد تكون التسميات مفقودة. إذا كان الخطأ خاطئًا، فسيتم تطبيق الحد الأدنى للعرض على الأعمدة وقد يتجاوز العرض إلى التمرير الأفقي.

source: Refer to the
ar: ارجع إلى

source: Referenced columns not available in DataFrame.
ar: الأعمدة المشار إليها غير متوفرة في DataFrame.

source: Refetch results
ar: نتائج إعادة البحث

source: Refresh
ar: تحديث

source: Refresh dashboard
ar: تحديث لوحة التحكم

source: Refresh frequency
ar: تردد التحديث

source: Refresh interval
ar: الفاصل الزمني للتحديث

source: Refresh interval saved
ar: تم حفظ الفاصل الزمني للتحديث

source: Refresh the default values
ar: قم بتحديث القيم الافتراضية

source: Refreshing charts
ar: رسوم بيانية مُنعشة

source: Refreshing columns
ar: أعمدة منعشة

source: Regular
ar: عادي

source: Regular filters add where clauses to queries if a user belongs to a role referenced in the filter, base filters apply filters to all queries except the roles defined in the filter, and can be used to define what users can see if no RLS filters within a filter group apply to them.
ar: تضيف عوامل التصفية العادية عبارات المكان إلى الاستعلامات إذا كان المستخدم ينتمي إلى دور مشار إليه في عامل التصفية، وتطبق عوامل التصفية الأساسية عوامل التصفية على جميع الاستعلامات باستثناء الأدوار المحددة في عامل التصفية، ويمكن استخدامها لتحديد ما يمكن للمستخدمين رؤيته في حالة عدم تطبيق عوامل تصفية RLS داخل مجموعة عوامل التصفية عليهم.

source: Relational
ar: العلائقية

source: Relationships between community channels
ar: العلاقات بين قنوات المجتمع

source: Relative Date/Time
ar: التاريخ/الوقت النسبي

source: Relative period
ar: الفترة النسبية

source: Relative quantity
ar: الكمية النسبية

source: Reload
ar: إعادة تحميل

source: Remove
ar: ازاله

source: Remove cross-filter
ar: قم بإزالة عامل التصفية المتقاطع

source: Remove item
ar: إزالة العنصر

source: Remove query from log
ar: إزالة الاستعلام من السجل

source: Remove table preview
ar: إزالة معاينة الجدول

source: Removed columns: %s
ar: الأعمدة التي تمت إزالتها: %s

source: Rename tab
ar: إعادة تسمية علامة

source: Rendering
ar: التجسيد

source: Replace
ar: استبدال

source: Report
ar: أبلغ عن

source: Report Name
ar: اسم التقرير

source: Report Schedule could not be created.
ar: تعذر إنشاء جدول التقارير.

source: Report Schedule could not be updated.
ar: لا يمكن تحديث جدول التقارير.

source: Report Schedule delete failed.
ar: فشل حذف جدول التقرير.

source: Report Schedule execution failed when generating a csv.
ar: فشل تنفيذ جدول التقرير عند إنشاء ملف csv.

source: Report Schedule execution failed when generating a dataframe.
ar: فشل تنفيذ جدول التقرير عند إنشاء إطار بيانات.

source: Report Schedule execution failed when generating a screenshot.
ar: فشل تنفيذ جدول التقرير عند إنشاء لقطة شاشة.

source: Report Schedule execution got an unexpected error.
ar: حدث خطأ غير متوقع في تنفيذ جدول التقرير.

source: Report Schedule is still working, refusing to re-compute.
ar: لا يزال جدول التقارير يعمل، ويرفض إعادة الحساب.

source: Report Schedule log prune failed.
ar: فشل تقليم سجل جدول التقرير.

source: Report Schedule not found.
ar: لم يتم العثور على جدول التقرير.

source: Report Schedule parameters are invalid.
ar: معاملات جدول التقارير غير صالحة.

source: Report Schedule reached a working timeout.
ar: وصل جدول التقرير إلى مهلة العمل.

source: Report Schedule state not found
ar: لم يتم العثور على حالة جدول التقرير

source: Report a bug
ar: الإبلاغ عن خطأ

source: Report failed
ar: أخفق التقرير

source: Report name
ar: اسم التقرير

source: Report schedule
ar: جدول التقرير

source: Report schedule client error
ar: الإبلاغ عن خطأ عميل في الجدول

source: Report schedule system error
ar: خطأ في نظام جدولة التقارير

source: Report schedule unexpected error
ar: خطأ غير متوقع في جدولة التقرير

source: Report sending
ar: إرسال التقرير

source: Report sent
ar: تم إرسال التقرير

source: Report updated
ar: تم تحديث التقرير

source: Reports
ar: تقارير

source: Repulsion
ar: تنافر

source: Repulsion strength between nodes
ar: قوة التنافر بين العقد

source: Request is incorrect: %(error)s
ar: الطلب غير صحيح: %(error)s

source: Request is not JSON
ar: الطلب ليس JSON

source: Request missing data field.
ar: اطلب حقل بيانات مفقود.

source: Request timed out
ar: انتهت مهلة الطلب

source: Required
ar: المطلوبة

source: Required control values have been removed
ar: تمت إزالة قيم التحكم المطلوبة

source: Resample
ar: إعادة أخذ عينة

source: Resample method should in
ar: يجب أن تكون طريقة إعادة العينة في

source: Resample operation requires DatetimeIndex
ar: تتطلب عملية إعادة التشكيل DateTimeIndex

source: Reset
ar: إعادة تعيين

source: Reset state
ar: إعادة ضبط الحالة

source: Resource already has an attached report.
ar: يحتوي المورد بالفعل على تقرير مرفق.

source: Resource was not found.
ar: لم يتم العثور على المورد.

source: Restore Filter
ar: عامل تصفية الاستعادة

source: Results
ar: النتائج

source: Results %s
ar: النتائج %s

source: Results backend is not configured.
ar: لم يتم تكوين الواجهة الخلفية للنتائج.

source: Results backend needed for asynchronous queries is not configured.
ar: لم يتم تكوين الواجهة الخلفية للنتائج المطلوبة للاستعلامات غير المتزامنة.

source: Return to specific datetime.
ar: ارجع إلى تاريخ/وقت محدد.

source: Reverse Lat & Long
ar: تصميم عكسي طويل وطويل

source: Reverse lat/long
ar: خط عرض/طويل عكسي

source: Rich Tooltip
ar: تلميح الأدوات الغني

source: Rich tooltip
ar: تلميح الأدوات الغني

source: Right
ar: صحيح

source: Right-click on a dimension value to drill to detail by that value.
ar: انقر بزر الماوس الأيمن على قيمة البعد للانتقال إلى التفاصيل حسب تلك القيمة.

source: Right Axis Format
ar: تنسيق المحور الأيمن

source: Right Axis Metric
ar: مقياس المحور الأيمن

source: Right axis metric
ar: مقياس المحور الأيمن

source: Right to Left
ar: من اليمين إلى اليسار

source: Right value
ar: القيمة الصحيحة

source: Role
ar: الدور

source: Roles
ar: الأدوار

source: Roles is a list which defines access to the dashboard. Granting a role access to a dashboard will bypass dataset level checks.If no roles are defined, regular access permissions apply.
ar: الأدوار هي قائمة تحدد الوصول إلى لوحة المعلومات. سيؤدي منح الدور إلى لوحة المعلومات إلى تجاوز عمليات التحقق من مستوى مجموعة البيانات. في حالة عدم تحديد الأدوار، يتم تطبيق أذونات الوصول العادية.

source: Roles is a list which defines access to the dashboard. Granting a role access to a dashboard will bypass dataset level checks. If no roles are defined, regular access permissions apply.
ar: الأدوار هي قائمة تحدد الوصول إلى لوحة المعلومات. سيؤدي منح الدور إلى لوحة المعلومات إلى تجاوز عمليات التحقق من مستوى مجموعة البيانات. في حالة عدم تحديد أي أدوار، يتم تطبيق أذونات الوصول العادية.

source: Rolling Function
ar: وظيفة التدحرج

source: Rolling Window
ar: نافذة متدحرجة

source: Rolling function
ar: وظيفة التدحرج

source: Rolling window
ar: نافذة متدحرجة

source: Root certificate
ar: شهادة الجذر

source: Root node id
ar: معرف عقدة الجذر

source: Rotate x axis label
ar: قم بتدوير تسمية المحور x

source: Rotate y axis label
ar: قم بتدوير تسمية المحور y

source: Rotation to apply to words in the cloud
ar: التدوير لتطبيقه على الكلمات في السحابة

source: Round cap
ar: قبعة مستديرة

source: Row
ar: صف

source: Row Level Security
ar: الأمان على مستوى الصف

source: Row containing the headers to use as column names (0 is first line of data). Leave empty if there is no header row
ar: صف يحتوي على الرؤوس لاستخدامها كأسماء أعمدة (0 هو السطر الأول من البيانات). اتركه فارغًا إذا لم يكن هناك صف بالعنوان

source: Row containing the headers to use as column names (0 is first line of data). Leave empty if there is no header row.
ar: صف يحتوي على الرؤوس لاستخدامها كأسماء أعمدة (0 هو السطر الأول من البيانات). اتركه فارغًا إذا لم يكن هناك صف بالعنوان.

source: Row limit
ar: حد الصفوف

source: Rows
ar: صفوف

source: Rows per page, 0 means no pagination
ar: الصفوف لكل صفحة، 0 يعني عدم وجود ترقيم للصفحات

source: Rows subtotal position
ar: موضع المجموع الفرعي للصفوف

source: Rows to Read
ar: صفوف للقراءة

source: Rule
ar: القاعدة

source: Rule Name
ar: اسم القاعدة

source: Rule added
ar: تمت إضافة القاعدة

source: Run
ar: اركض

source: Run a query to display query history
ar: تشغيل استعلام لعرض سجل الاستعلام

source: Run a query to display results
ar: تشغيل استعلام لعرض النتائج

source: Run current query
ar: تشغيل الاستعلام الحالي

source: Run in SQL Lab
ar: تشغيل في مختبر SQL

source: Run query
ar: تشغيل الاستعلام

source: Run query (Ctrl + Return)
ar: تشغيل الاستعلام (Ctrl + العودة)

source: Run query in a new tab
ar: تشغيل الاستعلام في علامة تبويب جديدة

source: Run selection
ar: اختيار التشغيل

source: Running
ar: قيد التشغيل

source: Running statement %(statement_num)s out of %(statement_count)s
ar: جاري تشغيل البيان %(statement_num)s من %(statement_count)s

source: SAT
ar: جلس

source: SEP
ar: سبتمبر

source: SHA
ar: شا

source: SQLAlchemy URI
ar: عنوان URL لكيمياء SQL

source: SQL Copied!
ar: تم نسخ SQL!

source: SQL Expression
ar: تعبير SQL

source: SQL Lab
ar: مختبر إس كيو إل

source: SQL Lab View
ar: عرض مختبر SQL

source: SQL Lab uses your browser's local storage to store queries and results. Currently, you are using %(currentUsage)s KB out of %(maxStorage)d KB storage space. To keep SQL Lab from crashing, please delete some query tabs. You can re-access these queries by using the Save feature before you delete the tab. Note that you will need to close other SQL Lab windows before you do this.
ar: يستخدم SQL Lab التخزين المحلي للمتصفح لتخزين الاستعلامات والنتائج. حاليًا، تستخدم %(currentUsage)s KB خارج مساحة تخزين %(maxStorage)d KB. لمنع SQL Lab من التعطل، يرجى حذف بعض علامات تبويب الاستعلام. يمكنك إعادة الوصول إلى هذه الاستعلامات باستخدام ميزة الحفظ قبل حذف علامة التبويب. لاحظ أنك ستحتاج إلى إغلاق نوافذ SQL Lab الأخرى قبل القيام بذلك.

source: SQL Query
ar: استعلام SQL

source: SQL expression
ar: تعبير SQL

source: SQL query
ar: استعلام SQL

source: SSH Host
ar: مضيف SSH

source: SSH Password
ar: كلمة مرور SSH

source: SSH Port
ar: منفذ إس إس إتش

source: SSH Tunnel
ar: نفق إس إس إتش

source: SSH Tunnel configuration parameters
ar: معايير تكوين نفق SSH

source: SSH Tunnel could not be deleted.
ar: لا يمكن حذف نفق SSH.

source: SSH Tunnel could not be updated.
ar: تعذر تحديث نفق SSH.

source: SSH Tunnel not found.
ar: لم يتم العثور على نفق SSH.

source: SSH Tunnel parameters are invalid.
ar: المعلمات الخاصة بنفق SSH غير صالحة.

source: SSH Tunneling is not enabled
ar: لم يتم تمكين نفق SSH

source: SSL Mode "require" will be used.
ar: سيتم استخدام وضع SSL «مطلوب».

source: START (INCLUSIVE)
ar: البداية (شاملة)

source: STEP %(stepCurr)s OF %(stepLast)s
ar: خطوة %(stepCurr)s من %(stepLast)s

source: STRING
ar: سلسلة

source: SUN
ar: الشمس

source: Sample Standard Deviation
ar: نموذج الانحراف المعياري

source: Sample Variance
ar: تباين العينة

source: Samples
ar: عينات

source: Samples for dataset could not be retrieved.
ar: لا يمكن استرداد عينات مجموعة البيانات.

source: Samples for datasource could not be retrieved.
ar: لا يمكن استرداد عينات لمصدر البيانات.

source: Sankey
ar: سانكي

source: Sankey Diagram
ar: مخطط سانكي

source: Sankey Diagram with Loops
ar: مخطط سانكي مع الحلقات

source: Satellite
ar: القمر الصناعي

source: Satellite Streets
ar: ستلايت ستريتس

source: Saturday
ar: يوم السبت

source: Save
ar: وفر

source: Save & Explore
ar: احفظ واستكشف

source: Save & go to dashboard
ar: احفظ وانتقل إلى لوحة التحكم

source: Save (Overwrite)
ar: حفظ (استبدال)

source: Save as
ar: حفظ باسم

source: Save as...
ar: حفظ باسم...

source: Save as:
ar: حفظ باسم:

source: Save as Dataset
ar: حفظ كمجموعة بيانات

source: Save as dataset
ar: حفظ كمجموعة بيانات

source: Save as new
ar: احفظ كجديد

source: Save changes
ar: حفظ التغييرات

source: Save chart
ar: حفظ المخطط

source: Save dashboard
ar: احفظ لوحة التحكم

source: Save dataset
ar: حفظ مجموعة البيانات

source: Save for this session
ar: احفظ لهذه الجلسة

source: Save or Overwrite Dataset
ar: حفظ مجموعة البيانات أو الكتابة فوقها

source: Save query
ar: حفظ الاستعلام

source: Save the query to enable this feature
ar: احفظ الاستعلام لتمكين هذه الميزة

source: Save this query as a virtual dataset to continue exploring
ar: احفظ هذا الاستعلام كمجموعة بيانات افتراضية لمتابعة الاستكشاف

source: Saved
ar: أنقذ

source: Saved Queries
ar: الاستعلامات المحفوظة

source: Saved expressions
ar: التعبيرات المحفوظة

source: Saved metric
ar: المقياس المحفوظ

source: Saved queries
ar: الاستعلامات المحفوظة

source: Saved queries could not be deleted.
ar: لا يمكن حذف الاستعلامات المحفوظة.

source: Saved query not found.
ar: لم يتم العثور على الاستعلام المحفوظ.

source: Saved query parameters are invalid.
ar: معاملات الاستعلام المحفوظة غير صالحة.

source: Scale and Move
ar: التحجيم والتحرك

source: Scale only
ar: مقياس فقط

source: Scatter
ar: مبعثر

source: Scatter Plot
ar: مخطط التبعثر

source: Scatter Plot has the horizontal axis in linear units, and the points are connected in order. It shows a statistical relationship between two variables.
ar: يحتوي Scatter Plot على المحور الأفقي بوحدات خطية، ويتم توصيل النقاط بالترتيب. يُظهر علاقة إحصائية بين متغيرين.

source: Schedule
ar: جدول

source: Schedule a new email report
ar: جدولة تقرير بريد إلكتروني جديد

source: Schedule email report
ar: جدولة تقرير البريد الإلكتروني

source: Schedule query
ar: استعلام الجدول

source: Schedule settings
ar: إعدادات الجدول

source: Schedule the query periodically
ar: جدولة الاستعلام بشكل دوري

source: Scheduled
ar: مجدولة

source: Scheduled at (UTC)
ar: تمت جدولتها في (UTC)

source: Scheduled task executor not found
ar: لم يتم العثور على منفذ المهام المجدولة

source: Schema
ar: مخطط

source: Schema, as used only in some databases like Postgres, Redshift and DB2
ar: المخطط، كما هو مستخدم فقط في بعض قواعد البيانات مثل Postgres و Redshift و DB2

source: Schema cache timeout
ar: مهلة ذاكرة التخزين المؤقت للمخطط

source: Schemas allowed for File upload
ar: المخططات المسموح بها لتحميل الملفات

source: Scope
ar: نطاق

source: Scoping
ar: تحديد النطاق

source: Screenshot width
ar: عرض لقطة الشاشة

source: Screenshot width must be between %(min)spx and %(max)spx
ar: يجب أن يكون عرض لقطة الشاشة بين %(min)spx و %(max)spx

source: Scroll
ar: قم بالتمرير

source: Scroll down to the bottom to enable overwriting changes.
ar: انتقل إلى الأسفل لتمكين تغييرات الكتابة الفوقية.

source: Search
ar: ابحث

source: Search...
ar: ابحث...

source: Search / Filter
ar: البحث\ التصفية

source: Search Metrics & Columns
ar: مقاييس البحث والأعمدة

source: Search all charts
ar: ابحث في جميع الرسوم البيانية

source: Search box
ar: مربع البحث

source: Search by query text
ar: البحث عن طريق نص الاستعلام

source: Search columns
ar: أعمدة البحث

source: Search in filters
ar: البحث في الفلاتر

source: Second
ar: ثانيا

source: Secondary
ar: ثانوي

source: Secondary Metric
ar: المقياس الثانوي

source: Secondary currency format
ar: تنسيق العملة الثانوية

source: Secondary y-axis Bounds
ar: حدود المحور الصادي الثانوي

source: Secondary y-axis format
ar: تنسيق المحور الصادي الثانوي

source: Secondary y-axis title
ar: عنوان المحور y الثانوي

source: Seconds %s
ar: ثواني %s

source: Secure Extra
ar: سيكيور إكسترا

source: Secure extra
ar: سيكيور إكسترا

source: Security
ar: الأمان

source: See all %(tableName)s
ar: شاهد الكل %(tableName)s

source: See less
ar: شاهد أقل

source: See more
ar: الاطلاع على المزيد

source: See query details
ar: راجع تفاصيل الاستعلام

source: See table schema
ar: راجع مخطط الجدول

source: Select
ar: اختار

source: Select Delivery Method
ar: حدد طريقة التسليم

source: Select Tags
ar: حدد العلامات

source: Select Viz Type
ar: حدد نوع الفيز

source: Select ...
ar: حدد...

source: Select a Columnar file to be uploaded to a database.
ar: حدد ملف عمودي ليتم تحميله إلى قاعدة بيانات.

source: Select a Excel file to be uploaded to a database.
ar: حدد ملف Excel ليتم تحميله إلى قاعدة بيانات.

source: Select a column
ar: حدد عمودًا

source: Select a dashboard
ar: حدد لوحة معلومات

source: Select a database table.
ar: حدد جدول قاعدة بيانات.

source: Select a database table and create dataset
ar: حدد جدول قاعدة البيانات وأنشئ مجموعة بيانات

source: Select a database to connect
ar: حدد قاعدة بيانات للاتصال

source: Select a database to upload the file to
ar: حدد قاعدة بيانات لتحميل الملف إليها

source: Select a database to write a query
ar: حدد قاعدة بيانات لكتابة استعلام

source: Select a dataset
ar: حدد مجموعة بيانات

source: Select a dimension
ar: حدد البعد

source: Select a file to be uploaded to the database
ar: حدد ملفًا ليتم تحميله إلى قاعدة البيانات

source: Select a metric to display. You can use an aggregation function on a column or write custom SQL to create a metric.
ar: حدد مقياسًا لعرضه. يمكنك استخدام وظيفة التجميع على عمود أو كتابة SQL مخصص لإنشاء مقياس.

source: Select a metric to display on the right axis
ar: حدد مقياسًا لعرضه على المحور الأيمن

source: Select a schema if the database supports this
ar: حدد مخططًا إذا كانت قاعدة البيانات تدعم ذلك

source: Select a time grain for the visualization. The grain is the time interval represented by a single point on the chart.
ar: حدد حبة زمنية للتصور. الحبوب هي الفاصل الزمني الذي تمثله نقطة واحدة على الرسم البياني.

source: Select a visualization type
ar: حدد نوع التصور

source: Select aggregate options
ar: حدد خيارات التجميع

source: Select all data
ar: حدد جميع البيانات

source: Select all items
ar: تحديد كلّ العناصر

source: Select any columns for metadata inspection
ar: حدد أي أعمدة لفحص البيانات الوصفية

source: Select chart
ar: حدد الرسم البياني

source: Select charts
ar: حدد الرسوم البيانية

source: Select color scheme
ar: حدد نظام الألوان

source: Select column
ar: حدد العمود

source: Select current page
ar: حدد الصفحة الحالية

source: Select dashboards
ar: حدد لوحات المعلومات

source: Select database or type to search databases
ar: حدد قاعدة البيانات أو اكتب للبحث في قواعد البيانات

source: Select databases require additional fields to be completed in the Advanced tab to successfully connect the database. Learn what requirements your databases has
ar: تتطلب قواعد البيانات المحددة إكمال حقول إضافية في علامة التبويب «خيارات متقدمة» لتوصيل قاعدة البيانات بنجاح. تعرف على متطلبات قواعد البيانات الخاصة بك

source: Select dataset source
ar: حدد مصدر مجموعة البيانات

source: Select file
ar: حدد ملف

source: Select filter
ar: حدد عامل التصفية

source: Select filter plugin using AntD
ar: حدد المكون الإضافي للفلتر باستخدام AntD

source: Select first filter value by default
ar: حدد قيمة التصفية الأولى افتراضيًا

source: Select one or many metrics to display, that will be displayed in the percentages of total. Percentage metrics will be calculated only from data within the row limit. You can use an aggregation function on a column or write custom SQL to create a percentage metric.
ar: حدد مقياسًا واحدًا أو عدة مقاييس لعرضها، وسيتم عرضها بالنسب المئوية للإجمالي. سيتم حساب مقاييس النسبة المئوية فقط من البيانات الموجودة ضمن حد الصف. يمكنك استخدام وظيفة التجميع على عمود أو كتابة SQL مخصص لإنشاء مقياس النسبة المئوية.

source: Select one or many metrics to display. You can use an aggregation function on a column or write custom SQL to create a metric.
ar: حدد مقياسًا واحدًا أو عدة مقاييس لعرضها. يمكنك استخدام وظيفة التجميع على عمود أو كتابة SQL مخصص لإنشاء مقياس.

source: Select operator
ar: حدد المشغل

source: Select or type a value
ar: حدد قيمة أو اكتبها

source: Select or type currency symbol
ar: حدد رمز العملة أو اكتبه

source: Select or type dataset name
ar: حدد اسم مجموعة البيانات أو اكتبه

source: Select owners
ar: حدد المالكين

source: Select saved metrics
ar: حدد المقاييس المحفوظة

source: Select saved queries
ar: حدد الاستعلامات المحفوظة

source: Select schema or type to search schemas
ar: حدد المخطط أو اكتب للبحث في المخططات

source: Select scheme
ar: حدد المخطط

source: Select subject
ar: حدد الموضوع

source: Select table or type to search tables
ar: حدد الجدول أو اكتب للبحث في الجداول

source: Select the Annotation Layer you would like to use.
ar: حدد طبقة التعليقات التوضيحية التي ترغب في استخدامها.
