Repository: rajpal-1/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Whether to show extra controls or not. Extra controls include things like making mulitBar charts stacked or side by side.
ar: سواء لإظهار عناصر تحكم إضافية أم لا. تتضمن عناصر التحكم الإضافية أشياء مثل إنشاء مخططات MultiBar مكدسة أو جنبًا إلى جنب.

source: Whether to show minor ticks on the axis
ar: ما إذا كان سيتم إظهار علامات طفيفة على المحور

source: Whether to show the pointer
ar: ما إذا كان سيتم عرض المؤشر

source: Whether to show the progress of gauge chart
ar: ما إذا كان سيتم إظهار تقدم مخطط القياس

source: Whether to show the split lines on the axis
ar: ما إذا كان سيتم عرض الخطوط المنقسمة على المحور

source: Whether to sort ascending or descending on the base Axis.
ar: ما إذا كان سيتم الفرز تصاعديًا أو تنازليًا على المحور الأساسي.

source: Whether to sort descending or ascending
ar: ما إذا كنت تريد الفرز تنازليًا أو تصاعديًا

source: Whether to sort descending or ascending if a series limit is present
ar: ما إذا كان سيتم الفرز تنازليًا أو تصاعديًا في حالة وجود حد للسلسلة

source: Whether to sort results by the selected metric in descending order.
ar: ما إذا كان سيتم فرز النتائج حسب المقياس المحدد بترتيب تنازلي.

source: Whether to sort tooltip by the selected metric in descending order.
ar: ما إذا كان سيتم فرز تلميح الأدوات حسب المقياس المحدد بترتيب تنازلي.

source: Whether to truncate metrics
ar: ما إذا كان سيتم اقتطاع المقاييس

source: Which country to plot the map for?
ar: ما هي الدولة التي سيتم رسم الخريطة لها؟

source: Which relatives to highlight on hover
ar: أي أقارب يجب تسليط الضوء عليهم عند التحليق

source: Whisker/outlier options
ar: خيارات الشارب/الشارب

source: White
ar: أبيض

source: Width
ar: عرض

source: Width of the confidence interval. Should be between 0 and 1
ar: عرض فاصل الثقة. يجب أن يكون بين 0 و 1

source: Width of the sparkline
ar: عرض خط الشرارة

source: Window must be > 0
ar: يجب أن تكون النافذة > 0

source: With a subheader
ar: مع عنوان فرعي

source: Word Cloud
ar: وورد كلاود

source: Word Rotation
ar: تدوير الكلمات

source: Working
ar: يعمل

source: Working timeout
ar: مهلة العمل

source: World Map
ar: خريطة العالم

source: Write a description for your query
ar: اكتب وصفًا لاستعلامك

source: Write a handlebars template to render the data
ar: اكتب قالب المقاود لعرض البيانات

source: Write dataframe index as a column
ar: اكتب فهرس إطار البيانات كعمود

source: Write dataframe index as a column.
ar: اكتب فهرس إطار البيانات كعمود.

source: X-Axis Sort Ascending
ar: فرز المحور السيني تصاعديًا

source: X-Axis Sort By
ar: فرز المحور السيني حسب

source: X-axis
ar: المحور السيني

source: XScale Interval
ar: الفاصل الزمني للمقياس

source: X AXIS TITLE BOTTOM MARGIN
ar: عنوان المحور X (الهامش السفلي)

source: X AXIS TITLE MARGIN
ar: هامش عنوان المحور X

source: X Axis
ar: المحور X

source: X Axis Bounds
ar: حدود المحور X

source: X Axis Format
ar: تنسيق المحور X

source: X Axis Label
ar: ملصق المحور X

source: X Axis Title
ar: عنوان المحور X

source: X Log Scale
ar: مقياس اكس لوغ

source: X Tick Layout
ar: تخطيط علامة X

source: X bounds
ar: حدود إكس

source: Y-Axis Sort Ascending
ar: فرز المحور Y تصاعديًا

source: Y-Axis Sort By
ar: فرز المحور Y حسب

source: Y-axis
ar: المحور الصادي

source: Y-axis bounds
ar: حدود المحور Y

source: YScale Interval
ar: الفاصل الزمني للقياس

source: Y 2 bounds
ar: حدود Y 2

source: Y AXIS TITLE MARGIN
ar: هامش عنوان المحور Y

source: Y Axis
ar: المحور Y

source: Y Axis 2 Bounds
ar: حدود المحور Y 2

source: Y Axis Bounds
ar: حدود المحور Y

source: Y Axis Format
ar: تنسيق المحور Y

source: Y Axis Label
ar: ملصق المحور Y

source: Y Axis Title
ar: عنوان المحور Y

source: Y Axis Title Margin
ar: هامش عنوان المحور Y

source: Y Axis Title Position
ar: موضع عنوان المحور Y

source: Y Log Scale
ar: مقياس Y الطويل

source: Y bounds
ar: حدود Y

source: Year
ar: عام

source: Year (freq=AS)
ar: السنة (التردد = AS)

source: Yearly seasonality
ar: موسمية سنوية

source: Years %s
ar: سنوات %s

source: Yes, cancel
ar: نعم، قم بالإلغاء

source: Yes, overwrite changes
ar: نعم، استبدل التغييرات

source: You've changed datasets. Any controls with data (columns, metrics) that match this new dataset have been retained.
ar: لقد قمت بتغيير مجموعات البيانات. تم الاحتفاظ بأي عناصر تحكم تحتوي على بيانات (أعمدة ومقاييس) تطابق مجموعة البيانات الجديدة هذه.

source: You are adding tags to %s %ss
ar: أنت تضيف علامات إلى %s %ss

source: You are importing one or more charts that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
ar: تقوم باستيراد مخطط واحد أو أكثر موجود بالفعل. قد تؤدي الكتابة الاستعلائية إلى فقدان بعض أعمالك. هل تريد بالتأكيد الكتابة فوقها؟

source: You are importing one or more dashboards that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
ar: تقوم باستيراد لوحة معلومات واحدة أو أكثر موجودة بالفعل. قد تؤدي الكتابة الاستعلائية إلى فقدان بعض أعمالك. هل تريد بالتأكيد الكتابة فوقها؟

source: You are importing one or more databases that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
ar: تقوم باستيراد قاعدة بيانات واحدة أو أكثر موجودة بالفعل. قد تؤدي الكتابة الاستعلائية إلى فقدان بعض أعمالك. هل تريد بالتأكيد الكتابة فوقها؟

source: You are importing one or more datasets that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
ar: تقوم باستيراد مجموعة بيانات واحدة أو أكثر موجودة بالفعل. قد تؤدي الكتابة الاستعلائية إلى فقدان بعض أعمالك. هل تريد بالتأكيد الكتابة فوقها؟

source: You are importing one or more saved queries that already exist. Overwriting might cause you to lose some of your work. Are you sure you want to overwrite?
ar: تقوم باستيراد واحد أو أكثر من الاستعلامات المحفوظة الموجودة بالفعل. قد تؤدي الكتابة الاستعلائية إلى فقدان بعض أعمالك. هل تريد بالتأكيد الكتابة فوقها؟

source: You can
ar: يمكنك

source: You can't apply cross-filter on this data point.
ar: لا يمكنك تطبيق التصفية المتقاطعة على نقطة البيانات هذه.

source: You can add the components in the
ar: يمكنك إضافة المكونات في

source: You can add the components in the edit mode.
ar: يمكنك إضافة المكونات في وضع التحرير.

source: You can also just click on the chart to apply cross-filter.
ar: يمكنك أيضًا النقر فوق الرسم البياني لتطبيق التصفية المتقاطعة.

source: You can choose to display all charts that you have access to or only the ones you own. Your filter selection will be saved and remain active until you choose to change it.
ar: يمكنك اختيار عرض جميع المخططات التي يمكنك الوصول إليها أو تلك التي تمتلكها فقط. سيتم حفظ اختيار الفلتر الخاص بك وسيظل نشطًا حتى تختار تغييره.

source: You can create a new chart or use existing ones from the panel on the right
ar: يمكنك إنشاء مخطط جديد أو استخدام المخططات الموجودة من اللوحة الموجودة على اليمين.

source: You can preview the list of dashboards in the chart settings dropdown.
ar: يمكنك معاينة قائمة لوحات المعلومات في القائمة المنسدلة لإعدادات المخطط.

source: You cannot delete the last temporal filter as it's used for time range filters in dashboards.
ar: لا يمكنك حذف عامل التصفية الزمني الأخير لأنه يُستخدم لفلاتر النطاق الزمني في لوحات المعلومات.

source: You cannot use 45° tick layout along with the time range filter
ar: لا يمكنك استخدام تخطيط علامة 45 درجة مع مرشح النطاق الزمني

source: You do not have permission to edit this %s
ar: ليس لديك إذن لتحرير هذا %s

source: You do not have permission to edit this chart
ar: ليس لديك إذن لتحرير هذا المخطط

source: You do not have permission to edit this dashboard
ar: ليس لديك إذن لتحرير لوحة التحكم هذه

source: You do not have permission to read tags
ar: ليس لديك إذن لقراءة العلامات

source: You do not have permissions to edit this dashboard.
ar: ليس لديك أذونات لتحرير لوحة المعلومات هذه.

source: You do not have sufficient permissions to edit the chart
ar: ليس لديك الأذونات الكافية لتحرير المخطط

source: You don't have access to this chart.
ar: لا يمكنك الوصول إلى هذا المخطط.

source: You don't have access to this dashboard.
ar: ليس لديك حق الوصول إلى لوحة التحكم هذه.

source: You don't have access to this dataset.
ar: لا يمكنك الوصول إلى مجموعة البيانات هذه.

source: You don't have access to this embedded dashboard config.
ar: لا يمكنك الوصول إلى تكوين لوحة المعلومات المضمنة هذا.

source: You don't have any favorites yet!
ar: ليس لديك أي مفضلات حتى الآن!

source: You don't have permission to modify the value.
ar: ليس لديك إذن لتعديل القيمة.

source: You don't have the rights to alter %(resource)s
ar: ليس لديك الحق في التغيير %(resource)s

source: You don't have the rights to alter this chart
ar: ليس لديك الحق في تغيير هذا المخطط

source: You don't have the rights to alter this dashboard
ar: ليس لديك الحق في تغيير لوحة التحكم هذه

source: You don't have the rights to alter this title.
ar: ليس لديك الحق في تغيير هذا العنوان.

source: You don't have the rights to create a chart
ar: ليس لديك حقوق إنشاء مخطط

source: You don't have the rights to create a dashboard
ar: ليس لديك حقوق إنشاء لوحة معلومات

source: You don't have the rights to download as csv
ar: ليس لديك حقوق التنزيل كملف csv

source: You have removed this filter.
ar: لقد قمت بإزالة هذا الفلتر.

source: You have unsaved changes.
ar: لديك تغييرات غير محفوظة.

source: You have used all %(historyLength)s undo slots and will not be able to fully undo subsequent actions. You may save your current state to reset the history.
ar: لقد استخدمت جميع فتحات %(historyLength)s التراجع ولن تتمكن من التراجع تمامًا عن الإجراءات اللاحقة. يمكنك حفظ حالتك الحالية لإعادة تعيين السجل.

source: You must be a dataset owner in order to edit. Please reach out to a dataset owner to request modifications or edit access.
ar: يجب أن تكون مالك مجموعة البيانات حتى تتمكن من التحرير. يرجى التواصل مع مالك مجموعة البيانات لطلب التعديلات أو تحرير الوصول.

source: You must pick a name for the new dashboard
ar: يجب عليك اختيار اسم للوحة التحكم الجديدة

source: You must run the query successfully first
ar: يجب تشغيل الاستعلام بنجاح أولاً

source: You need to configure HTML sanitization to use CSS
ar: تحتاج إلى تكوين تعقيم HTML لاستخدام CSS

source: You updated the values in the control panel, but the chart was not updated automatically. Run the query by clicking on the "Update chart" button or
ar: لقد قمت بتحديث القيم في لوحة التحكم، ولكن لم يتم تحديث المخطط تلقائيًا. قم بتشغيل الاستعلام بالنقر فوق الزر «تحديث المخطط» أو

source: Your chart is not up to date
ar: الرسم البياني الخاص بك ليس محدثًا

source: Your chart is ready to go!
ar: الرسم البياني الخاص بك جاهز للعمل!

source: Your dashboard is too large. Please reduce its size before saving it.
ar: لوحة التحكم الخاصة بك كبيرة جدًا. يرجى تقليل حجمها قبل حفظها.

source: Your query could not be saved
ar: لا يمكن حفظ الاستعلام

source: Your query could not be scheduled
ar: لا يمكن جدولة الاستعلام

source: Your query could not be updated
ar: لا يمكن تحديث الاستعلام الخاص بك

source: Your query has been scheduled. To see details of your query, navigate to Saved queries
ar: تمت جدولة الاستعلام الخاص بك. للاطلاع على تفاصيل الاستعلام الخاص بك، انتقل إلى الاستعلامات المحفوظة

source: Your query was not properly saved
ar: لم يتم حفظ الاستعلام الخاص بك بشكل صحيح

source: Your query was saved
ar: تم حفظ الاستعلام الخاص بك

source: Your query was updated
ar: تم تحديث الاستعلام الخاص بك

source: Your report could not be deleted
ar: لا يمكن حذف التقرير

source: Zero imputation
ar: الإسناد الصفري

source: Zoom
ar: تكبير

source: Zoom level of the map
ar: مستوى التكبير/التصغير للخريطة

source: [Longitude] and [Latitude] columns must be present in [Group By]
ar: يجب أن تكون أعمدة [خط الطول] و [خط العرض] موجودة في [المجموعة حسب]

source: [Longitude] and [Latitude] must be set
ar: يجب تعيين [خط الطول] و [خط العرض]

source: [Missing Dataset]
ar: [مجموعة بيانات مفقودة]

source: [Untitled]
ar: [بدون عنوان]

source: [ untitled dashboard ]
ar: [لوحة تحكم بدون عنوان]

source: [dashboard name]
ar: [اسم لوحة التحكم]

source: [desc]
ar: [وصف]

source: [optional] this secondary metric is used to define the color as a ratio against the primary metric. When omitted, the color is categorical and based on labels
ar: [اختياري] يتم استخدام هذا المقياس الثانوي لتعريف اللون كنسبة مقابل المقياس الأساسي. عند الحذف، يكون اللون قاطعًا ويستند إلى الملصقات

source: [untitled]
ar: [بدون عنوان]

source: (Removed)
ar: (تمت إزالته)

source: (deleted or invalid type)
ar: (نوع محذوف أو غير صالح)

source: (no description, click to see stack trace)
ar: (بدون وصف، انقر لرؤية تتبع المكدس)

source: ), and they become available in your SQL (example:
ar: )، وتصبح متوفرة في SQL الخاص بك (على سبيل المثال:

source: Set the opacity to 0 if you do not want to override the color specified in the GeoJSON
ar: قم بتعيين العتامة إلى 0 إذا كنت لا تريد تجاوز اللون المحدد في GeoJSON

source: (excluded)
ar: (مستبعد)

source: a dashboard OR
ar: لوحة معلومات أو

source: a new one
ar: واحدة جديدة

source: expression which needs to adhere to the
ar: التعبير الذي يحتاج إلى الالتزام بـ

source: source code of Superset's sandboxed parser
ar: الكود المصدري لمحلل الحماية الخاص بـ Superset

source: standard to ensure that the lexicographical ordering coincides with the chronological ordering. If the timestamp format does not adhere to the ISO 8601 standard you will need to define an expression and type for transforming the string into a date or timestamp. Note currently time zones are not supported. If time is stored in epoch format, put `epoch_s` or `epoch_ms`. If no pattern is specified we fall back to using the optional defaults on a per database/column name level via the extra parameter.
ar: معيار لضمان الترتيب المعجمي يتزامن مع الترتيب الزمني. إذا كان لا يلتزم تنسيق الطابع الزمني بمعيار ISO 8601 ستحتاج إلى تحديد تعبير وكتابة لـ تحويل السلسلة إلى تاريخ أو طابع زمني. ملاحظة لا يتم دعم المناطق الزمنية حاليًا. إذا تم تخزين الوقت في شكل حقبة، ضع `epoch_s` أو `epoch_ms`. إذا لم يكن هناك نمط تم تحديد أننا نعود إلى استخدام الإعدادات الافتراضية الاختيارية على per مستوى اسم قاعدة البيانات/العمود عبر المعلمة الإضافية.

source: to add calculated columns
ar: لإضافة أعمدة محسوبة

source: to add metrics
ar: لإضافة مقاييس

source: to edit or add columns and metrics.
ar: لتعديل الأعمدة والمقاييس أو إضافتها.

source: to mark a column as a time column
ar: لوضع علامة على عمود كعمود زمني

source: to open SQL Lab. From there you can save the query as a dataset.
ar: لفتح مختبر SQL. من هناك يمكنك حفظ الاستعلام كمجموعة بيانات.

source: to visualize your data.
ar: لتصور بياناتك.

source: `compare_columns` must have the same length as `source_columns`.
ar: يجب أن يكون لـ `compare_columns` نفس طول `source_columns`.

source: `compare_type` must be `difference`, `percentage` or `ratio`
ar: يجب أن يكون «compare_type» هو «الفرق» أو «النسبة المئوية» أو «النسبة»

source: `confidence_interval` must be between 0 and 1 (exclusive)
ar: يجب أن تكون «فترة الثقة» بين 0 و 1 (حصريًا)

source: `count` is COUNT(*) if a group by is used. Numerical columns will be aggregated with the aggregator. Non-numerical columns will be used to label points. Leave empty to get a count of points in each cluster.
ar: `count` هو COUNT (*) إذا تم استخدام مجموعة بواسطة. سيتم تجميع الأعمدة العددية مع المجمع. سيتم استخدام الأعمدة غير العددية لتسمية النقاط. اتركه فارغًا للحصول على عدد النقاط في كل مجموعة.

source: `operation` property of post processing object undefined
ar: خاصية «التشغيل» لكائن ما بعد المعالجة غير محددة

source: `prophet` package not installed
ar: لم يتم تثبيت حزمة `prophet`

source: `rename_columns` must have the same length as `columns`.
ar: يجب أن يكون لـ `rename_columns` نفس طول «الأعمدة».

source: `row_limit` must be greater than or equal to 0
ar: يجب أن يكون `row_limit` أكبر من أو يساوي 0

source: `row_offset` must be greater than or equal to 0
ar: يجب أن يكون `row_offset` أكبر من أو يساوي 0

source: `width` must be greater or equal to 0
ar: يجب أن يكون «العرض» أكبر أو يساوي 0

source: aggregate
ar: مجموع

source: alert
ar: تنبيه

source: alert dark
ar: تنبيه مظلم

source: alerts
ar: التنبيهات

source: all
ar: الكل

source: also copy (duplicate) charts
ar: قم أيضًا بنسخ المخططات (المكررة)

source: ancestor
ar: سلف

source: and
ar: و

source: annotation
ar: التعليق التوضيحي

source: annotation_layer
ar: طبقة التعليقات التوضيحية

source: asfreq
ar: اسريق

source: at
ar: في

source: auto
ar: السيارات

source: auto (Smooth)
ar: تلقائي (ناعم)

source: background
ar: خلفية

source: basis
ar: أساس

source: below (example:
ar: أدناه (مثال:

source: between {down} and {up} {name}
ar: بين {down} و {up} {name}

source: bfill
ar: حشو

source: bolt
ar: بولت

source: boolean type icon
ar: رمز النوع المنطقي

source: bottom
ar: الجزء السفلي

source: button (cmd + z) until you save your changes.
ar: زر (cmd + z) حتى تقوم بحفظ التغييرات.

source: by using
ar: باستخدام

source: cannot be empty
ar: لا يمكن أن تكون فارغة

source: cardinal
ar: كاردينال

source: change
ar: التغير

source: chart
ar: مخطط

source: charts
ar: الرسوم البيانية

source: choose WHERE or HAVING...
ar: اختر المكان أو الحصول على...

source: clear all filters
ar: مسح جميع الفلاتر

source: click here
ar: انقر هنا

source: code ISO 3166-1 alpha-2 (cca2)
ar: كود أيزو 3166-1 ألفا-2 (cca2)

source: code ISO 3166-1 alpha-3 (cca3)
ar: كود أيزو 3166-1 ألفا-3 (cca3)

source: code International Olympic Committee (cioc)
ar: كود اللجنة الأولمبية الدولية (CIOC)

source: column
ar: عمود

source: connecting to %(dbModelName)s.
ar: الاتصال بـ%(dbModelName)s.

source: count
ar: العد

source: create
ar: انشاء

source: create a new chart
ar: إنشاء مخطط جديد

source: create dataset from SQL query
ar: إنشاء مجموعة بيانات من استعلام SQL

source: css_template
ar: قالب css

source: cumsum
ar: كمس

source: cumulative
ar: التراكمي

source: dashboard
ar: لوحة المعلومات

source: dashboards
ar: لوحات المعلومات

source: database
ar: قاعدة البيانات

source: dataset
ar: مجموعة البيانات

source: dataset name
ar: اسم مجموعة البيانات

source: date
ar: تاريخ

source: day
ar: اليوم

source: day of the month
ar: يوم من الشهر

source: day of the week
ar: يوم من الأسبوع

source: deckGL
ar: سطح السفينة

source: deck.gl 3D Hexagon
ar: deck.gl سداسي الأبعاد

source: deck.gl Arc
ar: قوس deck.gl

source: deck.gl Contour
ar: ديك.gl كونتور

source: deck.gl Geojson
ar: deck.gl جيونسون

source: deck.gl Grid
ar: شبكة deck.gl

source: deck.gl Heatmap
ar: خريطة الحرارة deck.gl

source: deck.gl Multiple Layers
ar: deck.gl طبقات متعددة

source: deck.gl Path
ar: مسار deck.gl

source: deck.gl Polygon
ar: المضلع deck.gl

source: deck.gl Scatterplot
ar: deck.gl سكاتربلوت

source: deck.gl Screen Grid
ar: شبكة شاشة deck.gl

source: deck.gl charts
ar: الرسوم البيانية deck.gl

source: default
ar: إفتراضي

source: delete
ar: حذف

source: descendant
ar: سليل

source: description
ar: وصف

source: deviation
ar: إنحراف

source: draft
ar: مسودة

source: dttm
ar: dtm

source: e.g., a "user id" column
ar: على سبيل المثال، عمود «معرف المستخدم»

source: e.g. ********
ar: على سبيل المثال ********

source: e.g. 127.0.0.1
ar: على سبيل المثال 127.0.0.1

source: e.g. 5432
ar: على سبيل المثال 5432

source: e.g. AccountAdmin
ar: على سبيل المثال مسؤول الحساب

source: e.g. Analytics
ar: على سبيل المثال التحليلات

source: e.g. compute_wh
ar: على سبيل المثال compute_wh

source: e.g. sql/protocolv1/o/12345
ar: مثلاً sql/protocolv1/o/12345

source: e.g. world_population
ar: على سبيل المثال world_population

source: e.g. xy12345.us-east-2.aws
ar: على سبيل المثال xy12345.us-east-2.aws

source: edit mode
ar: وضع التحرير

source: entries
ar: إدخالات

source: error
ar: خطأ

source: error dark
ar: خطأ مظلم

source: error_message
ar: رسالة خطأ

source: every
ar: كل

source: every day of the month
ar: كل يوم من الشهر

source: every day of the week
ar: كل يوم من أيام الأسبوع

source: every hour
ar: كل ساعة

source: every minute
ar: كل دقيقة

source: every month
ar: كل شهر

source: expand
ar: قم بالتوسع

source: explore
ar: اكتشف

source: failed
ar: فشلت

source: fetching
ar: جلب

source: ffill
ar: ردم

source: flat
ar: مسطحة

source: for more information on how to structure your URI.
ar: لمزيد من المعلومات حول كيفية هيكلة URI الخاص بك.

source: function type icon
ar: رمز نوع الوظيفة

source: geohash (square)
ar: جيوهاش (مربع)

source: heatmap
ar: خريطة الحرارة

source: heatmap: values are normalized across the entire heatmap
ar: خريطة الحرارة: يتم تطبيع القيم عبر خريطة الحرارة بأكملها

source: here
ar: هنا

source: hour
ar: ساعة

source: image-rendering CSS attribute of the canvas object that defines how the browser scales up the image
ar: سمة CSS لعرض الصور لكائن اللوحة القماشية التي تحدد كيفية قيام المتصفح بتوسيع نطاق الصورة

source: in
ar: في

source: is expected to be a Mapbox URL
ar: من المتوقع أن يكون عنوان URL الخاص بـ Mapbox

source: is expected to be a number
ar: من المتوقع أن يكون رقمًا

source: is expected to be an integer
ar: من المتوقع أن يكون عددًا صحيحًا

source: json isn't valid
ar: جسون غير صالح

source: key a-z
ar: مفتاح من الألف إلى الياء

source: key z-a
ar: مفتاح z-a

source: label
ar: ملصق

source: latest partition:
ar: أحدث قسم:

source: left
ar: اليسار

source: less than {min} {name}
ar: أقل من {min} {name}

source: linear
ar: خطي

source: log
ar: خشبة

source: lower percentile must be greater than 0 and less than 100. Must be lower than upper percentile.
ar: يجب أن تكون النسبة المئوية الأقل أكبر من 0 وأقل من 100. يجب أن تكون أقل من النسبة المئوية العليا.

source: max
ar: الحد الأقصى

source: mean
ar: خسيس

source: median
ar: الوسيط

source: meters
ar: متر

source: metric
ar: متري

source: min
ar: دقيقة

source: minute
ar: دقيقة

source: minute(s)
ar: دقيقة (دقائق)

source: monotone
ar: رتيبة

source: month
ar: الشهر

source: more than {max} {name}
ar: أكثر من {max} {name}

source: must have a value
ar: يجب أن يكون لها قيمة

source: name
ar: اسم

source: no SQL validator is configured
ar: لم يتم تكوين مدقق SQL

source: no SQL validator is configured for %(engine_spec)s
ar: لم يتم تكوين مدقق SQL لـ %(engine_spec)s

source: numeric type icon
ar: رمز النوع الرقمي

source: offline
ar: غير متصل على الانترنت

source: or
ar: أو

source: or use existing ones from the panel on the right
ar: أو استخدم تلك الموجودة من اللوحة على اليمين

source: orderby column must be populated
ar: يجب ملء الترتيب حسب العمود

source: overall
ar: بشكل عام

source: p-value precision
ar: دقة القيمة الاحتمالية

source: p95
ar: ص 95

source: p99
ar: ص 99

source: page_size.all
ar: حجم_الصفحة.الكل

source: page_size.entries
ar: إدخالات حجم الصفحة

source: page_size.show
ar: حجم الصفحة. العرض

source: pending
ar: المعلقه

source: percentile (exclusive)
ar: المئوي (حصري)

source: percentiles must be a list or tuple with two numeric values, of which the first is lower than the second value
ar: يجب أن تكون النسب المئوية عبارة عن قائمة أو مجموعة تحتوي على قيمتين رقميتين، الأولى أقل من القيمة الثانية

source: permalink state not found
ar: لم يتم العثور على حالة الرابط الثابت

source: pixelated (Sharp)
ar: منقط (حاد)

source: pixels
ar: بكسل

source: previous calendar month
ar: الشهر التقويمي السابق

source: previous calendar week
ar: الأسبوع التقويمي السابق

source: previous calendar year
ar: السنة التقويمية السابقة

source: published
ar: منشورة

source: quarter
ar: الربع

source: queries
ar: الاستعلامات

source: query
ar: استعلام

source: random
ar: عشوائي

source: reboot
ar: اعادة التشغيل

source: recent
ar: حديث

source: recents
ar: الأخيرة

source: report
ar: أبلغ عن

source: reports
ar: تقارير

source: restore zoom
ar: استعادة الزوم

source: right
ar: صحيح

source: rowlevelsecurity
ar: الأمان على مستوى الصف

source: running
ar: قيد التشغيل

source: saved queries
ar: الاستعلامات المحفوظة

source: seconds
ar: ثواني

source: series
ar: سلسلة
