Repository: rajpal-1/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Chart not found
ar: لم يتم العثور على الرسم البياني

source: Chart options
ar: خيارات الرسم البياني

source: Chart owners
ar: مالكو المخططات

source: Chart parameters are invalid.
ar: معلمات الرسم البياني غير صالحة.

source: Chart properties updated
ar: تم تحديث خصائص المخطط

source: Chart title
ar: عنوان الرسم البياني

source: Chart type requires a dataset
ar: يتطلب نوع المخطط مجموعة بيانات

source: Chart width
ar: عرض المخطط

source: Charts
ar: المخططات

source: Charts could not be deleted.
ar: تعذر حذف المخططات.

source: Check for sorting ascending
ar: تحقق من الفرز تصاعديا

source: Check if the Rose Chart should use segment area instead of segment radius for proportioning
ar: تحقق مما إذا كان يجب أن يستخدم مخطط الورد مساحة المقطع بدلا من نصف قطر المقطع للتناسب

source: Check out this chart:
ar: تحقق من هذا الرسم البياني:

source: Check out this chart in dashboard:
ar: تحقق من هذا المخطط في لوحة القيادة:

source: Check out this dashboard:
ar: تحقق من لوحة القيادة هذه:

source: Check to force date partitions to have the same height
ar: تحقق لفرض أقسام التاريخ ليكون لها نفس الارتفاع

source: Child label position
ar: موضع تسمية الطفل

source: Choice of [Label] must be present in [Group By]
ar: يجب أن يكون اختيار [التسمية] موجودا في [تجميع حسب]

source: Choice of [Point Radius] must be present in [Group By]
ar: يجب أن يكون اختيار [نصف قطر النقطة] موجودا في [مجموعة حسب]

source: Choose File
ar: اختر ملف

source: Choose a chart or dashboard not both
ar: اختر مخططا أو لوحة معلومات وليس كليهما

source: Choose a database...
ar: اختر قاعدة بيانات...

source: Choose a dataset
ar: اختيار مجموعة بيانات

source: Choose a metric for right axis
ar: اختر مقياسا للمحور الأيمن

source: Choose a number format
ar: اختر تنسيق أرقام

source: Choose a source
ar: اختر مصدرا

source: Choose a source and a target
ar: اختر مصدرا وهدفا

source: Choose a target
ar: اختر هدفا

source: Choose chart type
ar: اختر نوع المخطط

source: Choose one of the available databases from the panel on the left.
ar: اختر إحدى قواعد البيانات المتاحة من اللوحة الموجودة على اليسار.

source: Choose one of the available databases on the left panel.
ar: اختر إحدى قواعد البيانات المتاحة من اللوحة الموجودة على اليسار.

source: Choose the annotation layer type
ar: اختر نوع طبقة التعليقات التوضيحية

source: Choose the format for legend values
ar: اختيار تنسيق قيم وسيلة الإيضاح

source: Choose the position of the legend
ar: اختر موضع وسيلة الإيضاح

source: Choose the source of your annotations
ar: اختيار مصدر التعليقات التوضيحية

source: Choose whether a country should be shaded by the metric, or assigned a color based on a categorical color palette
ar: اختر ما إذا كان يجب تظليل بلد ما بواسطة المقياس، أو تعيين لون له استنادا إلى لوحة ألوان فئوية

source: Chord Diagram
ar: مخطط الوتر

source: Chosen non-numeric column
ar: عمود غير رقمي مختار

source: Circle
ar: دائرة

source: Circle -> Arrow
ar: دائرة -سهم >

source: Circle -> Circle
ar: دائرة -دائرة >

source: Circle radar shape
ar: شكل رادار دائري

source: Circular
ar: مدور

source: Classic chart that visualizes how metrics change over time.
ar: مخطط كلاسيكي يصور كيفية تغير المقاييس بمرور الوقت.

source: Classic row-by-column spreadsheet like view of a dataset. Use tables to showcase a view into the underlying data or to show aggregated metrics.
ar: جدول بيانات كلاسيكي لكل صف على حدة مثل عرض مجموعة بيانات. استخدم الجداول لعرض طريقة عرض في البيانات الأساسية أو لعرض المقاييس المجمعة.

source: Clause
ar: بند

source: Clear
ar: واضح

source: Clear all
ar: مسح الكل

source: Clear all data
ar: مسح جميع البيانات

source: Clear form
ar: شكل واضح

source: Click on "+Add/Edit Filters" button to create new dashboard filters
ar: انقر فوق الزر "+ إضافة / تحرير عوامل التصفية" لإنشاء عوامل تصفية لوحة معلومات جديدة

source: Click on "Create chart" button in the control panel on the left to preview a visualization or
ar: انقر فوق الزر "إنشاء مخطط" في لوحة التحكم على اليسار لمعاينة تصور أو

source: Click the lock to make changes.
ar: انقر على القفل لإجراء تغييرات.

source: Click the lock to prevent further changes.
ar: انقر فوق القفل لمنع إجراء المزيد من التغييرات.

source: Click this link to switch to an alternate form that allows you to input the SQLAlchemy URL for this database manually.
ar: انقر فوق هذا الارتباط للتبديل إلى نموذج بديل يسمح لك بإدخال عنوان URL ل SQLAlchemy لقاعدة البيانات هذه يدويا.

source: Click this link to switch to an alternate form that exposes only the required fields needed to connect this database.
ar: انقر فوق هذا الارتباط للتبديل إلى نموذج بديل يعرض فقط الحقول المطلوبة المطلوبة لتوصيل قاعدة البيانات هذه.

source: Click to add a contour
ar: انقر لإضافة محيط

source: Click to cancel sorting
ar: انقر لإلغاء الفرز

source: Click to edit
ar: انقر للتعديل

source: Click to edit %s.
ar: انقر لتحرير %s.

source: Click to edit chart.
ar: انقر لتحرير الرسم البياني.

source: Click to edit label
ar: انقر لتعديل التسمية

source: Click to favorite/unfavorite
ar: انقر للمفضلة / غير المفضلة

source: Click to force-refresh
ar: انقر لفرض التحديث

source: Click to see difference
ar: انقر لرؤية الفرق

source: Click to sort ascending
ar: انقر للفرز تصاعديا

source: Click to sort descending
ar: انقر للفرز تنازليا

source: Close
ar: غلق

source: Close all other tabs
ar: إغلاق جميع علامات التبويب الأخرى

source: Close tab
ar: إغلاق علامة التبويب

source: Cluster label aggregator
ar: مجمع تسميات نظام المجموعة

source: Clustering Radius
ar: نصف قطر التجميع

source: Code
ar: رمز

source: Collapse all
ar: طي الكل

source: Collapse data panel
ar: طي لوحة البيانات

source: Collapse row
ar: طي الصف

source: Collapse tab content
ar: طي محتوى علامة التبويب

source: Collapse table preview
ar: طي معاينة الجدول

source: Color
ar: لون

source: Color:
ar: لون:

source: Color +/-
ar: اللون +/-

source: Color Metric
ar: مقياس اللون

source: Color Scheme
ar: نظام الألوان

source: Color Steps
ar: خطوات اللون

source: Color bounds
ar: حدود اللون

source: Color by
ar: اللون حسب

source: Color metric
ar: مقياس اللون

source: Color of the target location
ar: لون الموقع المستهدف

source: Color scheme
ar: نظام الألوان

source: Color will be shaded based the normalized (0% to 100%) value of a given cell against the other cells in the selected range:
ar: سيتم تظليل اللون بناء على القيمة الطبيعية (0٪ إلى 100٪) لخلية معينة مقابل الخلايا الأخرى في النطاق المحدد:

source: Colors
ar: الوان

source: Column
ar: عمود

source: Column "%(column)s" is not numeric or does not exists in the query results.
ar: العمود "%(column)s" غير رقمي أو غير موجود في نتائج الاستعلام.

source: Column Configuration
ar: تكوين العمود

source: Column Data Types
ar: أنواع بيانات الأعمدة

source: Column Formatting
ar: تنسيق العمود

source: Column Label(s)
ar: تسمية (تسميات) الأعمدة

source: Column containing ISO 3166-2 codes of region/province/department in your table.
ar: عمود يحتوي على رموز ISO 3166-2 للمنطقة/المقاطعة/القسم في جدولك.

source: Column containing latitude data
ar: عمود يحتوي على بيانات خط العرض

source: Column containing longitude data
ar: عمود يحتوي على بيانات خط الطول

source: Column datatype
ar: نوع بيانات العمود

source: Column header tooltip
ar: تلميح أداة رأس العمود

source: Column is required
ar: العمود مطلوب

source: Column label for index column(s). If None is given and Dataframe Index is True, Index Names are used.
ar: تسمية العمود لعمود (أعمدة) الفهرس. إذا تم إعطاء لا شيء وكان فهرس إطار البيانات صحيحا، يتم استخدام أسماء الفهرس.

source: Column label for index column(s). If None is given and Dataframe Index is checked, Index Names are used
ar: تسمية العمود لعمود (أعمدة) الفهرس. إذا تم إعطاء لا شيء وتم تحديد فهرس إطار البيانات، يتم استخدام أسماء الفهرس

source: Column name
ar: اسم العمود

source: Column name [%s] is duplicated
ar: اسم العمود [%s] مكرر

source: Column referenced by aggregate is undefined: %(column)s
ar: العمود المشار إليه بالتجميع غير معرف: %(column)s

source: Column select
ar: تحديد العمود

source: Column to use as the row labels of the dataframe. Leave empty if no index column
ar: عمود لاستخدامه كتسميات صف لإطار البيانات. اتركه فارغا إذا لم يكن هناك عمود فهرس

source: Column to use as the row labels of the dataframe. Leave empty if no index column.
ar: عمود لاستخدامه كتسميات صف لإطار البيانات. اتركه فارغا إذا لم يكن هناك عمود فهرس.

source: Columnar File
ar: ملف عمودي

source: Columnar file "%(columnar_filename)s" uploaded to table "%(table_name)s" in database "%(db_name)s"
ar: تم تحميل الملف العمودي "%(columnar_filename)s" إلى الجدول "%(table_name)s" في قاعدة البيانات "%(db_name)s"

source: Columnar to Database configuration
ar: عمودي إلى تكوين قاعدة البيانات

source: Columns
ar: الاعمده

source: Columns To Be Parsed as Dates
ar: الأعمدة المراد تحليلها كتواريخ

source: Columns To Read
ar: أعمدة للقراءة

source: Columns missing in dataset: %(invalid_columns)s
ar: الأعمدة المفقودة في مجموعة البيانات: %(invalid_columns)s

source: Columns missing in datasource: %(invalid_columns)s
ar: الأعمدة مفقودة في مصدر البيانات: %(invalid_columns)s

source: Columns subtotal position
ar: موضع الإجمالي الفرعي للأعمدة

source: Columns to calculate distribution across.
ar: أعمدة لحساب التوزيع عبر.

source: Columns to display
ar: أعمدة لعرضها

source: Columns to group by
ar: أعمدة للتجميع حسب

source: Columns to group by on the columns
ar: أعمدة للتجميع حسب الأعمدة

source: Columns to group by on the rows
ar: أعمدة للتجميع حسب الصفوف

source: Combine metrics
ar: الجمع بين المقاييس

source: Comma-separated color picks for the intervals, e.g. 1,2,4. Integers denote colors from the chosen color scheme and are 1-indexed. Length must be matching that of interval bounds.
ar: اختيارات ألوان مفصولة بفواصل للفواصل الزمنية ، على سبيل المثال 1،2،4. تشير الأعداد الصحيحة إلى الألوان من نظام الألوان المختار وهي مفهرسة 1. يجب أن يكون الطول مطابقا لحدود الفاصل الزمني.

source: Comma-separated interval bounds, e.g. 2,4,5 for intervals 0-2, 2-4 and 4-5. Last number should match the value provided for MAX.
ar: حدود الفاصل الزمني المفصولة بفواصل ، على سبيل المثال 2،4،5 للفترات 0-2 و 2-4 و 4-5. يجب أن يتطابق الرقم الأخير مع القيمة المقدمة ل MAX.

source: Comparator option
ar: خيار المقارنة

source: Compare multiple time series charts (as sparklines) and related metrics quickly.
ar: قارن مخططات السلاسل الزمنية المتعددة (كخطوط مؤشرات) والمقاييس ذات الصلة بسرعة.

source: Compare the same summarized metric across multiple groups.
ar: قارن المقياس الملخص نفسه عبر مجموعات متعددة.

source: Compares how a metric changes over time between different groups. Each group is mapped to a row and change over time is visualized bar lengths and color.
ar: يقارن كيفية تغير المقياس بمرور الوقت بين المجموعات المختلفة. يتم تعيين كل مجموعة إلى صف ويتم تصور التغيير بمرور الوقت لأطوال الأشرطة واللون.

source: Compares metrics from different categories using bars. Bar lengths are used to indicate the magnitude of each value and color is used to differentiate groups.
ar: يقارن المقاييس من فئات مختلفة باستخدام الأشرطة. تستخدم أطوال الأعمدة للإشارة إلى حجم كل قيمة ويتم استخدام اللون للتمييز بين المجموعات.

source: Compares the lengths of time different activities take in a shared timeline view.
ar: يقارن أطوال الوقت الذي تستغرقه الأنشطة المختلفة في طريقة عرض المخطط الزمني المشترك.

source: Comparison
ar: المقارنه

source: Comparison Period Lag
ar: تأخر فترة المقارنة

source: Comparison suffix
ar: لاحقة المقارنة

source: Compose multiple layers together to form complex visuals.
ar: قم بتكوين طبقات متعددة معا لتشكيل مرئيات معقدة.

source: Compute the contribution to the total
ar: حساب المساهمة في المجموع

source: Condition
ar: شرط

source: Conditional Formatting
ar: التنسيق الشرطي

source: Conditional formatting
ar: التنسيق الشرطي

source: Confidence interval
ar: فاصل الثقة

source: Confidence interval must be between 0 and 1 (exclusive)
ar: يجب أن يكون فاصل الثقة بين 0 و 1 (حصريا)

source: Configuration
ar: تكوين

source: Configure Advanced Time Range
ar: تكوين النطاق الزمني المتقدم

source: Configure Time Range: Last...
ar: تكوين النطاق الزمني: الأخير ...

source: Configure Time Range: Previous...
ar: تكوين النطاق الزمني: السابق...

source: Configure custom time range
ar: تكوين نطاق زمني مخصص

source: Configure filter scopes
ar: تكوين نطاقات التصفية

source: Configure the basics of your Annotation Layer.
ar: قم بتكوين أساسيات طبقة التعليقات التوضيحية.

source: Configure this dashboard to embed it into an external web application.
ar: قم بتكوين لوحة المعلومات هذه لتضمينها في تطبيق ويب خارجي.

source: Configure your how you overlay is displayed here.
ar: تكوين كيفية عرض التراكب الخاص بك هنا.

source: Confirm overwrite
ar: تأكيد الكتابة فوق

source: Confirm save
ar: تأكيد الحفظ

source: Connect
ar: عشق

source: Connect Google Sheet
ar: ربط جوجل شيت

source: Connect Google Sheets as tables to this database
ar: ربط "جداول بيانات Google" كجداول بقاعدة البيانات هذه

source: Connect a database
ar: توصيل قاعدة بيانات

source: Connect database
ar: ربط قاعدة البيانات

source: Connect this database using the dynamic form instead
ar: قم بتوصيل قاعدة البيانات هذه باستخدام النموذج الديناميكي بدلا من ذلك

source: Connect this database with a SQLAlchemy URI string instead
ar: قم بتوصيل قاعدة البيانات هذه بسلسلة URI SQLAlchemy بدلا من ذلك

source: Connection
ar: اتصال

source: Connection failed, please check your connection settings
ar: فشل الاتصال ، يرجى التحقق من إعدادات الاتصال الخاصة بك

source: Connection looks good!
ar: الاتصال يبدو جيدا!

source: Continue
ar: استمر

source: Continuous
ar: مستمر

source: Contours
ar: ملامح

source: Contribution
ar: اسهام

source: Contribution Mode
ar: وضع المساهمة

source: Control
ar: تحكم

source: Control labeled
ar: التحكم المسمى

source: Controls labeled
ar: عناصر التحكم المسماة

source: Coordinates
ar: احداثيات

source: Copied to clipboard!
ar: نسخ إلى الحافظة!

source: Copy
ar: نسخ

source: Copy SELECT statement to the clipboard
ar: نسخ عبارة SELECT إلى الحافظة

source: Copy and Paste JSON credentials
ar: نسخ بيانات اعتماد JSON ولصقها

source: Copy and paste the entire service account .json file here
ar: انسخ والصق ملف .json حساب الخدمة بالكامل هنا

source: Copy link
ar: نسخ الرابط

source: Copy message
ar: نسخ الرسالة

source: Copy of %s
ar: نسخة من %s

source: Copy partition query to clipboard
ar: نسخ استعلام القسم إلى الحافظة

source: Copy permalink to clipboard
ar: نسخ الرابط الثابت إلى الحافظة

source: Copy query URL
ar: نسخ عنوان URL لطلب البحث

source: Copy query link to your clipboard
ar: نسخ رابط الاستعلام إلى الحافظة

source: Copy the identifier of the account you are trying to connect to.
ar: انسخ معرف الحساب الذي تحاول الاتصال به.

source: Copy the name of the HTTP Path of your cluster.
ar: انسخ اسم مسار HTTP لمجموعتك.

source: Copy the name of the database you are trying to connect to.
ar: انسخ اسم قاعدة البيانات التي تحاول الاتصال بها.

source: Copy to Clipboard
ar: نسخ إلى الحافظة

source: Copy to clipboard
ar: نسخ إلى الحافظة

source: Correlation
ar: الارتباط

source: Cost estimate
ar: تقدير التكلفة

source: Could not connect to database: "%(database)s"
ar: تعذر الاتصال بقاعدة البيانات: "%(database)s"

source: Could not determine datasource type
ar: تعذر تحديد نوع مصدر البيانات

source: Could not fetch all saved charts
ar: تعذر جلب جميع المخططات المحفوظة

source: Could not find viz object
ar: تعذر العثور على كائن بمعنى

source: Could not load database driver
ar: تعذر تحميل برنامج تشغيل قاعدة البيانات

source: Could not load database driver: {}
ar: تعذر تحميل برنامج تشغيل قاعدة البيانات: {}

source: Could not resolve hostname: "%(host)s".
ar: تعذر حل اسم المضيف: "%(host)s".

source: Count
ar: عد

source: Count Unique Values
ar: عد القيم الفريدة

source: Count as Fraction of Columns
ar: العد ككسر من الأعمدة

source: Count as Fraction of Rows
ar: العد ككسر من الصفوف

source: Count as Fraction of Total
ar: عد ككسر من الإجمالي

source: Country
ar: بلد

source: Country Color Scheme
ar: نظام ألوان البلد

source: Country Column
ar: عمود البلد

source: Country Field Type
ar: نوع حقل البلد

source: Country Map
ar: خريطة البلد

source: Create
ar: خلق

source: Create Chart
ar: إنشاء مخطط

source: Create a dataset
ar: إنشاء مجموعة بيانات

source: Create a dataset to begin visualizing your data as a chart or go to SQL Lab to query your data.
ar: إنشاء مجموعة بيانات لبدء تصور بياناتك كمخطط أو الانتقال إلى SQL Lab للاستعلام عن بياناتك.

source: Create a new chart
ar: إنشاء مخطط جديد

source: Create chart
ar: إنشاء مخطط

source: Create chart with dataset
ar: إنشاء مخطط مع مجموعة بيانات

source: Create dataset
ar: إنشاء مجموعة بيانات

source: Create dataset and create chart
ar: إنشاء مجموعة بيانات وإنشاء مخطط

source: Create new chart
ar: إنشاء مخطط جديد

source: Create or select schema...
ar: إنشاء مخطط أو تحديده...

source: Created
ar: انشاء

source: Created by
ar: تم الإنشاء بواسطة

source: Created by me
ar: تم إنشاؤها بواسطتي

source: Created on
ar: تم إنشاؤه في

source: Creating SSH Tunnel failed for an unknown reason
ar: فشل إنشاء نفق SSH لسبب غير معروف

source: Creating a data source and creating a new tab
ar: إنشاء مصدر بيانات وإنشاء علامة تبويب جديدة

source: Creator
ar: خالق

source: Crimson
ar: قرمزي

source: Cross-filter will be applied to all of the charts that use this dataset.
ar: سيتم تطبيق التصفية التبادلية على جميع المخططات التي تستخدم مجموعة البيانات هذه.

source: Cross-filtering is not enabled for this dashboard.
ar: لم يتم تمكين التصفية التبادلية للوحة المعلومات هذه.

source: Cross-filtering is not enabled in this dashboard
ar: لم يتم تمكين التصفية المتقاطعة في لوحة المعلومات هذه

source: Cross-filtering scoping
ar: تحديد نطاق التصفية المتقاطعة

source: Cross-filters
ar: المرشحات المتقاطعة

source: Cumulative
ar: التراكمي

source: Currency
ar: عملة

source: Currency format
ar: تنسيق العملة

source: Currency prefix or suffix
ar: بادئة أو لاحقة العملة

source: Currency symbol
ar: رمز العملة

source: Currently rendered: %s
ar: المعروض حاليا: %s

source: Custom
ar: تقليد

source: Custom Plugin
ar: البرنامج المساعد المخصص

source: Custom Plugins
ar: الإضافات المخصصة

source: Custom SQL
ar: SQL مخصص

source: Custom SQL ad-hoc metrics are not enabled for this dataset
ar: لم يتم تمكين مقاييس SQL المخصصة المخصصة لمجموعة البيانات هذه

source: Custom SQL fields cannot contain sub-queries.
ar: لا يمكن أن تحتوي حقول SQL المخصصة على استعلامات فرعية.

source: Custom time filter plugin
ar: البرنامج المساعد لتصفية الوقت المخصص

source: Custom width of the screenshot in pixels
ar: العرض المخصص للقطة الشاشة بالبكسل

source: Customize
ar: تخصيص

source: Customize Metrics
ar: تخصيص المقاييس

source: Customize chart metrics or columns with currency symbols as prefixes or suffixes. Choose a symbol from dropdown or type your own.
ar: قم بتخصيص مقاييس الرسم البياني أو الأعمدة برموز العملات كبادئات أو لواحق. اختر رمزا من القائمة المنسدلة أو اكتب رمزك الخاص.

source: Customize columns
ar: تخصيص الأعمدة

source: Cyclic dependency detected
ar: تم الكشف عن التبعية الدورية

source: D3 Format
ar: تنسيق D3

source: D3 format
ar: تنسيق D3

source: D3 format syntax: https://github.com/d3/d3-format
ar: بناء جملة تنسيق D3: https://github.com/d3/d3-format

source: D3 number format for numbers between -1.0 and 1.0, useful when you want to have different significant digits for small and large numbers
ar: تنسيق أرقام D3 للأرقام بين -1.0 و 1.0 ، مفيد عندما تريد الحصول على أرقام مهمة مختلفة للأرقام الصغيرة والكبيرة

source: D3 time format for datetime columns
ar: تنسيق الوقت D3 لأعمدة التاريخ والوقت

source: D3 time format syntax: https://github.com/d3/d3-time-format
ar: بناء جملة تنسيق الوقت D3: https://github.com/d3/d3-time-format

source: DATETIME
ar: التاريخ والوقت

source: DB column %(col_name)s has unknown type: %(value_type)s
ar: يحتوي عمود قاعدة البيانات %(col_name)s على نوع غير معروف: %(value_type)s

source: DD/MM format dates, international and European format
ar: تواريخ تنسيق DD / MM ، التنسيق الدولي والأوروبي

source: DEC
ar: ديسمبر

source: DELETE
ar: حذف

source: DML
ar: دي إم إل

source: Daily seasonality
ar: الموسمية اليومية

source: Dark
ar: داكن

source: Dark Cyan
ar: سماوي غامق

source: Dark mode
ar: الوضع المظلم

source: Dashboard
ar: لوحه القياده

source: Dashboard [%s] just got created and chart [%s] was added to it
ar: لوحة القيادة [%s] تم إنشاؤها للتو وتمت إضافة الرسم البياني [%s] إليها

source: Dashboard [{}] just got created and chart [{}] was added to it
ar: تمت إضافة لوحة المعلومات [{}] إليها

source: Dashboard could not be deleted.
ar: تعذر حذف لوحة المعلومات.

source: Dashboard could not be updated.
ar: تعذر تحديث لوحة المعلومات.

source: Dashboard does not exist
ar: لوحة القيادة غير موجودة

source: Dashboard imported
ar: لوحة المعلومات المستوردة

source: Dashboard parameters are invalid.
ar: معلمات لوحة المعلومات غير صالحة.

source: Dashboard properties
ar: خصائص لوحة المعلومات

source: Dashboard properties updated
ar: تم تحديث خصائص لوحة المعلومات

source: Dashboard scheme
ar: مخطط لوحة القيادة

source: Dashboard time range filters apply to temporal columns defined in the filter section of each chart. Add temporal columns to the chart filters to have this dashboard filter impact those charts.
ar: تنطبق عوامل تصفية النطاق الزمني للوحة المعلومات على الأعمدة الزمنية المحددة في قسم التصفية لكل مخطط. إضافة أعمدة زمنية إلى المخطط عوامل التصفية لجعل عامل تصفية لوحة المعلومات هذا يؤثر على تلك المخططات.

source: Dashboard title
ar: عنوان لوحة المعلومات

source: Dashboard usage
ar: استخدام لوحة القيادة

source: Dashboards
ar: لوحات

source: Dashboards added to
ar: لوحات المعلومات المضافة إلى

source: Dashboards could not be created.
ar: تعذر إنشاء لوحات المعلومات.

source: Dashboards do not exist
ar: لوحات المعلومات غير موجودة

source: Dashed
ar: متقطع

source: Data
ar: بيانات

source: DataFrame include at least one series
ar: يتضمن DataFrame سلسلة واحدة على الأقل

source: DataFrame must include temporal column
ar: يجب أن يتضمن DataFrame عمودا زمنيا

source: Data Table
ar: جدول البيانات

source: Data URI is not allowed.
ar: لا يسمح باستخدام عنوان URI للبيانات.

source: Data Zoom
ar: تكبير البيانات

source: Data could not be deserialized from the results backend. The storage format might have changed, rendering the old data stake. You need to re-run the original query.
ar: لا يمكن إلغاء تسلسل البيانات من الواجهة الخلفية للنتائج. ربما تغير تنسيق التخزين ، مما يجعل حصة البيانات القديمة. تحتاج إلى إعادة تشغيل الاستعلام الأصلي.

source: Data could not be retrieved from the results backend. You need to re-run the original query.
ar: تعذر استرداد البيانات من الواجهة الخلفية للنتائج. تحتاج إلى إعادة تشغيل الاستعلام الأصلي.

source: Data preview
ar: معاينة البيانات

source: Data refreshed
ar: تم تحديث البيانات

source: Data type
ar: نوع البيانات

source: Database
ar: قاعدة بيانات

source: Database "%(database_name)s" schema "%(schema_name)s" is not allowed for columnar uploads. Please contact your Superset Admin.
ar: قاعدة البيانات "%(database_name)s" مخطط "%(schema_name)s" غير مسموح به للتحميلات العمودية. يرجى الاتصال بمسؤول Superset الخاص بك.

source: Database "%(database_name)s" schema "%(schema_name)s" is not allowed for csv uploads. Please contact your Superset Admin.
ar: قاعدة البيانات "%(database_name)s" مخطط "%(schema_name)s" غير مسموح به لتحميلات csv. يرجى الاتصال بمسؤول Superset الخاص بك.

source: Database "%(database_name)s" schema "%(schema_name)s" is not allowed for excel uploads. Please contact your Superset Admin.
ar: قاعدة البيانات "%(database_name)s" مخطط "%(schema_name)s" غير مسموح به لتحميلات Excel. يرجى الاتصال بمسؤول Superset الخاص بك.

source: Database Connections
ar: اتصالات قاعدة البيانات

source: Database Creation Error
ar: خطأ في إنشاء قاعدة البيانات

source: Database connected
ar: قاعدة البيانات متصلة

source: Database could not be created.
ar: تعذر إنشاء قاعدة بيانات.

source: Database could not be deleted.
ar: تعذر حذف قاعدة البيانات.

source: Database could not be updated.
ar: تعذر تحديث قاعدة البيانات.
