Repository: rajpal-1/superset
Catalog: superset/translations/*/LC_MESSAGES/messages.po
Languages: ar

source: Database does not allow data manipulation.
ar: قاعدة البيانات لا تسمح بمعالجة البيانات.

source: Database does not exist
ar: قاعدة البيانات غير موجودة

source: Database does not support subqueries
ar: قاعدة البيانات لا تدعم الاستعلامات الفرعية

source: Database driver for importing maybe not installed. Visit the Superset documentation page for installation instructions:
ar: برنامج تشغيل قاعدة البيانات للاستيراد ربما غير مثبت. تفضل بزيارة صفحة وثائق Superset للحصول على إرشادات التثبيت:

source: Database error
ar: خطأ في قاعدة البيانات

source: Database is offline.
ar: قاعدة البيانات غير متصلة.

source: Database is required for alerts
ar: قاعدة البيانات مطلوبة للتنبيهات

source: Database name
ar: اسم قاعدة البيانات

source: Database not allowed to change
ar: قاعدة البيانات غير مسموح بتغييرها

source: Database not found.
ar: لم يتم العثور على قاعدة البيانات.

source: Database parameters are invalid.
ar: معلمات قاعدة البيانات غير صالحة.

source: Database passwords
ar: كلمات مرور قاعدة البيانات

source: Database port
ar: منفذ قاعدة البيانات

source: Database settings updated
ar: تم تحديث إعدادات قاعدة البيانات

source: Databases
ar: قواعد البيانات

source: Dataframe Index
ar: فهرس إطار البيانات

source: Dataset
ar: مجموعة البيانات

source: Dataset %(name)s already exists
ar: مجموعة البيانات %(name)s موجودة بالفعل

source: Dataset Name
ar: اسم مجموعة البيانات

source: Dataset column delete failed.
ar: فشل حذف عمود مجموعة البيانات.

source: Dataset column not found.
ar: لم يتم العثور على عمود مجموعة البيانات.

source: Dataset could not be created.
ar: تعذر إنشاء مجموعة بيانات.

source: Dataset could not be duplicated.
ar: تعذر تكرار مجموعة البيانات.

source: Dataset could not be updated.
ar: تعذر تحديث مجموعة البيانات.

source: Dataset does not exist
ar: مجموعة البيانات غير موجودة

source: Dataset imported
ar: مجموعة البيانات المستوردة

source: Dataset is required
ar: مجموعة البيانات مطلوبة

source: Dataset metric delete failed.
ar: فشل حذف مقياس مجموعة البيانات.

source: Dataset metric not found.
ar: لم يتم العثور على مقياس مجموعة البيانات.

source: Dataset name
ar: اسم مجموعة البيانات

source: Dataset parameters are invalid.
ar: معلمات مجموعة البيانات غير صالحة.

source: Dataset schema is invalid, caused by: %(error)s
ar: مخطط مجموعة البيانات غير صالح، بسبب ما يلي: %(error)s

source: Datasets
ar: مجموعات البيانات

source: Datasets can be created from database tables or SQL queries. Select a database table to the left or
ar: يمكن إنشاء مجموعات البيانات من جداول قاعدة البيانات أو استعلامات SQL. حدد جدول قاعدة بيانات إلى اليسار أو

source: Datasets can have a main temporal column (main_dttm_col), but can also have secondary time columns. When this attribute is true, whenever the secondary columns are filtered, the same filter is applied to the main datetime column.
ar: يمكن أن تحتوي مجموعات البيانات على عمود زمني رئيسي (main_dttm_col) ، ولكن يمكن أن تحتوي أيضا على أعمدة زمنية ثانوية. عندما تكون هذه السمة صحيحة، كلما تمت تصفية الأعمدة الثانوية، يتم تطبيق عامل التصفية نفسه على عمود التاريخ والوقت الرئيسي.

source: Datasets could not be deleted.
ar: تعذر حذف مجموعات البيانات.

source: Datasets do not contain a temporal column
ar: لا تحتوي مجموعات البيانات على عمود زمني

source: Datasource
ar: مصدر البيانات

source: Datasource & Chart Type
ar: مصدر البيانات ونوع المخطط

source: Datasource does not exist
ar: مصدر البيانات غير موجود

source: Datasource type is invalid
ar: نوع مصدر البيانات غير صالح

source: Datasource type is required when datasource_id is given
ar: نوع مصدر البيانات مطلوب عند إعطاء datasource_id

source: Date/Time
ar: التاريخ/الوقت

source: Date Time Format
ar: تنسيق التاريخ والوقت

source: Date format
ar: تنسيق التاريخ

source: Date format string
ar: سلسلة تنسيق التاريخ

source: Datetime Format
ar: تنسيق التاريخ والوقت

source: Datetime column not provided as part table configuration and is required by this type of chart
ar: لا يتم توفير عمود التاريخ والوقت كتكوين جدول جزئي وهو مطلوب بواسطة هذا النوع من المخططات

source: Datetime format
ar: تنسيق التاريخ والوقت

source: Day
ar: يوم

source: Day First
ar: اليوم الأول

source: Day (freq=D)
ar: اليوم (التكرار = D)

source: Days %s
ar: أيام %s

source: Db engine did not return all queried columns
ar: لم يرجع محرك db جميع الأعمدة التي تم الاستعلام عنها

source: Deactivate
ar: الغاء تنشيط

source: December
ar: ديسمبر

source: Decides which column to sort the base axis by.
ar: يقرر العمود الذي سيتم فرز المحور الأساسي حسبه.

source: Decides which measure to sort the base axis by.
ar: يقرر المقياس الذي يجب فرز المحور الأساسي حسبه.

source: Decimal Character
ar: حرف عشري

source: Deck.gl - 3D Grid
ar: Deck.gl - شبكة 3D

source: Deck.gl - 3D HEX
ar: Deck.gl - 3D عرافة

source: Deck.gl - Arc
ar: Deck.gl - قوس

source: Deck.gl - Contour
ar: Deck.gl - كفاف

source: Deck.gl - GeoJSON
ar: Deck.gl - جيوجسون

source: Deck.gl - Heatmap
ar: Deck.gl - خريطة التمثيل اللوني

source: Deck.gl - Multiple Layers
ar: Deck.gl - طبقات متعددة

source: Deck.gl - Paths
ar: Deck.gl - المسارات

source: Deck.gl - Polygon
ar: Deck.gl - مضلع

source: Deck.gl - Scatter plot
ar: Deck.gl - مؤامرة مبعثر

source: Deck.gl - Screen Grid
ar: Deck.gl - شبكة الشاشة

source: Decrease
ar: نقصان

source: Default Endpoint
ar: نقطة النهاية الافتراضية

source: Default URL
ar: URL الافتراضي

source: Default URL to redirect to when accessing from the dataset list page
ar: عنوان URL الافتراضي لإعادة التوجيه إليه عند الوصول من صفحة قائمة مجموعة البيانات

source: Default Value
ar: القيمة الافتراضية

source: Default datetime
ar: التاريخ والوقت الافتراضي

source: Default latitude
ar: خط العرض الافتراضي

source: Default longitude
ar: خط الطول الافتراضي

source: Default minimal column width in pixels, actual width may still be larger than this if other columns don't need much space
ar: الحد الأدنى الافتراضي لعرض العمود بالبكسل، قد يظل العرض الفعلي أكبر من هذا إذا كانت الأعمدة الأخرى لا تحتاج إلى مساحة كبيرة

source: Default value is required
ar: القيمة الافتراضية مطلوبة

source: Default value must be set when "Filter has default value" is checked
ar: يجب تعيين القيمة الافتراضية عند تحديد «عامل التصفية له قيمة افتراضية»

source: Default value must be set when "Filter value is required" is checked
ar: يجب تعيين القيمة الافتراضية عند تحديد «قيمة التصفية مطلوبة»

source: Default value set automatically when "Select first filter value by default" is checked
ar: يتم تعيين القيمة الافتراضية تلقائيًا عند تحديد «تحديد قيمة التصفية الأولى افتراضيًا»

source: Define a function that receives the input and outputs the content for a tooltip
ar: حدد وظيفة تستقبل المدخلات وتخرج المحتوى لتلميح الأدوات

source: Define a function that returns a URL to navigate to when user clicks
ar: حدد وظيفة تقوم بإرجاع عنوان URL للانتقال إليه عندما ينقر المستخدم

source: Define a javascript function that receives the data array used in the visualization and is expected to return a modified version of that array. This can be used to alter properties of the data, filter, or enrich the array.
ar: حدد وظيفة جافا سكريبت التي تستقبل مصفوفة البيانات المستخدمة في التصور ومن المتوقع أن تقوم بإرجاع نسخة معدلة من تلك المصفوفة. يمكن استخدام هذا لتغيير خصائص البيانات أو التصفية أو إثراء المصفوفة.

source: Define contour layers. Isolines represent a collection of line segments that serparate the area above and below a given threshold. Isobands represent a collection of polygons that fill the are containing values in a given threshold range.
ar: حدد طبقات الكنتور. تمثل Isolines مجموعة من مقاطع الخط التي تفصل المنطقة فوق وتحت عتبة معينة. تمثل Isobands مجموعة من المضلعات التي تملأ القيم المحتوية في نطاق عتبة معين.

source: Defines a rolling window function to apply, works along with the [Periods] text box
ar: يحدد وظيفة النافذة الدوارة للتطبيق، ويعمل جنبًا إلى جنب مع مربع نص [الفترات]

source: Defines how each series is broken down
ar: يحدد كيفية تقسيم كل سلسلة

source: Defines the grid size in pixels
ar: يحدد حجم الشبكة بالبكسل

source: Defines the grouping of entities. Each series is represented by a specific color in the chart.
ar: يحدد تجميع الكيانات. يتم تمثيل كل سلسلة بلون معين في المخطط.

source: Defines the grouping of entities. Each series is shown as a specific color on the chart and has a legend toggle
ar: يحدد تجميع الكيانات. يتم عرض كل سلسلة بلون معين على الرسم البياني وتحتوي على مفتاح تبديل وسيلة الإيضاح

source: Defines the size of the rolling window function, relative to the time granularity selected
ar: يحدد حجم وظيفة النافذة الدوارة، بالنسبة إلى دقة الوقت المحددة

source: Defines the value that determines the boundary between different regions or levels in the data
ar: يحدد القيمة التي تحدد الحدود بين المناطق أو المستويات المختلفة في البيانات

source: Defines whether the step should appear at the beginning, middle or end between two data points
ar: يحدد ما إذا كان يجب أن تظهر الخطوة في البداية أو الوسط أو النهاية بين نقطتي بيانات

source: Delete
ar: حذف

source: Delete %s?
ar: حذف%s؟

source: Delete Annotation?
ar: حذف التعليق التوضيحي؟

source: Delete Database?
ar: حذف قاعدة البيانات؟

source: Delete Dataset?
ar: حذف مجموعة البيانات؟

source: Delete Layer?
ar: حذف الطبقة؟

source: Delete Query?
ar: حذف الاستعلام؟

source: Delete Report?
ar: حذف التقرير؟

source: Delete Template?
ar: هل تريد حذف القالب؟

source: Delete all Really?
ar: حذف الكل حقًا?

source: Delete annotation
ar: حذف التعليق التوضيحي

source: Delete dashboard tab?
ar: حذف علامة تبويب لوحة المعلومات؟

source: Delete database
ar: حذف قاعدة البيانات

source: Delete email report
ar: حذف تقرير البريد الإلكتروني

source: Delete query
ar: حذف الاستعلام

source: Delete template
ar: حذف القالب

source: Delete this container and save to remove this message.
ar: احذف هذه الحاوية واحفظها لإزالة هذه الرسالة.

source: Deleted
ar: تم الحذف

source: Deleted: %s
ar: تم الحذف: %s

source: Deleted %s
ar: تم الحذف %s

source: Deleting a tab will remove all content within it. You may still reverse this action with the
ar: سيؤدي حذف علامة تبويب إلى إزالة كل المحتوى داخلها. لا يزال بإمكانك عكس هذا الإجراء باستخدام

source: Delimited long & lat single column
ar: عمود واحد طويل ومسطح محدد

source: Delimiter
ar: محدد

source: Delivery method
ar: طريقة التوصيل

source: Demographics
ar: التركيبة السكانية

source: Density
ar: الكثافة

source: Dependent on
ar: يعتمد على

source: Deprecated
ar: تم إهماله

source: Description
ar: وصف

source: Description Columns
ar: أعمدة الوصف

source: Description (this can be seen in the list)
ar: الوصف (يمكن رؤية ذلك في القائمة)

source: Description text that shows up below your Big Number
ar: نص الوصف الذي يظهر أسفل رقمك الكبير

source: Deselect all
ar: إلغاء تحديد الكل

source: Details
ar: التفاصيل

source: Details of the certification
ar: تفاصيل الشهادة

source: Determines how whiskers and outliers are calculated.
ar: يحدد كيفية حساب الشوارب والقيم المتطرفة.

source: Determines whether or not this dashboard is visible in the list of all dashboards
ar: يحدد ما إذا كانت لوحة المعلومات هذه مرئية أم لا في قائمة جميع لوحات المعلومات

source: Diamond
ar: الماس

source: Did you mean:
ar: هل تقصد:

source: Difference
ar: اختلاف

source: Dim Gray
ar: رمادي خافت

source: Dimension
ar: البُعد

source: Dimension to use on x-axis.
ar: البعد المراد استخدامه على المحور السيني.

source: Dimension to use on y-axis.
ar: البعد المراد استخدامه على المحور y.

source: Dimensions
ar: أبعاد

source: Dimensions contain qualitative values such as names, dates, or geographical data. Use dimensions to categorize, segment, and reveal the details in your data. Dimensions affect the level of detail in the view.
ar: تحتوي الأبعاد على قيم نوعية مثل الأسماء أو التواريخ أو البيانات الجغرافية. استخدم الأبعاد لتصنيف التفاصيل في بياناتك وتقسيمها والكشف عنها. تؤثر الأبعاد على مستوى التفاصيل في العرض.

source: Directed Force Layout
ar: تخطيط القوة الموجهة

source: Directional
ar: اتجاهي

source: Disable SQL Lab data preview queries
ar: تعطيل استعلامات معاينة بيانات SQL Lab

source: Disable data preview when fetching table metadata in SQL Lab. Useful to avoid browser performance issues when using databases with very wide tables.
ar: قم بتعطيل معاينة البيانات عند جلب بيانات تعريف الجدول في SQL Lab. مفيد لتجنب مشاكل أداء المتصفح عند استخدام قواعد البيانات ذات الجداول الواسعة جدًا.

source: Disable embedding?
ar: تعطيل التضمين؟

source: Disabled
ar: مُعطل

source: Discard
ar: تجاهل

source: Discrete
ar: منفصلة

source: Display
ar: شاشة

source: Display Name
ar: اسم العرض

source: Display column level subtotal
ar: المجموع الفرعي لمستوى عمود العرض

source: Display column level total
ar: إجمالي مستوى عمود العرض

source: Display configuration
ar: تكوين العرض

source: Display metrics side by side within each column, as opposed to each column being displayed side by side for each metric.
ar: اعرض المقاييس جنبًا إلى جنب داخل كل عمود، بدلاً من عرض كل عمود جنبًا إلى جنب لكل مقياس.

source: Display percents in the label and tooltip as the percent of the total value, from the first step of the funnel, or from the previous step in the funnel.
ar: اعرض النسب المئوية في التسمية وتلميح الأدوات كنسبة مئوية من القيمة الإجمالية، من الخطوة الأولى لمسار التحويل، أو من الخطوة السابقة في مسار التحويل.

source: Display row level subtotal
ar: المجموع الفرعي لمستوى صف العرض

source: Display row level total
ar: إجمالي مستوى صف العرض

source: Display settings
ar: إعدادات العرض

source: Displays connections between entities in a graph structure. Useful for mapping relationships and showing which nodes are important in a network. Graph charts can be configured to be force-directed or circulate. If your data has a geospatial component, try the deck.gl Arc chart.
ar: يعرض الاتصالات بين الكيانات في بنية الرسم البياني. مفيد لتخطيط العلاقات وإظهار العقد المهمة في الشبكة. يمكن تكوين مخططات الرسم البياني بحيث يتم توجيهها بالقوة أو تعميمها. إذا كانت بياناتك تحتوي على مكون جغرافي مكاني، فجرّب مخطط deck.gl Arc.

source: Distribute across
ar: قم بالتوزيع عبر

source: Distribution
ar: التوزيع

source: Distribution - Bar Chart
ar: التوزيع - مخطط شريطي

source: Divider
ar: مقسم

source: Do you want a donut or a pie?
ar: هل تريد دونات أو فطيرة؟

source: Documentation
ar: التوثيق

source: Domain
ar: اسم النطاق

source: Donut
ar: دونات

source: Dotted
ar: منقط

source: Download
ar: تنزيل

source: Download as Image
ar: تنزيل كصورة

source: Download as image
ar: تنزيل كصورة

source: Download to CSV
ar: تنزيل إلى CSV

source: Draft
ar: مسودة

source: Drag and drop components and charts to the dashboard
ar: قم بسحب المكونات والمخططات وإسقاطها في لوحة المعلومات

source: Drag and drop components to this tab
ar: قم بسحب المكونات وإسقاطها إلى علامة التبويب هذه

source: Draw a marker on data points. Only applicable for line types.
ar: ارسم علامة على نقاط البيانات. ينطبق فقط على أنواع الخطوط.

source: Draw area under curves. Only applicable for line types.
ar: ارسم منطقة أسفل المنحنيات. ينطبق فقط على أنواع الخطوط.

source: Draw line from Pie to label when labels outside?
ar: ارسم خطًا من الفطيرة إلى الملصق عندما تكون الملصقات بالخارج؟

source: Draw split lines for minor axis ticks
ar: ارسم خطوطًا منقسمة لعلامات المحور الثانوية

source: Draw split lines for minor y-axis ticks
ar: ارسم خطوطًا منقسمة لعلامات المحور الصادي الصغيرة

source: Drill by
ar: قم بالتنقيب عن طريق

source: Drill by: %s
ar: قم بالتنقيب عن طريق: %s

source: Drill by is not available for this data point
ar: Drill by غير متاح لنقطة البيانات هذه

source: Drill by is not yet supported for this chart type
ar: تطبيق Drill by غير مدعوم حتى الآن لهذا النوع من المخططات

source: Drill to detail
ar: قم بالتنقيب عن التفاصيل

source: Drill to detail: %s
ar: قم بالتنقيب عن التفاصيل: %s

source: Drill to detail by
ar: انتقل إلى التفاصيل عن طريق

source: Drill to detail by value is not yet supported for this chart type.
ar: لا يتم دعم البحث عن التفاصيل حسب القيمة حتى الآن لهذا النوع من المخططات.

source: Drill to detail is disabled because this chart does not group data by dimension value.
ar: تم تعطيل تطبيق Drill to detail لأن هذا المخطط لا يجمع البيانات حسب قيمة البعد.

source: Drop a temporal column here or click
ar: ضع عمودًا مؤقتًا هنا أو انقر

source: Drop columns/metrics here or click
ar: قم بإسقاط الأعمدة/المقاييس هنا أو انقر

source: Duplicate
ar: مكرر

source: Duplicate column/metric labels: %(labels)s. Please make sure all columns and metrics have a unique label.
ar: تسميات الأعمدة/المترية المكررة:. %(labels)s يرجى التأكد من أن جميع الأعمدة والمقاييس لها تصنيف فريد.

source: Duplicate column name(s): %(columns)s
ar: اسم (أسماء) الأعمدة المكررة: %(columns)s

source: Duplicate dataset
ar: مجموعة بيانات مكررة

source: Duplicate tab
ar: علامة تبويب مكررة

source: Duration
ar: المدّة

source: Duration (in seconds) of the caching timeout for charts of this database. A timeout of 0 indicates that the cache never expires, and -1 bypasses the cache. Note this defaults to the global timeout if undefined.
ar: المدة (بالثواني) من مهلة التخزين المؤقت لمخططات قاعدة البيانات هذه. تشير المهلة 0 إلى أن ذاكرة التخزين المؤقت لا تنتهي أبدًا، وأن -1 يتجاوز ذاكرة التخزين المؤقت. لاحظ أن هذه الإعدادات الافتراضية هي المهلة العالمية إذا لم يتم تحديدها.

source: Duration (in seconds) of the caching timeout for charts of this database. A timeout of 0 indicates that the cache never expires. Note this defaults to the global timeout if undefined.
ar: المدة (بالثواني) من مهلة التخزين المؤقت لمخططات قاعدة البيانات هذه. تشير المهلة 0 إلى أن ذاكرة التخزين المؤقت لا تنتهي أبدًا. لاحظ أن هذه الإعدادات الافتراضية هي المهلة العالمية إذا لم يتم تحديدها.

source: Duration (in seconds) of the caching timeout for this chart. Note this defaults to the datasource/table timeout if undefined.
ar: المدة (بالثواني) لمهلة التخزين المؤقت لهذا المخطط. لاحظ هذه الإعدادات الافتراضية لمصدر البيانات/مهلة الجدول إذا لم يتم تحديدها.

source: Duration (in seconds) of the caching timeout for this chart. Set to -1 to bypass the cache. Note this defaults to the dataset's timeout if undefined.
ar: المدة (بالثواني) لمهلة التخزين المؤقت لهذا المخطط. اضبط على -1 لتجاوز ذاكرة التخزين المؤقت. لاحظ هذه الإعدادات الافتراضية لمهلة مجموعة البيانات إذا لم يتم تحديدها.

source: Duration (in seconds) of the caching timeout for this table. A timeout of 0 indicates that the cache never expires. Note this defaults to the database timeout if undefined.
ar: المدة (بالثواني) لمهلة التخزين المؤقت لهذا الجدول. تشير المهلة 0 إلى أن ذاكرة التخزين المؤقت لا تنتهي أبدًا. لاحظ هذه الإعدادات الافتراضية لمهلة قاعدة البيانات إذا لم يتم تحديدها.

source: Duration (in seconds) of the metadata caching timeout for schemas of this database. If left unset, the cache never expires.
ar: المدة (بالثواني) لمهلة التخزين المؤقت للبيانات الوصفية لمخططات قاعدة البيانات هذه. في حالة عدم ضبطها، لن تنتهي صلاحية ذاكرة التخزين المؤقت أبدًا.

source: Duration (in seconds) of the metadata caching timeout for tables of this database. If left unset, the cache never expires.
ar: المدة (بالثواني) لمهلة التخزين المؤقت للبيانات الوصفية لجداول قاعدة البيانات هذه. في حالة عدم ضبطها، لن تنتهي صلاحية ذاكرة التخزين المؤقت أبدًا.

source: Duration in ms (100.40008 => 100ms 400µs 80ns)
ar: المدة بالمللي ثانية (100.40008 => 100 مللي ثانية 400 ميكرو ثانية 80 نانوثانية)

source: Duration in ms (1.40008 => 1ms 400µs 80ns)
ar: المدة بالمللي ثانية (1.40008 => 1 مللي ثانية 400 ميكرو ثانية 80 نانوثانية)

source: Duration in ms (66000 => 1m 6s)
ar: المدة بالمللي ثانية (66000 => 1 م 6 ثانية)

source: Dynamic Aggregation Function
ar: وظيفة التجميع الديناميكي

source: Dynamically search all filter values
ar: ابحث ديناميكيًا عن جميع قيم التصفية

source: ECharts
ar: الرسوم البيانية الإلكترونية

source: EMAIL_REPORTS_CTA
ar: تقارير_البريد الإلكتروني_CTA

source: END (EXCLUSIVE)
ar: النهاية (حصرية)

source: ERROR
ar: خطأ

source: ERROR: %s
ar: خطأ: %s

source: Edge length
ar: طول الحافة

source: Edge length between nodes
ar: طول الحافة بين العقد

source: Edge symbols
ar: رموز الحافة

source: Edge width
ar: عرض الحافة

source: Edit
ar: تحرير

source: Edit Alert
ar: تحرير التنبيه

source: Edit CSS
ar: تحرير CSS

source: Edit CSS Template
ar: تحرير قالب CSS

source: Edit CSS template properties
ar: تحرير خصائص قالب CSS

source: Edit Chart
ar: تحرير المخطط

source: Edit Chart Properties
ar: تحرير خصائص المخطط

source: Edit Column
ar: تحرير العمود

source: Edit Dashboard
ar: تحرير لوحة التحكم

source: Edit Database
ar: تحرير قاعدة البيانات

source: Edit Dataset
ar: تحرير مجموعة البيانات

source: Edit Log
ar: تحرير السجل

source: Edit Metric
ar: تحرير المقياس

source: Edit Plugin
ar: تحرير المكون الإضافي

source: Edit Report
ar: تحرير التقرير

source: Edit Rule
ar: تحرير القاعدة

source: Edit Table
ar: تحرير الجدول

source: Edit Tag
ar: تحرير العلامة

source: Edit annotation
ar: تحرير التعليق التوضيحي

source: Edit annotation layer
ar: تحرير طبقة التعليقات التوضيحية

source: Edit annotation layer properties
ar: تحرير خصائص طبقة التعليقات التوضيحية

source: Edit chart
ar: تحرير المخطط

source: Edit chart properties
ar: تحرير خصائص المخطط

source: Edit dashboard
ar: تحرير لوحة التحكم

source: Edit database
ar: تحرير قاعدة البيانات

source: Edit dataset
ar: تحرير مجموعة البيانات

source: Edit email report
ar: تحرير تقرير البريد الإلكتروني

source: Edit formatter
ar: تحرير المنسق

source: Edit properties
ar: تحرير الخصائص

source: Edit query
ar: تحرير استعلام

source: Edit template
ar: تحرير القالب

source: Edit template parameters
ar: تحرير معاملات القالب

source: Edit the dashboard
ar: تحرير لوحة المعلومات

source: Edit time range
ar: تحرير النطاق الزمني

source: Edited
ar: تم تحريره

source: Editing 1 filter:
ar: تحرير فلتر واحد:

source: Either the database is spelled incorrectly or does not exist.
ar: إما أن قاعدة البيانات مكتوبة بشكل غير صحيح أو غير موجودة.

source: Either the username "%(username)s", password, or database name "%(database)s" is incorrect.
ar: إما أن اسم المستخدم "%(username)s«أو كلمة المرور أو اسم قاعدة البيانات" %(database)s "غير صحيح.

source: Either the username "%(username)s" or the password is incorrect.
ar: إما أن اسم المستخدم %(username)s "" أو كلمة المرور غير صحيحة.

source: Either the username or the password is wrong.
ar: إما أن اسم المستخدم أو كلمة المرور خاطئين.

source: Elevation
ar: الارتفاع

source: Email reports active
ar: تقارير البريد الإلكتروني نشطة

source: Embed
ar: تضمين

source: Embed code
ar: كود التضمين

source: Embed dashboard
ar: تضمين لوحة معلومات

source: Embedding deactivated.
ar: تم إلغاء التضمين.

source: Emit Filter Events
ar: أحداث تصفية الانبعاثات

source: Emphasis
ar: توكيد

source: Employment and education
ar: التوظيف والتعليم

source: Empty circle
ar: دائرة فارغة

source: Empty collection
ar: مجموعة فارغة

source: Empty column
ar: عمود فارغ

source: Empty query?
ar: استعلام فارغ؟

source: Empty query result
ar: نتيجة استعلام فارغة

source: Empty row
ar: صف فارغ

source: Enable 'Allow file uploads to database' in any database's settings
ar: قم بتمكين «السماح بتحميل الملفات إلى قاعدة البيانات» في إعدادات أي قاعدة بيانات

source: Enable Filter Select
ar: تمكين تحديد عامل التصفية

source: Enable cross-filtering
ar: تمكين التصفية المتقاطعة

source: Enable data zooming controls
ar: تمكين عناصر التحكم في تكبير البيانات

source: Enable embedding
ar: تمكين التضمين

source: Enable forecast
ar: تمكين التنبؤ

source: Enable forecasting
ar: تمكين التنبؤ

source: Enable graph roaming
ar: تمكين تجوال الرسم البياني

source: Enable node dragging
ar: تمكين سحب العقدة

source: Enable query cost estimation
ar: تمكين تقدير تكلفة الاستعلام

source: Enable row expansion in schemas
ar: تمكين توسيع الصفوف في المخططات

source: Enable server side pagination of results (experimental feature)
ar: تمكين ترقيم الصفحات من جانب الخادم (ميزة تجريبية)

source: Encountered invalid NULL spatial entry, please consider filtering those out
ar: تمت مصادفة إدخال مكاني NULL غير صالح، يرجى التفكير في تصفيتها

source: End
ar: النهاية

source: End Longitude & Latitude
ar: خط الطول النهائي وخط العرض
